MikroElektronika/core_packages/PIC/XC8/def/PIC16F946/mcu.h
extern volatile EEDATLbits_t EEDATLbits __at(0x10C);
// bitfield macros
#define _EEDATL_EEDATL_POSN                                 0x0
#define _EEDATL_EEDATL_POSITION                             0x0
#define _EEDATL_EEDATL_SIZE                                 0x8
#define _EEDATL_EEDATL_LENGTH                               0x8
#define _EEDATL_EEDATL_MASK                                 0xFF
#define _EEDATL_EEDATL0_POSN                                0x0
#define _EEDATL_EEDATL0_POSITION                            0x0
#define _EEDATL_EEDATL0_SIZE                                0x1
#define _EEDATL_EEDATL0_LENGTH                              0x1
#define _EEDATL_EEDATL0_MASK                                0x1
#define _EEDATL_EEDATL1_POSN                                0x1
#define _EEDATL_EEDATL1_POSITION                            0x1
#define _EEDATL_EEDATL1_SIZE                                0x1
#define _EEDATL_EEDATL1_LENGTH                              0x1
#define _EEDATL_EEDATL1_MASK                                0x2
#define _EEDATL_EEDATL2_POSN                                0x2
#define _EEDATL_EEDATL2_POSITION                            0x2
#define _EEDATL_EEDATL2_SIZE                                0x1
#define _EEDATL_EEDATL2_LENGTH                              0x1
#define _EEDATL_EEDATL2_MASK                                0x4
#define _EEDATL_EEDATL3_POSN                                0x3
#define _EEDATL_EEDATL3_POSITION                            0x3
#define _EEDATL_EEDATL3_SIZE                                0x1
#define _EEDATL_EEDATL3_LENGTH                              0x1
#define _EEDATL_EEDATL3_MASK                                0x8
#define _EEDATL_EEDATL4_POSN                                0x4
#define _EEDATL_EEDATL4_POSITION                            0x4
#define _EEDATL_EEDATL4_SIZE                                0x1
#define _EEDATL_EEDATL4_LENGTH                              0x1
#define _EEDATL_EEDATL4_MASK                                0x10
#define _EEDATL_EEDATL5_POSN                                0x5
#define _EEDATL_EEDATL5_POSITION                            0x5
#define _EEDATL_EEDATL5_SIZE                                0x1
#define _EEDATL_EEDATL5_LENGTH                              0x1
#define _EEDATL_EEDATL5_MASK                                0x20
#define _EEDATL_EEDATL6_POSN                                0x6
#define _EEDATL_EEDATL6_POSITION                            0x6
#define _EEDATL_EEDATL6_SIZE                                0x1
#define _EEDATL_EEDATL6_LENGTH                              0x1
#define _EEDATL_EEDATL6_MASK                                0x40
#define _EEDATL_EEDATL7_POSN                                0x7
#define _EEDATL_EEDATL7_POSITION                            0x7
#define _EEDATL_EEDATL7_SIZE                                0x1
#define _EEDATL_EEDATL7_LENGTH                              0x1
#define _EEDATL_EEDATL7_MASK                                0x80
// alias bitfield definitions
typedef union {
    struct {
        unsigned EEDATL                 :8;
    };
    struct {
        unsigned EEDATL0                :1;
        unsigned EEDATL1                :1;
        unsigned EEDATL2                :1;
        unsigned EEDATL3                :1;
        unsigned EEDATL4                :1;
        unsigned EEDATL5                :1;
        unsigned EEDATL6                :1;
        unsigned EEDATL7                :1;
    };
} EEDATAbits_t;
extern volatile EEDATAbits_t EEDATAbits __at(0x10C);
// bitfield macros
#define _EEDATA_EEDATL_POSN                                 0x0
#define _EEDATA_EEDATL_POSITION                             0x0
#define _EEDATA_EEDATL_SIZE                                 0x8
#define _EEDATA_EEDATL_LENGTH                               0x8
#define _EEDATA_EEDATL_MASK                                 0xFF
#define _EEDATA_EEDATL0_POSN                                0x0
#define _EEDATA_EEDATL0_POSITION                            0x0
#define _EEDATA_EEDATL0_SIZE                                0x1
#define _EEDATA_EEDATL0_LENGTH                              0x1
#define _EEDATA_EEDATL0_MASK                                0x1
#define _EEDATA_EEDATL1_POSN                                0x1
#define _EEDATA_EEDATL1_POSITION                            0x1
#define _EEDATA_EEDATL1_SIZE                                0x1
#define _EEDATA_EEDATL1_LENGTH                              0x1
#define _EEDATA_EEDATL1_MASK                                0x2
#define _EEDATA_EEDATL2_POSN                                0x2
#define _EEDATA_EEDATL2_POSITION                            0x2
#define _EEDATA_EEDATL2_SIZE                                0x1
#define _EEDATA_EEDATL2_LENGTH                              0x1
#define _EEDATA_EEDATL2_MASK                                0x4
#define _EEDATA_EEDATL3_POSN                                0x3
#define _EEDATA_EEDATL3_POSITION                            0x3
#define _EEDATA_EEDATL3_SIZE                                0x1
#define _EEDATA_EEDATL3_LENGTH                              0x1
#define _EEDATA_EEDATL3_MASK                                0x8
#define _EEDATA_EEDATL4_POSN                                0x4
#define _EEDATA_EEDATL4_POSITION                            0x4
#define _EEDATA_EEDATL4_SIZE                                0x1
#define _EEDATA_EEDATL4_LENGTH                              0x1
#define _EEDATA_EEDATL4_MASK                                0x10
#define _EEDATA_EEDATL5_POSN                                0x5
#define _EEDATA_EEDATL5_POSITION                            0x5
#define _EEDATA_EEDATL5_SIZE                                0x1
#define _EEDATA_EEDATL5_LENGTH                              0x1
#define _EEDATA_EEDATL5_MASK                                0x20
#define _EEDATA_EEDATL6_POSN                                0x6
#define _EEDATA_EEDATL6_POSITION                            0x6
#define _EEDATA_EEDATL6_SIZE                                0x1
#define _EEDATA_EEDATL6_LENGTH                              0x1
#define _EEDATA_EEDATL6_MASK                                0x40
#define _EEDATA_EEDATL7_POSN                                0x7
#define _EEDATA_EEDATL7_POSITION                            0x7
#define _EEDATA_EEDATL7_SIZE                                0x1
#define _EEDATA_EEDATL7_LENGTH                              0x1
#define _EEDATA_EEDATL7_MASK                                0x80

// Register: EEADRL
#define EEADRL EEADRL
extern volatile unsigned char           EEADRL              __at(0x10D);
#ifndef _LIB_BUILD
asm("EEADRL equ 010Dh");
#endif
// aliases
extern volatile unsigned char           EEADR               __at(0x10D);
#ifndef _LIB_BUILD
asm("EEADR equ 010Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EEADRL                 :8;
    };
    struct {
        unsigned EEADRL0                :1;
        unsigned EEADRL1                :1;
        unsigned EEADRL2                :1;
        unsigned EEADRL3                :1;
        unsigned EEADRL4                :1;
        unsigned EEADRL5                :1;
        unsigned EEADRL6                :1;
        unsigned EEADRL7                :1;
    };
} EEADRLbits_t;
extern volatile EEADRLbits_t EEADRLbits __at(0x10D);
// bitfield macros
#define _EEADRL_EEADRL_POSN                                 0x0
#define _EEADRL_EEADRL_POSITION                             0x0
#define _EEADRL_EEADRL_SIZE                                 0x8
#define _EEADRL_EEADRL_LENGTH                               0x8
#define _EEADRL_EEADRL_MASK                                 0xFF
#define _EEADRL_EEADRL0_POSN                                0x0
#define _EEADRL_EEADRL0_POSITION                            0x0
#define _EEADRL_EEADRL0_SIZE                                0x1
#define _EEADRL_EEADRL0_LENGTH                              0x1
#define _EEADRL_EEADRL0_MASK                                0x1
#define _EEADRL_EEADRL1_POSN                                0x1
#define _EEADRL_EEADRL1_POSITION                            0x1
#define _EEADRL_EEADRL1_SIZE                                0x1
#define _EEADRL_EEADRL1_LENGTH                              0x1
#define _EEADRL_EEADRL1_MASK                                0x2
#define _EEADRL_EEADRL2_POSN                                0x2
#define _EEADRL_EEADRL2_POSITION                            0x2
#define _EEADRL_EEADRL2_SIZE                                0x1
#define _EEADRL_EEADRL2_LENGTH                              0x1
#define _EEADRL_EEADRL2_MASK                                0x4
#define _EEADRL_EEADRL3_POSN                                0x3
#define _EEADRL_EEADRL3_POSITION                            0x3
#define _EEADRL_EEADRL3_SIZE                                0x1
#define _EEADRL_EEADRL3_LENGTH                              0x1
#define _EEADRL_EEADRL3_MASK                                0x8
#define _EEADRL_EEADRL4_POSN                                0x4
#define _EEADRL_EEADRL4_POSITION                            0x4
#define _EEADRL_EEADRL4_SIZE                                0x1
#define _EEADRL_EEADRL4_LENGTH                              0x1
#define _EEADRL_EEADRL4_MASK                                0x10
#define _EEADRL_EEADRL5_POSN                                0x5
#define _EEADRL_EEADRL5_POSITION                            0x5
#define _EEADRL_EEADRL5_SIZE                                0x1
#define _EEADRL_EEADRL5_LENGTH                              0x1
#define _EEADRL_EEADRL5_MASK                                0x20
#define _EEADRL_EEADRL6_POSN                                0x6
#define _EEADRL_EEADRL6_POSITION                            0x6
#define _EEADRL_EEADRL6_SIZE                                0x1
#define _EEADRL_EEADRL6_LENGTH                              0x1
#define _EEADRL_EEADRL6_MASK                                0x40
#define _EEADRL_EEADRL7_POSN                                0x7
#define _EEADRL_EEADRL7_POSITION                            0x7
#define _EEADRL_EEADRL7_SIZE                                0x1
#define _EEADRL_EEADRL7_LENGTH                              0x1
#define _EEADRL_EEADRL7_MASK                                0x80
// alias bitfield definitions
typedef union {
    struct {
        unsigned EEADRL                 :8;
    };
    struct {
        unsigned EEADRL0                :1;
        unsigned EEADRL1                :1;
        unsigned EEADRL2                :1;
        unsigned EEADRL3                :1;
        unsigned EEADRL4                :1;
        unsigned EEADRL5                :1;
        unsigned EEADRL6                :1;
        unsigned EEADRL7                :1;
    };
} EEADRbits_t;
extern volatile EEADRbits_t EEADRbits __at(0x10D);
// bitfield macros
#define _EEADR_EEADRL_POSN                                  0x0
#define _EEADR_EEADRL_POSITION                              0x0
#define _EEADR_EEADRL_SIZE                                  0x8
#define _EEADR_EEADRL_LENGTH                                0x8
#define _EEADR_EEADRL_MASK                                  0xFF
#define _EEADR_EEADRL0_POSN                                 0x0
#define _EEADR_EEADRL0_POSITION                             0x0
#define _EEADR_EEADRL0_SIZE                                 0x1
#define _EEADR_EEADRL0_LENGTH                               0x1
#define _EEADR_EEADRL0_MASK                                 0x1
#define _EEADR_EEADRL1_POSN                                 0x1
#define _EEADR_EEADRL1_POSITION                             0x1
#define _EEADR_EEADRL1_SIZE                                 0x1
#define _EEADR_EEADRL1_LENGTH                               0x1
#define _EEADR_EEADRL1_MASK                                 0x2
#define _EEADR_EEADRL2_POSN                                 0x2
#define _EEADR_EEADRL2_POSITION                             0x2
#define _EEADR_EEADRL2_SIZE                                 0x1
#define _EEADR_EEADRL2_LENGTH                               0x1
#define _EEADR_EEADRL2_MASK                                 0x4
#define _EEADR_EEADRL3_POSN                                 0x3
#define _EEADR_EEADRL3_POSITION                             0x3
#define _EEADR_EEADRL3_SIZE                                 0x1
#define _EEADR_EEADRL3_LENGTH                               0x1
#define _EEADR_EEADRL3_MASK                                 0x8
#define _EEADR_EEADRL4_POSN                                 0x4
#define _EEADR_EEADRL4_POSITION                             0x4
#define _EEADR_EEADRL4_SIZE                                 0x1
#define _EEADR_EEADRL4_LENGTH                               0x1
#define _EEADR_EEADRL4_MASK                                 0x10
#define _EEADR_EEADRL5_POSN                                 0x5
#define _EEADR_EEADRL5_POSITION                             0x5
#define _EEADR_EEADRL5_SIZE                                 0x1
#define _EEADR_EEADRL5_LENGTH                               0x1
#define _EEADR_EEADRL5_MASK                                 0x20
#define _EEADR_EEADRL6_POSN                                 0x6
#define _EEADR_EEADRL6_POSITION                             0x6
#define _EEADR_EEADRL6_SIZE                                 0x1
#define _EEADR_EEADRL6_LENGTH                               0x1
#define _EEADR_EEADRL6_MASK                                 0x40
#define _EEADR_EEADRL7_POSN                                 0x7
#define _EEADR_EEADRL7_POSITION                             0x7
#define _EEADR_EEADRL7_SIZE                                 0x1
#define _EEADR_EEADRL7_LENGTH                               0x1
#define _EEADR_EEADRL7_MASK                                 0x80

// Register: EEDATH
#define EEDATH EEDATH
extern volatile unsigned char           EEDATH              __at(0x10E);
#ifndef _LIB_BUILD
asm("EEDATH equ 010Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EEDATH0                :1;
        unsigned EEDATH1                :1;
        unsigned EEDATH2                :1;
        unsigned EEDATH3                :1;
        unsigned EEDATH4                :1;
        unsigned EEDATH5                :1;
    };
} EEDATHbits_t;
