MikroElektronika/core_packages/PIC/XC8/def/PIC16F946/mcu.h
extern volatile LCDSE0bits_t LCDSE0bits __at(0x11C);
// bitfield macros
#define _LCDSE0_SEG0_POSN                                   0x0
#define _LCDSE0_SEG0_POSITION                               0x0
#define _LCDSE0_SEG0_SIZE                                   0x1
#define _LCDSE0_SEG0_LENGTH                                 0x1
#define _LCDSE0_SEG0_MASK                                   0x1
#define _LCDSE0_SEG1_POSN                                   0x1
#define _LCDSE0_SEG1_POSITION                               0x1
#define _LCDSE0_SEG1_SIZE                                   0x1
#define _LCDSE0_SEG1_LENGTH                                 0x1
#define _LCDSE0_SEG1_MASK                                   0x2
#define _LCDSE0_SEG2_POSN                                   0x2
#define _LCDSE0_SEG2_POSITION                               0x2
#define _LCDSE0_SEG2_SIZE                                   0x1
#define _LCDSE0_SEG2_LENGTH                                 0x1
#define _LCDSE0_SEG2_MASK                                   0x4
#define _LCDSE0_SEG3_POSN                                   0x3
#define _LCDSE0_SEG3_POSITION                               0x3
#define _LCDSE0_SEG3_SIZE                                   0x1
#define _LCDSE0_SEG3_LENGTH                                 0x1
#define _LCDSE0_SEG3_MASK                                   0x8
#define _LCDSE0_SEG4_POSN                                   0x4
#define _LCDSE0_SEG4_POSITION                               0x4
#define _LCDSE0_SEG4_SIZE                                   0x1
#define _LCDSE0_SEG4_LENGTH                                 0x1
#define _LCDSE0_SEG4_MASK                                   0x10
#define _LCDSE0_SEG5_POSN                                   0x5
#define _LCDSE0_SEG5_POSITION                               0x5
#define _LCDSE0_SEG5_SIZE                                   0x1
#define _LCDSE0_SEG5_LENGTH                                 0x1
#define _LCDSE0_SEG5_MASK                                   0x20
#define _LCDSE0_SEG6_POSN                                   0x6
#define _LCDSE0_SEG6_POSITION                               0x6
#define _LCDSE0_SEG6_SIZE                                   0x1
#define _LCDSE0_SEG6_LENGTH                                 0x1
#define _LCDSE0_SEG6_MASK                                   0x40
#define _LCDSE0_SEG7_POSN                                   0x7
#define _LCDSE0_SEG7_POSITION                               0x7
#define _LCDSE0_SEG7_SIZE                                   0x1
#define _LCDSE0_SEG7_LENGTH                                 0x1
#define _LCDSE0_SEG7_MASK                                   0x80
#define _LCDSE0_SE0_POSN                                    0x0
#define _LCDSE0_SE0_POSITION                                0x0
#define _LCDSE0_SE0_SIZE                                    0x1
#define _LCDSE0_SE0_LENGTH                                  0x1
#define _LCDSE0_SE0_MASK                                    0x1
#define _LCDSE0_SE1_POSN                                    0x1
#define _LCDSE0_SE1_POSITION                                0x1
#define _LCDSE0_SE1_SIZE                                    0x1
#define _LCDSE0_SE1_LENGTH                                  0x1
#define _LCDSE0_SE1_MASK                                    0x2
#define _LCDSE0_SE2_POSN                                    0x2
#define _LCDSE0_SE2_POSITION                                0x2
#define _LCDSE0_SE2_SIZE                                    0x1
#define _LCDSE0_SE2_LENGTH                                  0x1
#define _LCDSE0_SE2_MASK                                    0x4
#define _LCDSE0_SE3_POSN                                    0x3
#define _LCDSE0_SE3_POSITION                                0x3
#define _LCDSE0_SE3_SIZE                                    0x1
#define _LCDSE0_SE3_LENGTH                                  0x1
#define _LCDSE0_SE3_MASK                                    0x8
#define _LCDSE0_SE4_POSN                                    0x4
#define _LCDSE0_SE4_POSITION                                0x4
#define _LCDSE0_SE4_SIZE                                    0x1
#define _LCDSE0_SE4_LENGTH                                  0x1
#define _LCDSE0_SE4_MASK                                    0x10
#define _LCDSE0_SE5_POSN                                    0x5
#define _LCDSE0_SE5_POSITION                                0x5
#define _LCDSE0_SE5_SIZE                                    0x1
#define _LCDSE0_SE5_LENGTH                                  0x1
#define _LCDSE0_SE5_MASK                                    0x20
#define _LCDSE0_SE6_POSN                                    0x6
#define _LCDSE0_SE6_POSITION                                0x6
#define _LCDSE0_SE6_SIZE                                    0x1
#define _LCDSE0_SE6_LENGTH                                  0x1
#define _LCDSE0_SE6_MASK                                    0x40
#define _LCDSE0_SE7_POSN                                    0x7
#define _LCDSE0_SE7_POSITION                                0x7
#define _LCDSE0_SE7_SIZE                                    0x1
#define _LCDSE0_SE7_LENGTH                                  0x1
#define _LCDSE0_SE7_MASK                                    0x80
#define _LCDSE0_SEGEN0_POSN                                 0x0
#define _LCDSE0_SEGEN0_POSITION                             0x0
#define _LCDSE0_SEGEN0_SIZE                                 0x1
#define _LCDSE0_SEGEN0_LENGTH                               0x1
#define _LCDSE0_SEGEN0_MASK                                 0x1
#define _LCDSE0_SEGEN1_POSN                                 0x1
#define _LCDSE0_SEGEN1_POSITION                             0x1
#define _LCDSE0_SEGEN1_SIZE                                 0x1
#define _LCDSE0_SEGEN1_LENGTH                               0x1
#define _LCDSE0_SEGEN1_MASK                                 0x2
#define _LCDSE0_SEGEN2_POSN                                 0x2
#define _LCDSE0_SEGEN2_POSITION                             0x2
#define _LCDSE0_SEGEN2_SIZE                                 0x1
#define _LCDSE0_SEGEN2_LENGTH                               0x1
#define _LCDSE0_SEGEN2_MASK                                 0x4
#define _LCDSE0_SEGEN3_POSN                                 0x3
#define _LCDSE0_SEGEN3_POSITION                             0x3
#define _LCDSE0_SEGEN3_SIZE                                 0x1
#define _LCDSE0_SEGEN3_LENGTH                               0x1
#define _LCDSE0_SEGEN3_MASK                                 0x8
#define _LCDSE0_SEGEN4_POSN                                 0x4
#define _LCDSE0_SEGEN4_POSITION                             0x4
#define _LCDSE0_SEGEN4_SIZE                                 0x1
#define _LCDSE0_SEGEN4_LENGTH                               0x1
#define _LCDSE0_SEGEN4_MASK                                 0x10
#define _LCDSE0_SEGEN5_POSN                                 0x5
#define _LCDSE0_SEGEN5_POSITION                             0x5
#define _LCDSE0_SEGEN5_SIZE                                 0x1
#define _LCDSE0_SEGEN5_LENGTH                               0x1
#define _LCDSE0_SEGEN5_MASK                                 0x20
#define _LCDSE0_SEGEN6_POSN                                 0x6
#define _LCDSE0_SEGEN6_POSITION                             0x6
#define _LCDSE0_SEGEN6_SIZE                                 0x1
#define _LCDSE0_SEGEN6_LENGTH                               0x1
#define _LCDSE0_SEGEN6_MASK                                 0x40
#define _LCDSE0_SEGEN7_POSN                                 0x7
#define _LCDSE0_SEGEN7_POSITION                             0x7
#define _LCDSE0_SEGEN7_SIZE                                 0x1
#define _LCDSE0_SEGEN7_LENGTH                               0x1
#define _LCDSE0_SEGEN7_MASK                                 0x80

// Register: LCDSE1
#define LCDSE1 LCDSE1
extern volatile unsigned char           LCDSE1              __at(0x11D);
#ifndef _LIB_BUILD
asm("LCDSE1 equ 011Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SEG8                   :1;
        unsigned SEG9                   :1;
        unsigned SEG10                  :1;
        unsigned SEG11                  :1;
        unsigned SEG12                  :1;
        unsigned SEG13                  :1;
        unsigned SEG14                  :1;
        unsigned SEG15                  :1;
    };
    struct {
        unsigned SE8                    :1;
        unsigned SE9                    :1;
        unsigned SE10                   :1;
        unsigned SE11                   :1;
        unsigned SE12                   :1;
        unsigned SE13                   :1;
        unsigned SE14                   :1;
        unsigned SE15                   :1;
    };
    struct {
        unsigned SEGEN8                 :1;
        unsigned SEGEN9                 :1;
        unsigned SEGEN10                :1;
        unsigned SEGEN11                :1;
        unsigned SEGEN12                :1;
        unsigned SEGEN13                :1;
        unsigned SEGEN14                :1;
        unsigned SEGEN15                :1;
    };
} LCDSE1bits_t;
extern volatile LCDSE1bits_t LCDSE1bits __at(0x11D);
// bitfield macros
#define _LCDSE1_SEG8_POSN                                   0x0
#define _LCDSE1_SEG8_POSITION                               0x0
#define _LCDSE1_SEG8_SIZE                                   0x1
#define _LCDSE1_SEG8_LENGTH                                 0x1
#define _LCDSE1_SEG8_MASK                                   0x1
#define _LCDSE1_SEG9_POSN                                   0x1
#define _LCDSE1_SEG9_POSITION                               0x1
#define _LCDSE1_SEG9_SIZE                                   0x1
#define _LCDSE1_SEG9_LENGTH                                 0x1
#define _LCDSE1_SEG9_MASK                                   0x2
#define _LCDSE1_SEG10_POSN                                  0x2
#define _LCDSE1_SEG10_POSITION                              0x2
#define _LCDSE1_SEG10_SIZE                                  0x1
#define _LCDSE1_SEG10_LENGTH                                0x1
#define _LCDSE1_SEG10_MASK                                  0x4
#define _LCDSE1_SEG11_POSN                                  0x3
#define _LCDSE1_SEG11_POSITION                              0x3
#define _LCDSE1_SEG11_SIZE                                  0x1
#define _LCDSE1_SEG11_LENGTH                                0x1
#define _LCDSE1_SEG11_MASK                                  0x8
#define _LCDSE1_SEG12_POSN                                  0x4
#define _LCDSE1_SEG12_POSITION                              0x4
#define _LCDSE1_SEG12_SIZE                                  0x1
#define _LCDSE1_SEG12_LENGTH                                0x1
#define _LCDSE1_SEG12_MASK                                  0x10
#define _LCDSE1_SEG13_POSN                                  0x5
#define _LCDSE1_SEG13_POSITION                              0x5
#define _LCDSE1_SEG13_SIZE                                  0x1
#define _LCDSE1_SEG13_LENGTH                                0x1
#define _LCDSE1_SEG13_MASK                                  0x20
#define _LCDSE1_SEG14_POSN                                  0x6
#define _LCDSE1_SEG14_POSITION                              0x6
#define _LCDSE1_SEG14_SIZE                                  0x1
#define _LCDSE1_SEG14_LENGTH                                0x1
#define _LCDSE1_SEG14_MASK                                  0x40
#define _LCDSE1_SEG15_POSN                                  0x7
#define _LCDSE1_SEG15_POSITION                              0x7
#define _LCDSE1_SEG15_SIZE                                  0x1
#define _LCDSE1_SEG15_LENGTH                                0x1
#define _LCDSE1_SEG15_MASK                                  0x80
#define _LCDSE1_SE8_POSN                                    0x0
#define _LCDSE1_SE8_POSITION                                0x0
#define _LCDSE1_SE8_SIZE                                    0x1
#define _LCDSE1_SE8_LENGTH                                  0x1
#define _LCDSE1_SE8_MASK                                    0x1
#define _LCDSE1_SE9_POSN                                    0x1
#define _LCDSE1_SE9_POSITION                                0x1
#define _LCDSE1_SE9_SIZE                                    0x1
#define _LCDSE1_SE9_LENGTH                                  0x1
#define _LCDSE1_SE9_MASK                                    0x2
#define _LCDSE1_SE10_POSN                                   0x2
#define _LCDSE1_SE10_POSITION                               0x2
#define _LCDSE1_SE10_SIZE                                   0x1
#define _LCDSE1_SE10_LENGTH                                 0x1
#define _LCDSE1_SE10_MASK                                   0x4
#define _LCDSE1_SE11_POSN                                   0x3
#define _LCDSE1_SE11_POSITION                               0x3
#define _LCDSE1_SE11_SIZE                                   0x1
#define _LCDSE1_SE11_LENGTH                                 0x1
#define _LCDSE1_SE11_MASK                                   0x8
#define _LCDSE1_SE12_POSN                                   0x4
#define _LCDSE1_SE12_POSITION                               0x4
#define _LCDSE1_SE12_SIZE                                   0x1
#define _LCDSE1_SE12_LENGTH                                 0x1
#define _LCDSE1_SE12_MASK                                   0x10
#define _LCDSE1_SE13_POSN                                   0x5
#define _LCDSE1_SE13_POSITION                               0x5
#define _LCDSE1_SE13_SIZE                                   0x1
#define _LCDSE1_SE13_LENGTH                                 0x1
#define _LCDSE1_SE13_MASK                                   0x20
#define _LCDSE1_SE14_POSN                                   0x6
#define _LCDSE1_SE14_POSITION                               0x6
#define _LCDSE1_SE14_SIZE                                   0x1
#define _LCDSE1_SE14_LENGTH                                 0x1
#define _LCDSE1_SE14_MASK                                   0x40
#define _LCDSE1_SE15_POSN                                   0x7
#define _LCDSE1_SE15_POSITION                               0x7
#define _LCDSE1_SE15_SIZE                                   0x1
#define _LCDSE1_SE15_LENGTH                                 0x1
#define _LCDSE1_SE15_MASK                                   0x80
#define _LCDSE1_SEGEN8_POSN                                 0x0
#define _LCDSE1_SEGEN8_POSITION                             0x0
#define _LCDSE1_SEGEN8_SIZE                                 0x1
#define _LCDSE1_SEGEN8_LENGTH                               0x1
#define _LCDSE1_SEGEN8_MASK                                 0x1
#define _LCDSE1_SEGEN9_POSN                                 0x1
#define _LCDSE1_SEGEN9_POSITION                             0x1
#define _LCDSE1_SEGEN9_SIZE                                 0x1
#define _LCDSE1_SEGEN9_LENGTH                               0x1
#define _LCDSE1_SEGEN9_MASK                                 0x2
#define _LCDSE1_SEGEN10_POSN                                0x2
#define _LCDSE1_SEGEN10_POSITION                            0x2
#define _LCDSE1_SEGEN10_SIZE                                0x1
#define _LCDSE1_SEGEN10_LENGTH                              0x1
#define _LCDSE1_SEGEN10_MASK                                0x4
#define _LCDSE1_SEGEN11_POSN                                0x3
#define _LCDSE1_SEGEN11_POSITION                            0x3
#define _LCDSE1_SEGEN11_SIZE                                0x1
#define _LCDSE1_SEGEN11_LENGTH                              0x1
#define _LCDSE1_SEGEN11_MASK                                0x8
#define _LCDSE1_SEGEN12_POSN                                0x4
#define _LCDSE1_SEGEN12_POSITION                            0x4
#define _LCDSE1_SEGEN12_SIZE                                0x1
#define _LCDSE1_SEGEN12_LENGTH                              0x1
#define _LCDSE1_SEGEN12_MASK                                0x10
#define _LCDSE1_SEGEN13_POSN                                0x5
#define _LCDSE1_SEGEN13_POSITION                            0x5
#define _LCDSE1_SEGEN13_SIZE                                0x1
#define _LCDSE1_SEGEN13_LENGTH                              0x1
#define _LCDSE1_SEGEN13_MASK                                0x20
#define _LCDSE1_SEGEN14_POSN                                0x6
#define _LCDSE1_SEGEN14_POSITION                            0x6
#define _LCDSE1_SEGEN14_SIZE                                0x1
#define _LCDSE1_SEGEN14_LENGTH                              0x1
#define _LCDSE1_SEGEN14_MASK                                0x40
#define _LCDSE1_SEGEN15_POSN                                0x7
#define _LCDSE1_SEGEN15_POSITION                            0x7
#define _LCDSE1_SEGEN15_SIZE                                0x1
#define _LCDSE1_SEGEN15_LENGTH                              0x1
#define _LCDSE1_SEGEN15_MASK                                0x80

// Register: LCDSE2
#define LCDSE2 LCDSE2
extern volatile unsigned char           LCDSE2              __at(0x11E);
#ifndef _LIB_BUILD
asm("LCDSE2 equ 011Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SEG16                  :1;
        unsigned SEG17                  :1;
        unsigned SEG18                  :1;
        unsigned SEG19                  :1;
        unsigned SEG20                  :1;
        unsigned SEG21                  :1;
        unsigned SEG22                  :1;
        unsigned SEG23                  :1;
    };
    struct {
        unsigned SE16                   :1;
        unsigned SE17                   :1;
        unsigned SE18                   :1;
        unsigned SE19                   :1;
        unsigned SE20                   :1;
        unsigned SE21                   :1;
        unsigned SE22                   :1;
        unsigned SE23                   :1;
    };
    struct {
        unsigned SEGEN16                :1;
        unsigned SEGEN17                :1;
        unsigned SEGEN18                :1;
        unsigned SEGEN19                :1;
        unsigned SEGEN20                :1;
        unsigned SEGEN21                :1;
        unsigned SEGEN22                :1;
        unsigned SEGEN23                :1;
    };
} LCDSE2bits_t;
