MikroElektronika/core_packages/PIC/XC8/def/PIC16F946/mcu.h
extern volatile LCDSE2bits_t LCDSE2bits __at(0x11E);
// bitfield macros
#define _LCDSE2_SEG16_POSN                                  0x0
#define _LCDSE2_SEG16_POSITION                              0x0
#define _LCDSE2_SEG16_SIZE                                  0x1
#define _LCDSE2_SEG16_LENGTH                                0x1
#define _LCDSE2_SEG16_MASK                                  0x1
#define _LCDSE2_SEG17_POSN                                  0x1
#define _LCDSE2_SEG17_POSITION                              0x1
#define _LCDSE2_SEG17_SIZE                                  0x1
#define _LCDSE2_SEG17_LENGTH                                0x1
#define _LCDSE2_SEG17_MASK                                  0x2
#define _LCDSE2_SEG18_POSN                                  0x2
#define _LCDSE2_SEG18_POSITION                              0x2
#define _LCDSE2_SEG18_SIZE                                  0x1
#define _LCDSE2_SEG18_LENGTH                                0x1
#define _LCDSE2_SEG18_MASK                                  0x4
#define _LCDSE2_SEG19_POSN                                  0x3
#define _LCDSE2_SEG19_POSITION                              0x3
#define _LCDSE2_SEG19_SIZE                                  0x1
#define _LCDSE2_SEG19_LENGTH                                0x1
#define _LCDSE2_SEG19_MASK                                  0x8
#define _LCDSE2_SEG20_POSN                                  0x4
#define _LCDSE2_SEG20_POSITION                              0x4
#define _LCDSE2_SEG20_SIZE                                  0x1
#define _LCDSE2_SEG20_LENGTH                                0x1
#define _LCDSE2_SEG20_MASK                                  0x10
#define _LCDSE2_SEG21_POSN                                  0x5
#define _LCDSE2_SEG21_POSITION                              0x5
#define _LCDSE2_SEG21_SIZE                                  0x1
#define _LCDSE2_SEG21_LENGTH                                0x1
#define _LCDSE2_SEG21_MASK                                  0x20
#define _LCDSE2_SEG22_POSN                                  0x6
#define _LCDSE2_SEG22_POSITION                              0x6
#define _LCDSE2_SEG22_SIZE                                  0x1
#define _LCDSE2_SEG22_LENGTH                                0x1
#define _LCDSE2_SEG22_MASK                                  0x40
#define _LCDSE2_SEG23_POSN                                  0x7
#define _LCDSE2_SEG23_POSITION                              0x7
#define _LCDSE2_SEG23_SIZE                                  0x1
#define _LCDSE2_SEG23_LENGTH                                0x1
#define _LCDSE2_SEG23_MASK                                  0x80
#define _LCDSE2_SE16_POSN                                   0x0
#define _LCDSE2_SE16_POSITION                               0x0
#define _LCDSE2_SE16_SIZE                                   0x1
#define _LCDSE2_SE16_LENGTH                                 0x1
#define _LCDSE2_SE16_MASK                                   0x1
#define _LCDSE2_SE17_POSN                                   0x1
#define _LCDSE2_SE17_POSITION                               0x1
#define _LCDSE2_SE17_SIZE                                   0x1
#define _LCDSE2_SE17_LENGTH                                 0x1
#define _LCDSE2_SE17_MASK                                   0x2
#define _LCDSE2_SE18_POSN                                   0x2
#define _LCDSE2_SE18_POSITION                               0x2
#define _LCDSE2_SE18_SIZE                                   0x1
#define _LCDSE2_SE18_LENGTH                                 0x1
#define _LCDSE2_SE18_MASK                                   0x4
#define _LCDSE2_SE19_POSN                                   0x3
#define _LCDSE2_SE19_POSITION                               0x3
#define _LCDSE2_SE19_SIZE                                   0x1
#define _LCDSE2_SE19_LENGTH                                 0x1
#define _LCDSE2_SE19_MASK                                   0x8
#define _LCDSE2_SE20_POSN                                   0x4
#define _LCDSE2_SE20_POSITION                               0x4
#define _LCDSE2_SE20_SIZE                                   0x1
#define _LCDSE2_SE20_LENGTH                                 0x1
#define _LCDSE2_SE20_MASK                                   0x10
#define _LCDSE2_SE21_POSN                                   0x5
#define _LCDSE2_SE21_POSITION                               0x5
#define _LCDSE2_SE21_SIZE                                   0x1
#define _LCDSE2_SE21_LENGTH                                 0x1
#define _LCDSE2_SE21_MASK                                   0x20
#define _LCDSE2_SE22_POSN                                   0x6
#define _LCDSE2_SE22_POSITION                               0x6
#define _LCDSE2_SE22_SIZE                                   0x1
#define _LCDSE2_SE22_LENGTH                                 0x1
#define _LCDSE2_SE22_MASK                                   0x40
#define _LCDSE2_SE23_POSN                                   0x7
#define _LCDSE2_SE23_POSITION                               0x7
#define _LCDSE2_SE23_SIZE                                   0x1
#define _LCDSE2_SE23_LENGTH                                 0x1
#define _LCDSE2_SE23_MASK                                   0x80
#define _LCDSE2_SEGEN16_POSN                                0x0
#define _LCDSE2_SEGEN16_POSITION                            0x0
#define _LCDSE2_SEGEN16_SIZE                                0x1
#define _LCDSE2_SEGEN16_LENGTH                              0x1
#define _LCDSE2_SEGEN16_MASK                                0x1
#define _LCDSE2_SEGEN17_POSN                                0x1
#define _LCDSE2_SEGEN17_POSITION                            0x1
#define _LCDSE2_SEGEN17_SIZE                                0x1
#define _LCDSE2_SEGEN17_LENGTH                              0x1
#define _LCDSE2_SEGEN17_MASK                                0x2
#define _LCDSE2_SEGEN18_POSN                                0x2
#define _LCDSE2_SEGEN18_POSITION                            0x2
#define _LCDSE2_SEGEN18_SIZE                                0x1
#define _LCDSE2_SEGEN18_LENGTH                              0x1
#define _LCDSE2_SEGEN18_MASK                                0x4
#define _LCDSE2_SEGEN19_POSN                                0x3
#define _LCDSE2_SEGEN19_POSITION                            0x3
#define _LCDSE2_SEGEN19_SIZE                                0x1
#define _LCDSE2_SEGEN19_LENGTH                              0x1
#define _LCDSE2_SEGEN19_MASK                                0x8
#define _LCDSE2_SEGEN20_POSN                                0x4
#define _LCDSE2_SEGEN20_POSITION                            0x4
#define _LCDSE2_SEGEN20_SIZE                                0x1
#define _LCDSE2_SEGEN20_LENGTH                              0x1
#define _LCDSE2_SEGEN20_MASK                                0x10
#define _LCDSE2_SEGEN21_POSN                                0x5
#define _LCDSE2_SEGEN21_POSITION                            0x5
#define _LCDSE2_SEGEN21_SIZE                                0x1
#define _LCDSE2_SEGEN21_LENGTH                              0x1
#define _LCDSE2_SEGEN21_MASK                                0x20
#define _LCDSE2_SEGEN22_POSN                                0x6
#define _LCDSE2_SEGEN22_POSITION                            0x6
#define _LCDSE2_SEGEN22_SIZE                                0x1
#define _LCDSE2_SEGEN22_LENGTH                              0x1
#define _LCDSE2_SEGEN22_MASK                                0x40
#define _LCDSE2_SEGEN23_POSN                                0x7
#define _LCDSE2_SEGEN23_POSITION                            0x7
#define _LCDSE2_SEGEN23_SIZE                                0x1
#define _LCDSE2_SEGEN23_LENGTH                              0x1
#define _LCDSE2_SEGEN23_MASK                                0x80

