MikroElektronika/core_packages/PIC/XC8/def/PIC16F946/mcu.h
// Register: TRISF
#define TRISF TRISF
extern volatile unsigned char           TRISF               __at(0x185);
#ifndef _LIB_BUILD
asm("TRISF equ 0185h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TRISF0                 :1;
        unsigned TRISF1                 :1;
        unsigned TRISF2                 :1;
        unsigned TRISF3                 :1;
        unsigned TRISF4                 :1;
        unsigned TRISF5                 :1;
        unsigned TRISF6                 :1;
        unsigned TRISF7                 :1;
    };
} TRISFbits_t;
extern volatile TRISFbits_t TRISFbits __at(0x185);
// bitfield macros
#define _TRISF_TRISF0_POSN                                  0x0
#define _TRISF_TRISF0_POSITION                              0x0
#define _TRISF_TRISF0_SIZE                                  0x1
#define _TRISF_TRISF0_LENGTH                                0x1
#define _TRISF_TRISF0_MASK                                  0x1
#define _TRISF_TRISF1_POSN                                  0x1
#define _TRISF_TRISF1_POSITION                              0x1
#define _TRISF_TRISF1_SIZE                                  0x1
#define _TRISF_TRISF1_LENGTH                                0x1
#define _TRISF_TRISF1_MASK                                  0x2
#define _TRISF_TRISF2_POSN                                  0x2
#define _TRISF_TRISF2_POSITION                              0x2
#define _TRISF_TRISF2_SIZE                                  0x1
#define _TRISF_TRISF2_LENGTH                                0x1
#define _TRISF_TRISF2_MASK                                  0x4
#define _TRISF_TRISF3_POSN                                  0x3
#define _TRISF_TRISF3_POSITION                              0x3
#define _TRISF_TRISF3_SIZE                                  0x1
#define _TRISF_TRISF3_LENGTH                                0x1
#define _TRISF_TRISF3_MASK                                  0x8
#define _TRISF_TRISF4_POSN                                  0x4
#define _TRISF_TRISF4_POSITION                              0x4
#define _TRISF_TRISF4_SIZE                                  0x1
#define _TRISF_TRISF4_LENGTH                                0x1
#define _TRISF_TRISF4_MASK                                  0x10
#define _TRISF_TRISF5_POSN                                  0x5
#define _TRISF_TRISF5_POSITION                              0x5
#define _TRISF_TRISF5_SIZE                                  0x1
#define _TRISF_TRISF5_LENGTH                                0x1
#define _TRISF_TRISF5_MASK                                  0x20
#define _TRISF_TRISF6_POSN                                  0x6
#define _TRISF_TRISF6_POSITION                              0x6
#define _TRISF_TRISF6_SIZE                                  0x1
#define _TRISF_TRISF6_LENGTH                                0x1
#define _TRISF_TRISF6_MASK                                  0x40
#define _TRISF_TRISF7_POSN                                  0x7
#define _TRISF_TRISF7_POSITION                              0x7
#define _TRISF_TRISF7_SIZE                                  0x1
#define _TRISF_TRISF7_LENGTH                                0x1
#define _TRISF_TRISF7_MASK                                  0x80

// Register: TRISG
#define TRISG TRISG
extern volatile unsigned char           TRISG               __at(0x187);
#ifndef _LIB_BUILD
asm("TRISG equ 0187h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TRISG0                 :1;
        unsigned TRISG1                 :1;
        unsigned TRISG2                 :1;
        unsigned TRISG3                 :1;
        unsigned TRISG4                 :1;
        unsigned TRISG5                 :1;
    };
} TRISGbits_t;
extern volatile TRISGbits_t TRISGbits __at(0x187);
// bitfield macros
#define _TRISG_TRISG0_POSN                                  0x0
#define _TRISG_TRISG0_POSITION                              0x0
#define _TRISG_TRISG0_SIZE                                  0x1
#define _TRISG_TRISG0_LENGTH                                0x1
#define _TRISG_TRISG0_MASK                                  0x1
#define _TRISG_TRISG1_POSN                                  0x1
#define _TRISG_TRISG1_POSITION                              0x1
#define _TRISG_TRISG1_SIZE                                  0x1
#define _TRISG_TRISG1_LENGTH                                0x1
#define _TRISG_TRISG1_MASK                                  0x2
#define _TRISG_TRISG2_POSN                                  0x2
#define _TRISG_TRISG2_POSITION                              0x2
#define _TRISG_TRISG2_SIZE                                  0x1
#define _TRISG_TRISG2_LENGTH                                0x1
#define _TRISG_TRISG2_MASK                                  0x4
#define _TRISG_TRISG3_POSN                                  0x3
#define _TRISG_TRISG3_POSITION                              0x3
#define _TRISG_TRISG3_SIZE                                  0x1
#define _TRISG_TRISG3_LENGTH                                0x1
#define _TRISG_TRISG3_MASK                                  0x8
#define _TRISG_TRISG4_POSN                                  0x4
#define _TRISG_TRISG4_POSITION                              0x4
#define _TRISG_TRISG4_SIZE                                  0x1
#define _TRISG_TRISG4_LENGTH                                0x1
#define _TRISG_TRISG4_MASK                                  0x10
#define _TRISG_TRISG5_POSN                                  0x5
#define _TRISG_TRISG5_POSITION                              0x5
#define _TRISG_TRISG5_SIZE                                  0x1
#define _TRISG_TRISG5_LENGTH                                0x1
#define _TRISG_TRISG5_MASK                                  0x20

// Register: PORTF
#define PORTF PORTF
extern volatile unsigned char           PORTF               __at(0x188);
#ifndef _LIB_BUILD
asm("PORTF equ 0188h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RF0                    :1;
        unsigned RF1                    :1;
        unsigned RF2                    :1;
        unsigned RF3                    :1;
        unsigned RF4                    :1;
        unsigned RF5                    :1;
        unsigned RF6                    :1;
        unsigned RF7                    :1;
    };
} PORTFbits_t;
extern volatile PORTFbits_t PORTFbits __at(0x188);
// bitfield macros
#define _PORTF_RF0_POSN                                     0x0
#define _PORTF_RF0_POSITION                                 0x0
#define _PORTF_RF0_SIZE                                     0x1
#define _PORTF_RF0_LENGTH                                   0x1
#define _PORTF_RF0_MASK                                     0x1
#define _PORTF_RF1_POSN                                     0x1
#define _PORTF_RF1_POSITION                                 0x1
#define _PORTF_RF1_SIZE                                     0x1
#define _PORTF_RF1_LENGTH                                   0x1
#define _PORTF_RF1_MASK                                     0x2
#define _PORTF_RF2_POSN                                     0x2
#define _PORTF_RF2_POSITION                                 0x2
#define _PORTF_RF2_SIZE                                     0x1
#define _PORTF_RF2_LENGTH                                   0x1
#define _PORTF_RF2_MASK                                     0x4
#define _PORTF_RF3_POSN                                     0x3
#define _PORTF_RF3_POSITION                                 0x3
#define _PORTF_RF3_SIZE                                     0x1
#define _PORTF_RF3_LENGTH                                   0x1
#define _PORTF_RF3_MASK                                     0x8
#define _PORTF_RF4_POSN                                     0x4
#define _PORTF_RF4_POSITION                                 0x4
#define _PORTF_RF4_SIZE                                     0x1
#define _PORTF_RF4_LENGTH                                   0x1
#define _PORTF_RF4_MASK                                     0x10
#define _PORTF_RF5_POSN                                     0x5
#define _PORTF_RF5_POSITION                                 0x5
#define _PORTF_RF5_SIZE                                     0x1
#define _PORTF_RF5_LENGTH                                   0x1
#define _PORTF_RF5_MASK                                     0x20
#define _PORTF_RF6_POSN                                     0x6
#define _PORTF_RF6_POSITION                                 0x6
#define _PORTF_RF6_SIZE                                     0x1
#define _PORTF_RF6_LENGTH                                   0x1
#define _PORTF_RF6_MASK                                     0x40
#define _PORTF_RF7_POSN                                     0x7
#define _PORTF_RF7_POSITION                                 0x7
#define _PORTF_RF7_SIZE                                     0x1
#define _PORTF_RF7_LENGTH                                   0x1
#define _PORTF_RF7_MASK                                     0x80

// Register: PORTG
#define PORTG PORTG
extern volatile unsigned char           PORTG               __at(0x189);
#ifndef _LIB_BUILD
asm("PORTG equ 0189h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RG0                    :1;
        unsigned RG1                    :1;
        unsigned RG2                    :1;
        unsigned RG3                    :1;
        unsigned RG4                    :1;
        unsigned RG5                    :1;
    };
} PORTGbits_t;
extern volatile PORTGbits_t PORTGbits __at(0x189);
// bitfield macros
#define _PORTG_RG0_POSN                                     0x0
#define _PORTG_RG0_POSITION                                 0x0
#define _PORTG_RG0_SIZE                                     0x1
#define _PORTG_RG0_LENGTH                                   0x1
#define _PORTG_RG0_MASK                                     0x1
#define _PORTG_RG1_POSN                                     0x1
#define _PORTG_RG1_POSITION                                 0x1
#define _PORTG_RG1_SIZE                                     0x1
#define _PORTG_RG1_LENGTH                                   0x1
#define _PORTG_RG1_MASK                                     0x2
#define _PORTG_RG2_POSN                                     0x2
#define _PORTG_RG2_POSITION                                 0x2
#define _PORTG_RG2_SIZE                                     0x1
#define _PORTG_RG2_LENGTH                                   0x1
#define _PORTG_RG2_MASK                                     0x4
#define _PORTG_RG3_POSN                                     0x3
#define _PORTG_RG3_POSITION                                 0x3
#define _PORTG_RG3_SIZE                                     0x1
#define _PORTG_RG3_LENGTH                                   0x1
#define _PORTG_RG3_MASK                                     0x8
#define _PORTG_RG4_POSN                                     0x4
#define _PORTG_RG4_POSITION                                 0x4
#define _PORTG_RG4_SIZE                                     0x1
#define _PORTG_RG4_LENGTH                                   0x1
#define _PORTG_RG4_MASK                                     0x10
#define _PORTG_RG5_POSN                                     0x5
#define _PORTG_RG5_POSITION                                 0x5
#define _PORTG_RG5_SIZE                                     0x1
#define _PORTG_RG5_LENGTH                                   0x1
#define _PORTG_RG5_MASK                                     0x20

// Register: EECON1
#define EECON1 EECON1
extern volatile unsigned char           EECON1              __at(0x18C);
#ifndef _LIB_BUILD
asm("EECON1 equ 018Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RD                     :1;
        unsigned WR                     :1;
        unsigned WREN                   :1;
        unsigned WRERR                  :1;
        unsigned                        :3;
        unsigned EEPGD                  :1;
    };
    struct {
        unsigned EERD                   :1;
        unsigned EEWR                   :1;
    };
} EECON1bits_t;
extern volatile EECON1bits_t EECON1bits __at(0x18C);
// bitfield macros
#define _EECON1_RD_POSN                                     0x0
#define _EECON1_RD_POSITION                                 0x0
#define _EECON1_RD_SIZE                                     0x1
#define _EECON1_RD_LENGTH                                   0x1
#define _EECON1_RD_MASK                                     0x1
#define _EECON1_WR_POSN                                     0x1
#define _EECON1_WR_POSITION                                 0x1
#define _EECON1_WR_SIZE                                     0x1
#define _EECON1_WR_LENGTH                                   0x1
#define _EECON1_WR_MASK                                     0x2
#define _EECON1_WREN_POSN                                   0x2
#define _EECON1_WREN_POSITION                               0x2
#define _EECON1_WREN_SIZE                                   0x1
#define _EECON1_WREN_LENGTH                                 0x1
#define _EECON1_WREN_MASK                                   0x4
#define _EECON1_WRERR_POSN                                  0x3
#define _EECON1_WRERR_POSITION                              0x3
#define _EECON1_WRERR_SIZE                                  0x1
#define _EECON1_WRERR_LENGTH                                0x1
#define _EECON1_WRERR_MASK                                  0x8
#define _EECON1_EEPGD_POSN                                  0x7
#define _EECON1_EEPGD_POSITION                              0x7
#define _EECON1_EEPGD_SIZE                                  0x1
#define _EECON1_EEPGD_LENGTH                                0x1
#define _EECON1_EEPGD_MASK                                  0x80
#define _EECON1_EERD_POSN                                   0x0
#define _EECON1_EERD_POSITION                               0x0
#define _EECON1_EERD_SIZE                                   0x1
#define _EECON1_EERD_LENGTH                                 0x1
#define _EECON1_EERD_MASK                                   0x1
#define _EECON1_EEWR_POSN                                   0x1
#define _EECON1_EEWR_POSITION                               0x1
#define _EECON1_EEWR_SIZE                                   0x1
#define _EECON1_EEWR_LENGTH                                 0x1
#define _EECON1_EEWR_MASK                                   0x2

// Register: EECON2
#define EECON2 EECON2
extern volatile unsigned char           EECON2              __at(0x18D);
#ifndef _LIB_BUILD
asm("EECON2 equ 018Dh");
#endif

// Register: LCDDATA12
#define LCDDATA12 LCDDATA12
extern volatile unsigned char           LCDDATA12           __at(0x190);
#ifndef _LIB_BUILD
asm("LCDDATA12 equ 0190h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SEG24                  :1;
        unsigned SEG25                  :1;
        unsigned SEG26                  :1;
        unsigned SEG27                  :1;
        unsigned SEG28                  :1;
        unsigned SEG29                  :1;
        unsigned SEG30                  :1;
        unsigned SEG31                  :1;
    };
    struct {
        unsigned SEG24COM0              :1;
        unsigned SEG25COM0              :1;
        unsigned SEG26COM0              :1;
        unsigned SEG27COM0              :1;
        unsigned SEG28COM0              :1;
        unsigned SEG29COM0              :1;
        unsigned SEG30COM0              :1;
        unsigned SEG31COM0              :1;
    };
    struct {
        unsigned S24C0                  :1;
        unsigned S25C0                  :1;
        unsigned S26C0                  :1;
        unsigned S27C0                  :1;
        unsigned S28C0                  :1;
        unsigned S29C0                  :1;
        unsigned S30C0                  :1;
        unsigned S31C0                  :1;
    };
} LCDDATA12bits_t;
extern volatile LCDDATA12bits_t LCDDATA12bits __at(0x190);
// bitfield macros
#define _LCDDATA12_SEG24_POSN                               0x0
#define _LCDDATA12_SEG24_POSITION                           0x0
#define _LCDDATA12_SEG24_SIZE                               0x1
#define _LCDDATA12_SEG24_LENGTH                             0x1
#define _LCDDATA12_SEG24_MASK                               0x1
#define _LCDDATA12_SEG25_POSN                               0x1
#define _LCDDATA12_SEG25_POSITION                           0x1
#define _LCDDATA12_SEG25_SIZE                               0x1
#define _LCDDATA12_SEG25_LENGTH                             0x1
#define _LCDDATA12_SEG25_MASK                               0x2
#define _LCDDATA12_SEG26_POSN                               0x2
#define _LCDDATA12_SEG26_POSITION                           0x2
#define _LCDDATA12_SEG26_SIZE                               0x1
#define _LCDDATA12_SEG26_LENGTH                             0x1
#define _LCDDATA12_SEG26_MASK                               0x4
#define _LCDDATA12_SEG27_POSN                               0x3
#define _LCDDATA12_SEG27_POSITION                           0x3
#define _LCDDATA12_SEG27_SIZE                               0x1
#define _LCDDATA12_SEG27_LENGTH                             0x1
#define _LCDDATA12_SEG27_MASK                               0x8
#define _LCDDATA12_SEG28_POSN                               0x4
#define _LCDDATA12_SEG28_POSITION                           0x4
#define _LCDDATA12_SEG28_SIZE                               0x1
#define _LCDDATA12_SEG28_LENGTH                             0x1
#define _LCDDATA12_SEG28_MASK                               0x10
#define _LCDDATA12_SEG29_POSN                               0x5
#define _LCDDATA12_SEG29_POSITION                           0x5
#define _LCDDATA12_SEG29_SIZE                               0x1
#define _LCDDATA12_SEG29_LENGTH                             0x1
#define _LCDDATA12_SEG29_MASK                               0x20
#define _LCDDATA12_SEG30_POSN                               0x6
#define _LCDDATA12_SEG30_POSITION                           0x6
#define _LCDDATA12_SEG30_SIZE                               0x1
#define _LCDDATA12_SEG30_LENGTH                             0x1
#define _LCDDATA12_SEG30_MASK                               0x40
#define _LCDDATA12_SEG31_POSN                               0x7
#define _LCDDATA12_SEG31_POSITION                           0x7
#define _LCDDATA12_SEG31_SIZE                               0x1
#define _LCDDATA12_SEG31_LENGTH                             0x1
#define _LCDDATA12_SEG31_MASK                               0x80
#define _LCDDATA12_SEG24COM0_POSN                           0x0
#define _LCDDATA12_SEG24COM0_POSITION                       0x0
#define _LCDDATA12_SEG24COM0_SIZE                           0x1
#define _LCDDATA12_SEG24COM0_LENGTH                         0x1
#define _LCDDATA12_SEG24COM0_MASK                           0x1
#define _LCDDATA12_SEG25COM0_POSN                           0x1
#define _LCDDATA12_SEG25COM0_POSITION                       0x1
#define _LCDDATA12_SEG25COM0_SIZE                           0x1
#define _LCDDATA12_SEG25COM0_LENGTH                         0x1
#define _LCDDATA12_SEG25COM0_MASK                           0x2
#define _LCDDATA12_SEG26COM0_POSN                           0x2
#define _LCDDATA12_SEG26COM0_POSITION                       0x2
#define _LCDDATA12_SEG26COM0_SIZE                           0x1
#define _LCDDATA12_SEG26COM0_LENGTH                         0x1
#define _LCDDATA12_SEG26COM0_MASK                           0x4
#define _LCDDATA12_SEG27COM0_POSN                           0x3
#define _LCDDATA12_SEG27COM0_POSITION                       0x3
#define _LCDDATA12_SEG27COM0_SIZE                           0x1
#define _LCDDATA12_SEG27COM0_LENGTH                         0x1
#define _LCDDATA12_SEG27COM0_MASK                           0x8
#define _LCDDATA12_SEG28COM0_POSN                           0x4
#define _LCDDATA12_SEG28COM0_POSITION                       0x4
#define _LCDDATA12_SEG28COM0_SIZE                           0x1
#define _LCDDATA12_SEG28COM0_LENGTH                         0x1
#define _LCDDATA12_SEG28COM0_MASK                           0x10
#define _LCDDATA12_SEG29COM0_POSN                           0x5
#define _LCDDATA12_SEG29COM0_POSITION                       0x5
#define _LCDDATA12_SEG29COM0_SIZE                           0x1
#define _LCDDATA12_SEG29COM0_LENGTH                         0x1
#define _LCDDATA12_SEG29COM0_MASK                           0x20
#define _LCDDATA12_SEG30COM0_POSN                           0x6
#define _LCDDATA12_SEG30COM0_POSITION                       0x6
#define _LCDDATA12_SEG30COM0_SIZE                           0x1
#define _LCDDATA12_SEG30COM0_LENGTH                         0x1
#define _LCDDATA12_SEG30COM0_MASK                           0x40
#define _LCDDATA12_SEG31COM0_POSN                           0x7
#define _LCDDATA12_SEG31COM0_POSITION                       0x7
#define _LCDDATA12_SEG31COM0_SIZE                           0x1
#define _LCDDATA12_SEG31COM0_LENGTH                         0x1
#define _LCDDATA12_SEG31COM0_MASK                           0x80
#define _LCDDATA12_S24C0_POSN                               0x0
#define _LCDDATA12_S24C0_POSITION                           0x0
#define _LCDDATA12_S24C0_SIZE                               0x1
#define _LCDDATA12_S24C0_LENGTH                             0x1
#define _LCDDATA12_S24C0_MASK                               0x1
#define _LCDDATA12_S25C0_POSN                               0x1
#define _LCDDATA12_S25C0_POSITION                           0x1
#define _LCDDATA12_S25C0_SIZE                               0x1
#define _LCDDATA12_S25C0_LENGTH                             0x1
#define _LCDDATA12_S25C0_MASK                               0x2
#define _LCDDATA12_S26C0_POSN                               0x2
#define _LCDDATA12_S26C0_POSITION                           0x2
#define _LCDDATA12_S26C0_SIZE                               0x1
#define _LCDDATA12_S26C0_LENGTH                             0x1
#define _LCDDATA12_S26C0_MASK                               0x4
#define _LCDDATA12_S27C0_POSN                               0x3
#define _LCDDATA12_S27C0_POSITION                           0x3
#define _LCDDATA12_S27C0_SIZE                               0x1
#define _LCDDATA12_S27C0_LENGTH                             0x1
#define _LCDDATA12_S27C0_MASK                               0x8
#define _LCDDATA12_S28C0_POSN                               0x4
#define _LCDDATA12_S28C0_POSITION                           0x4
#define _LCDDATA12_S28C0_SIZE                               0x1
#define _LCDDATA12_S28C0_LENGTH                             0x1
#define _LCDDATA12_S28C0_MASK                               0x10
#define _LCDDATA12_S29C0_POSN                               0x5
#define _LCDDATA12_S29C0_POSITION                           0x5
#define _LCDDATA12_S29C0_SIZE                               0x1
#define _LCDDATA12_S29C0_LENGTH                             0x1
#define _LCDDATA12_S29C0_MASK                               0x20
#define _LCDDATA12_S30C0_POSN                               0x6
#define _LCDDATA12_S30C0_POSITION                           0x6
#define _LCDDATA12_S30C0_SIZE                               0x1
#define _LCDDATA12_S30C0_LENGTH                             0x1
#define _LCDDATA12_S30C0_MASK                               0x40
#define _LCDDATA12_S31C0_POSN                               0x7
#define _LCDDATA12_S31C0_POSITION                           0x7
#define _LCDDATA12_S31C0_SIZE                               0x1
#define _LCDDATA12_S31C0_LENGTH                             0x1
#define _LCDDATA12_S31C0_MASK                               0x80

