MikroElektronika/core_packages/PIC/XC8/def/PIC16F946/mcu.h
// Register: LCDDATA13
#define LCDDATA13 LCDDATA13
extern volatile unsigned char           LCDDATA13           __at(0x191);
#ifndef _LIB_BUILD
asm("LCDDATA13 equ 0191h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SEG32                  :1;
        unsigned SEG33                  :1;
        unsigned SEG34                  :1;
        unsigned SEG35                  :1;
        unsigned SEG36                  :1;
        unsigned SEG37                  :1;
        unsigned SEG38                  :1;
        unsigned SEG39                  :1;
    };
    struct {
        unsigned SEG32COM0              :1;
        unsigned SEG33COM0              :1;
        unsigned SEG34COM0              :1;
        unsigned SEG35COM0              :1;
        unsigned SEG36COM0              :1;
        unsigned SEG37COM0              :1;
        unsigned SEG38COM0              :1;
        unsigned SEG39COM0              :1;
    };
    struct {
        unsigned S32C0                  :1;
        unsigned S33C0                  :1;
        unsigned S34C0                  :1;
        unsigned S35C0                  :1;
        unsigned S36C0                  :1;
        unsigned S37C0                  :1;
        unsigned S38C0                  :1;
        unsigned S39C0                  :1;
    };
} LCDDATA13bits_t;
extern volatile LCDDATA13bits_t LCDDATA13bits __at(0x191);
// bitfield macros
#define _LCDDATA13_SEG32_POSN                               0x0
#define _LCDDATA13_SEG32_POSITION                           0x0
#define _LCDDATA13_SEG32_SIZE                               0x1
#define _LCDDATA13_SEG32_LENGTH                             0x1
#define _LCDDATA13_SEG32_MASK                               0x1
#define _LCDDATA13_SEG33_POSN                               0x1
#define _LCDDATA13_SEG33_POSITION                           0x1
#define _LCDDATA13_SEG33_SIZE                               0x1
#define _LCDDATA13_SEG33_LENGTH                             0x1
#define _LCDDATA13_SEG33_MASK                               0x2
#define _LCDDATA13_SEG34_POSN                               0x2
#define _LCDDATA13_SEG34_POSITION                           0x2
#define _LCDDATA13_SEG34_SIZE                               0x1
#define _LCDDATA13_SEG34_LENGTH                             0x1
#define _LCDDATA13_SEG34_MASK                               0x4
#define _LCDDATA13_SEG35_POSN                               0x3
#define _LCDDATA13_SEG35_POSITION                           0x3
#define _LCDDATA13_SEG35_SIZE                               0x1
#define _LCDDATA13_SEG35_LENGTH                             0x1
#define _LCDDATA13_SEG35_MASK                               0x8
#define _LCDDATA13_SEG36_POSN                               0x4
#define _LCDDATA13_SEG36_POSITION                           0x4
#define _LCDDATA13_SEG36_SIZE                               0x1
#define _LCDDATA13_SEG36_LENGTH                             0x1
#define _LCDDATA13_SEG36_MASK                               0x10
#define _LCDDATA13_SEG37_POSN                               0x5
#define _LCDDATA13_SEG37_POSITION                           0x5
#define _LCDDATA13_SEG37_SIZE                               0x1
#define _LCDDATA13_SEG37_LENGTH                             0x1
#define _LCDDATA13_SEG37_MASK                               0x20
#define _LCDDATA13_SEG38_POSN                               0x6
#define _LCDDATA13_SEG38_POSITION                           0x6
#define _LCDDATA13_SEG38_SIZE                               0x1
#define _LCDDATA13_SEG38_LENGTH                             0x1
#define _LCDDATA13_SEG38_MASK                               0x40
#define _LCDDATA13_SEG39_POSN                               0x7
#define _LCDDATA13_SEG39_POSITION                           0x7
#define _LCDDATA13_SEG39_SIZE                               0x1
#define _LCDDATA13_SEG39_LENGTH                             0x1
#define _LCDDATA13_SEG39_MASK                               0x80
#define _LCDDATA13_SEG32COM0_POSN                           0x0
#define _LCDDATA13_SEG32COM0_POSITION                       0x0
#define _LCDDATA13_SEG32COM0_SIZE                           0x1
#define _LCDDATA13_SEG32COM0_LENGTH                         0x1
#define _LCDDATA13_SEG32COM0_MASK                           0x1
#define _LCDDATA13_SEG33COM0_POSN                           0x1
#define _LCDDATA13_SEG33COM0_POSITION                       0x1
#define _LCDDATA13_SEG33COM0_SIZE                           0x1
#define _LCDDATA13_SEG33COM0_LENGTH                         0x1
#define _LCDDATA13_SEG33COM0_MASK                           0x2
#define _LCDDATA13_SEG34COM0_POSN                           0x2
#define _LCDDATA13_SEG34COM0_POSITION                       0x2
#define _LCDDATA13_SEG34COM0_SIZE                           0x1
#define _LCDDATA13_SEG34COM0_LENGTH                         0x1
#define _LCDDATA13_SEG34COM0_MASK                           0x4
#define _LCDDATA13_SEG35COM0_POSN                           0x3
#define _LCDDATA13_SEG35COM0_POSITION                       0x3
#define _LCDDATA13_SEG35COM0_SIZE                           0x1
#define _LCDDATA13_SEG35COM0_LENGTH                         0x1
#define _LCDDATA13_SEG35COM0_MASK                           0x8
#define _LCDDATA13_SEG36COM0_POSN                           0x4
#define _LCDDATA13_SEG36COM0_POSITION                       0x4
#define _LCDDATA13_SEG36COM0_SIZE                           0x1
#define _LCDDATA13_SEG36COM0_LENGTH                         0x1
#define _LCDDATA13_SEG36COM0_MASK                           0x10
#define _LCDDATA13_SEG37COM0_POSN                           0x5
#define _LCDDATA13_SEG37COM0_POSITION                       0x5
#define _LCDDATA13_SEG37COM0_SIZE                           0x1
#define _LCDDATA13_SEG37COM0_LENGTH                         0x1
#define _LCDDATA13_SEG37COM0_MASK                           0x20
#define _LCDDATA13_SEG38COM0_POSN                           0x6
#define _LCDDATA13_SEG38COM0_POSITION                       0x6
#define _LCDDATA13_SEG38COM0_SIZE                           0x1
#define _LCDDATA13_SEG38COM0_LENGTH                         0x1
#define _LCDDATA13_SEG38COM0_MASK                           0x40
#define _LCDDATA13_SEG39COM0_POSN                           0x7
#define _LCDDATA13_SEG39COM0_POSITION                       0x7
#define _LCDDATA13_SEG39COM0_SIZE                           0x1
#define _LCDDATA13_SEG39COM0_LENGTH                         0x1
#define _LCDDATA13_SEG39COM0_MASK                           0x80
#define _LCDDATA13_S32C0_POSN                               0x0
#define _LCDDATA13_S32C0_POSITION                           0x0
#define _LCDDATA13_S32C0_SIZE                               0x1
#define _LCDDATA13_S32C0_LENGTH                             0x1
#define _LCDDATA13_S32C0_MASK                               0x1
#define _LCDDATA13_S33C0_POSN                               0x1
#define _LCDDATA13_S33C0_POSITION                           0x1
#define _LCDDATA13_S33C0_SIZE                               0x1
#define _LCDDATA13_S33C0_LENGTH                             0x1
#define _LCDDATA13_S33C0_MASK                               0x2
#define _LCDDATA13_S34C0_POSN                               0x2
#define _LCDDATA13_S34C0_POSITION                           0x2
#define _LCDDATA13_S34C0_SIZE                               0x1
#define _LCDDATA13_S34C0_LENGTH                             0x1
#define _LCDDATA13_S34C0_MASK                               0x4
#define _LCDDATA13_S35C0_POSN                               0x3
#define _LCDDATA13_S35C0_POSITION                           0x3
#define _LCDDATA13_S35C0_SIZE                               0x1
#define _LCDDATA13_S35C0_LENGTH                             0x1
#define _LCDDATA13_S35C0_MASK                               0x8
#define _LCDDATA13_S36C0_POSN                               0x4
#define _LCDDATA13_S36C0_POSITION                           0x4
#define _LCDDATA13_S36C0_SIZE                               0x1
#define _LCDDATA13_S36C0_LENGTH                             0x1
#define _LCDDATA13_S36C0_MASK                               0x10
#define _LCDDATA13_S37C0_POSN                               0x5
#define _LCDDATA13_S37C0_POSITION                           0x5
#define _LCDDATA13_S37C0_SIZE                               0x1
#define _LCDDATA13_S37C0_LENGTH                             0x1
#define _LCDDATA13_S37C0_MASK                               0x20
#define _LCDDATA13_S38C0_POSN                               0x6
#define _LCDDATA13_S38C0_POSITION                           0x6
#define _LCDDATA13_S38C0_SIZE                               0x1
#define _LCDDATA13_S38C0_LENGTH                             0x1
#define _LCDDATA13_S38C0_MASK                               0x40
#define _LCDDATA13_S39C0_POSN                               0x7
#define _LCDDATA13_S39C0_POSITION                           0x7
#define _LCDDATA13_S39C0_SIZE                               0x1
#define _LCDDATA13_S39C0_LENGTH                             0x1
#define _LCDDATA13_S39C0_MASK                               0x80

// Register: LCDDATA14
#define LCDDATA14 LCDDATA14
extern volatile unsigned char           LCDDATA14           __at(0x192);
#ifndef _LIB_BUILD
asm("LCDDATA14 equ 0192h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SEG40                  :1;
        unsigned SEG41                  :1;
    };
    struct {
        unsigned SEG40COM0              :1;
        unsigned SEG41COM0              :1;
    };
    struct {
        unsigned S40C0                  :1;
        unsigned S41C0                  :1;
    };
} LCDDATA14bits_t;
