MikroElektronika/core_packages/PIC/XC8/def/PIC16F946/mcu.h
extern volatile LCDDATA14bits_t LCDDATA14bits __at(0x192);
// bitfield macros
#define _LCDDATA14_SEG40_POSN                               0x0
#define _LCDDATA14_SEG40_POSITION                           0x0
#define _LCDDATA14_SEG40_SIZE                               0x1
#define _LCDDATA14_SEG40_LENGTH                             0x1
#define _LCDDATA14_SEG40_MASK                               0x1
#define _LCDDATA14_SEG41_POSN                               0x1
#define _LCDDATA14_SEG41_POSITION                           0x1
#define _LCDDATA14_SEG41_SIZE                               0x1
#define _LCDDATA14_SEG41_LENGTH                             0x1
#define _LCDDATA14_SEG41_MASK                               0x2
#define _LCDDATA14_SEG40COM0_POSN                           0x0
#define _LCDDATA14_SEG40COM0_POSITION                       0x0
#define _LCDDATA14_SEG40COM0_SIZE                           0x1
#define _LCDDATA14_SEG40COM0_LENGTH                         0x1
#define _LCDDATA14_SEG40COM0_MASK                           0x1
#define _LCDDATA14_SEG41COM0_POSN                           0x1
#define _LCDDATA14_SEG41COM0_POSITION                       0x1
#define _LCDDATA14_SEG41COM0_SIZE                           0x1
#define _LCDDATA14_SEG41COM0_LENGTH                         0x1
#define _LCDDATA14_SEG41COM0_MASK                           0x2
#define _LCDDATA14_S40C0_POSN                               0x0
#define _LCDDATA14_S40C0_POSITION                           0x0
#define _LCDDATA14_S40C0_SIZE                               0x1
#define _LCDDATA14_S40C0_LENGTH                             0x1
#define _LCDDATA14_S40C0_MASK                               0x1
#define _LCDDATA14_S41C0_POSN                               0x1
#define _LCDDATA14_S41C0_POSITION                           0x1
#define _LCDDATA14_S41C0_SIZE                               0x1
#define _LCDDATA14_S41C0_LENGTH                             0x1
#define _LCDDATA14_S41C0_MASK                               0x2

// Register: LCDDATA15
#define LCDDATA15 LCDDATA15
extern volatile unsigned char           LCDDATA15           __at(0x193);
#ifndef _LIB_BUILD
asm("LCDDATA15 equ 0193h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SEG24                  :1;
        unsigned SEG25                  :1;
        unsigned SEG26                  :1;
        unsigned SEG27                  :1;
        unsigned SEG28                  :1;
        unsigned SEG29                  :1;
        unsigned SEG30                  :1;
        unsigned SEG31                  :1;
    };
    struct {
        unsigned SEG24COM1              :1;
        unsigned SEG25COM1              :1;
        unsigned SEG26COM1              :1;
        unsigned SEG27COM1              :1;
        unsigned SEG28COM1              :1;
        unsigned SEG29COM1              :1;
        unsigned SEG30COM1              :1;
        unsigned SEG31COM1              :1;
    };
    struct {
        unsigned S24C1                  :1;
        unsigned S25C1                  :1;
        unsigned S26C1                  :1;
        unsigned S27C1                  :1;
        unsigned S28C1                  :1;
        unsigned S29C1                  :1;
        unsigned S30C1                  :1;
        unsigned S31C1                  :1;
    };
} LCDDATA15bits_t;
extern volatile LCDDATA15bits_t LCDDATA15bits __at(0x193);
// bitfield macros
#define _LCDDATA15_SEG24_POSN                               0x0
#define _LCDDATA15_SEG24_POSITION                           0x0
#define _LCDDATA15_SEG24_SIZE                               0x1
#define _LCDDATA15_SEG24_LENGTH                             0x1
#define _LCDDATA15_SEG24_MASK                               0x1
#define _LCDDATA15_SEG25_POSN                               0x1
#define _LCDDATA15_SEG25_POSITION                           0x1
#define _LCDDATA15_SEG25_SIZE                               0x1
#define _LCDDATA15_SEG25_LENGTH                             0x1
#define _LCDDATA15_SEG25_MASK                               0x2
#define _LCDDATA15_SEG26_POSN                               0x2
#define _LCDDATA15_SEG26_POSITION                           0x2
#define _LCDDATA15_SEG26_SIZE                               0x1
#define _LCDDATA15_SEG26_LENGTH                             0x1
#define _LCDDATA15_SEG26_MASK                               0x4
#define _LCDDATA15_SEG27_POSN                               0x3
#define _LCDDATA15_SEG27_POSITION                           0x3
#define _LCDDATA15_SEG27_SIZE                               0x1
#define _LCDDATA15_SEG27_LENGTH                             0x1
#define _LCDDATA15_SEG27_MASK                               0x8
#define _LCDDATA15_SEG28_POSN                               0x4
#define _LCDDATA15_SEG28_POSITION                           0x4
#define _LCDDATA15_SEG28_SIZE                               0x1
#define _LCDDATA15_SEG28_LENGTH                             0x1
#define _LCDDATA15_SEG28_MASK                               0x10
#define _LCDDATA15_SEG29_POSN                               0x5
#define _LCDDATA15_SEG29_POSITION                           0x5
#define _LCDDATA15_SEG29_SIZE                               0x1
#define _LCDDATA15_SEG29_LENGTH                             0x1
#define _LCDDATA15_SEG29_MASK                               0x20
#define _LCDDATA15_SEG30_POSN                               0x6
#define _LCDDATA15_SEG30_POSITION                           0x6
#define _LCDDATA15_SEG30_SIZE                               0x1
#define _LCDDATA15_SEG30_LENGTH                             0x1
#define _LCDDATA15_SEG30_MASK                               0x40
#define _LCDDATA15_SEG31_POSN                               0x7
#define _LCDDATA15_SEG31_POSITION                           0x7
#define _LCDDATA15_SEG31_SIZE                               0x1
#define _LCDDATA15_SEG31_LENGTH                             0x1
#define _LCDDATA15_SEG31_MASK                               0x80
#define _LCDDATA15_SEG24COM1_POSN                           0x0
#define _LCDDATA15_SEG24COM1_POSITION                       0x0
#define _LCDDATA15_SEG24COM1_SIZE                           0x1
#define _LCDDATA15_SEG24COM1_LENGTH                         0x1
#define _LCDDATA15_SEG24COM1_MASK                           0x1
#define _LCDDATA15_SEG25COM1_POSN                           0x1
#define _LCDDATA15_SEG25COM1_POSITION                       0x1
#define _LCDDATA15_SEG25COM1_SIZE                           0x1
#define _LCDDATA15_SEG25COM1_LENGTH                         0x1
#define _LCDDATA15_SEG25COM1_MASK                           0x2
#define _LCDDATA15_SEG26COM1_POSN                           0x2
#define _LCDDATA15_SEG26COM1_POSITION                       0x2
#define _LCDDATA15_SEG26COM1_SIZE                           0x1
#define _LCDDATA15_SEG26COM1_LENGTH                         0x1
#define _LCDDATA15_SEG26COM1_MASK                           0x4
#define _LCDDATA15_SEG27COM1_POSN                           0x3
#define _LCDDATA15_SEG27COM1_POSITION                       0x3
#define _LCDDATA15_SEG27COM1_SIZE                           0x1
#define _LCDDATA15_SEG27COM1_LENGTH                         0x1
#define _LCDDATA15_SEG27COM1_MASK                           0x8
#define _LCDDATA15_SEG28COM1_POSN                           0x4
#define _LCDDATA15_SEG28COM1_POSITION                       0x4
#define _LCDDATA15_SEG28COM1_SIZE                           0x1
#define _LCDDATA15_SEG28COM1_LENGTH                         0x1
#define _LCDDATA15_SEG28COM1_MASK                           0x10
#define _LCDDATA15_SEG29COM1_POSN                           0x5
#define _LCDDATA15_SEG29COM1_POSITION                       0x5
#define _LCDDATA15_SEG29COM1_SIZE                           0x1
#define _LCDDATA15_SEG29COM1_LENGTH                         0x1
#define _LCDDATA15_SEG29COM1_MASK                           0x20
#define _LCDDATA15_SEG30COM1_POSN                           0x6
#define _LCDDATA15_SEG30COM1_POSITION                       0x6
#define _LCDDATA15_SEG30COM1_SIZE                           0x1
#define _LCDDATA15_SEG30COM1_LENGTH                         0x1
#define _LCDDATA15_SEG30COM1_MASK                           0x40
#define _LCDDATA15_SEG31COM1_POSN                           0x7
#define _LCDDATA15_SEG31COM1_POSITION                       0x7
#define _LCDDATA15_SEG31COM1_SIZE                           0x1
#define _LCDDATA15_SEG31COM1_LENGTH                         0x1
#define _LCDDATA15_SEG31COM1_MASK                           0x80
#define _LCDDATA15_S24C1_POSN                               0x0
#define _LCDDATA15_S24C1_POSITION                           0x0
#define _LCDDATA15_S24C1_SIZE                               0x1
#define _LCDDATA15_S24C1_LENGTH                             0x1
#define _LCDDATA15_S24C1_MASK                               0x1
#define _LCDDATA15_S25C1_POSN                               0x1
#define _LCDDATA15_S25C1_POSITION                           0x1
#define _LCDDATA15_S25C1_SIZE                               0x1
#define _LCDDATA15_S25C1_LENGTH                             0x1
#define _LCDDATA15_S25C1_MASK                               0x2
#define _LCDDATA15_S26C1_POSN                               0x2
#define _LCDDATA15_S26C1_POSITION                           0x2
#define _LCDDATA15_S26C1_SIZE                               0x1
#define _LCDDATA15_S26C1_LENGTH                             0x1
#define _LCDDATA15_S26C1_MASK                               0x4
#define _LCDDATA15_S27C1_POSN                               0x3
#define _LCDDATA15_S27C1_POSITION                           0x3
#define _LCDDATA15_S27C1_SIZE                               0x1
#define _LCDDATA15_S27C1_LENGTH                             0x1
#define _LCDDATA15_S27C1_MASK                               0x8
#define _LCDDATA15_S28C1_POSN                               0x4
#define _LCDDATA15_S28C1_POSITION                           0x4
#define _LCDDATA15_S28C1_SIZE                               0x1
#define _LCDDATA15_S28C1_LENGTH                             0x1
#define _LCDDATA15_S28C1_MASK                               0x10
#define _LCDDATA15_S29C1_POSN                               0x5
#define _LCDDATA15_S29C1_POSITION                           0x5
#define _LCDDATA15_S29C1_SIZE                               0x1
#define _LCDDATA15_S29C1_LENGTH                             0x1
#define _LCDDATA15_S29C1_MASK                               0x20
#define _LCDDATA15_S30C1_POSN                               0x6
#define _LCDDATA15_S30C1_POSITION                           0x6
#define _LCDDATA15_S30C1_SIZE                               0x1
#define _LCDDATA15_S30C1_LENGTH                             0x1
#define _LCDDATA15_S30C1_MASK                               0x40
#define _LCDDATA15_S31C1_POSN                               0x7
#define _LCDDATA15_S31C1_POSITION                           0x7
#define _LCDDATA15_S31C1_SIZE                               0x1
#define _LCDDATA15_S31C1_LENGTH                             0x1
#define _LCDDATA15_S31C1_MASK                               0x80

// Register: LCDDATA16
#define LCDDATA16 LCDDATA16
extern volatile unsigned char           LCDDATA16           __at(0x194);
#ifndef _LIB_BUILD
asm("LCDDATA16 equ 0194h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SEG32                  :1;
        unsigned SEG33                  :1;
        unsigned SEG34                  :1;
        unsigned SEG35                  :1;
        unsigned SEG36                  :1;
        unsigned SEG37                  :1;
        unsigned SEG38                  :1;
        unsigned SEG39                  :1;
    };
    struct {
        unsigned SEG32COM1              :1;
        unsigned SEG33COM1              :1;
        unsigned SEG34COM1              :1;
        unsigned SEG35COM1              :1;
        unsigned SEG36COM1              :1;
        unsigned SEG37COM1              :1;
        unsigned SEG38COM1              :1;
        unsigned SEG39COM1              :1;
    };
    struct {
        unsigned S32C1                  :1;
        unsigned S33C1                  :1;
        unsigned S34C1                  :1;
        unsigned S35C1                  :1;
        unsigned S36C1                  :1;
        unsigned S37C1                  :1;
        unsigned S38C1                  :1;
        unsigned S39C1                  :1;
    };
} LCDDATA16bits_t;
extern volatile LCDDATA16bits_t LCDDATA16bits __at(0x194);
// bitfield macros
#define _LCDDATA16_SEG32_POSN                               0x0
#define _LCDDATA16_SEG32_POSITION                           0x0
#define _LCDDATA16_SEG32_SIZE                               0x1
#define _LCDDATA16_SEG32_LENGTH                             0x1
#define _LCDDATA16_SEG32_MASK                               0x1
#define _LCDDATA16_SEG33_POSN                               0x1
#define _LCDDATA16_SEG33_POSITION                           0x1
#define _LCDDATA16_SEG33_SIZE                               0x1
#define _LCDDATA16_SEG33_LENGTH                             0x1
#define _LCDDATA16_SEG33_MASK                               0x2
#define _LCDDATA16_SEG34_POSN                               0x2
#define _LCDDATA16_SEG34_POSITION                           0x2
#define _LCDDATA16_SEG34_SIZE                               0x1
#define _LCDDATA16_SEG34_LENGTH                             0x1
#define _LCDDATA16_SEG34_MASK                               0x4
#define _LCDDATA16_SEG35_POSN                               0x3
#define _LCDDATA16_SEG35_POSITION                           0x3
#define _LCDDATA16_SEG35_SIZE                               0x1
#define _LCDDATA16_SEG35_LENGTH                             0x1
#define _LCDDATA16_SEG35_MASK                               0x8
#define _LCDDATA16_SEG36_POSN                               0x4
#define _LCDDATA16_SEG36_POSITION                           0x4
#define _LCDDATA16_SEG36_SIZE                               0x1
#define _LCDDATA16_SEG36_LENGTH                             0x1
#define _LCDDATA16_SEG36_MASK                               0x10
#define _LCDDATA16_SEG37_POSN                               0x5
#define _LCDDATA16_SEG37_POSITION                           0x5
#define _LCDDATA16_SEG37_SIZE                               0x1
#define _LCDDATA16_SEG37_LENGTH                             0x1
#define _LCDDATA16_SEG37_MASK                               0x20
#define _LCDDATA16_SEG38_POSN                               0x6
#define _LCDDATA16_SEG38_POSITION                           0x6
#define _LCDDATA16_SEG38_SIZE                               0x1
#define _LCDDATA16_SEG38_LENGTH                             0x1
#define _LCDDATA16_SEG38_MASK                               0x40
#define _LCDDATA16_SEG39_POSN                               0x7
#define _LCDDATA16_SEG39_POSITION                           0x7
#define _LCDDATA16_SEG39_SIZE                               0x1
#define _LCDDATA16_SEG39_LENGTH                             0x1
#define _LCDDATA16_SEG39_MASK                               0x80
#define _LCDDATA16_SEG32COM1_POSN                           0x0
#define _LCDDATA16_SEG32COM1_POSITION                       0x0
#define _LCDDATA16_SEG32COM1_SIZE                           0x1
#define _LCDDATA16_SEG32COM1_LENGTH                         0x1
#define _LCDDATA16_SEG32COM1_MASK                           0x1
#define _LCDDATA16_SEG33COM1_POSN                           0x1
#define _LCDDATA16_SEG33COM1_POSITION                       0x1
#define _LCDDATA16_SEG33COM1_SIZE                           0x1
#define _LCDDATA16_SEG33COM1_LENGTH                         0x1
#define _LCDDATA16_SEG33COM1_MASK                           0x2
#define _LCDDATA16_SEG34COM1_POSN                           0x2
#define _LCDDATA16_SEG34COM1_POSITION                       0x2
#define _LCDDATA16_SEG34COM1_SIZE                           0x1
#define _LCDDATA16_SEG34COM1_LENGTH                         0x1
#define _LCDDATA16_SEG34COM1_MASK                           0x4
#define _LCDDATA16_SEG35COM1_POSN                           0x3
#define _LCDDATA16_SEG35COM1_POSITION                       0x3
#define _LCDDATA16_SEG35COM1_SIZE                           0x1
#define _LCDDATA16_SEG35COM1_LENGTH                         0x1
#define _LCDDATA16_SEG35COM1_MASK                           0x8
#define _LCDDATA16_SEG36COM1_POSN                           0x4
#define _LCDDATA16_SEG36COM1_POSITION                       0x4
#define _LCDDATA16_SEG36COM1_SIZE                           0x1
#define _LCDDATA16_SEG36COM1_LENGTH                         0x1
#define _LCDDATA16_SEG36COM1_MASK                           0x10
#define _LCDDATA16_SEG37COM1_POSN                           0x5
#define _LCDDATA16_SEG37COM1_POSITION                       0x5
#define _LCDDATA16_SEG37COM1_SIZE                           0x1
#define _LCDDATA16_SEG37COM1_LENGTH                         0x1
#define _LCDDATA16_SEG37COM1_MASK                           0x20
#define _LCDDATA16_SEG38COM1_POSN                           0x6
#define _LCDDATA16_SEG38COM1_POSITION                       0x6
#define _LCDDATA16_SEG38COM1_SIZE                           0x1
#define _LCDDATA16_SEG38COM1_LENGTH                         0x1
#define _LCDDATA16_SEG38COM1_MASK                           0x40
#define _LCDDATA16_SEG39COM1_POSN                           0x7
#define _LCDDATA16_SEG39COM1_POSITION                       0x7
#define _LCDDATA16_SEG39COM1_SIZE                           0x1
#define _LCDDATA16_SEG39COM1_LENGTH                         0x1
#define _LCDDATA16_SEG39COM1_MASK                           0x80
#define _LCDDATA16_S32C1_POSN                               0x0
#define _LCDDATA16_S32C1_POSITION                           0x0
#define _LCDDATA16_S32C1_SIZE                               0x1
#define _LCDDATA16_S32C1_LENGTH                             0x1
#define _LCDDATA16_S32C1_MASK                               0x1
#define _LCDDATA16_S33C1_POSN                               0x1
#define _LCDDATA16_S33C1_POSITION                           0x1
#define _LCDDATA16_S33C1_SIZE                               0x1
#define _LCDDATA16_S33C1_LENGTH                             0x1
#define _LCDDATA16_S33C1_MASK                               0x2
#define _LCDDATA16_S34C1_POSN                               0x2
#define _LCDDATA16_S34C1_POSITION                           0x2
#define _LCDDATA16_S34C1_SIZE                               0x1
#define _LCDDATA16_S34C1_LENGTH                             0x1
#define _LCDDATA16_S34C1_MASK                               0x4
#define _LCDDATA16_S35C1_POSN                               0x3
#define _LCDDATA16_S35C1_POSITION                           0x3
#define _LCDDATA16_S35C1_SIZE                               0x1
#define _LCDDATA16_S35C1_LENGTH                             0x1
#define _LCDDATA16_S35C1_MASK                               0x8
#define _LCDDATA16_S36C1_POSN                               0x4
#define _LCDDATA16_S36C1_POSITION                           0x4
#define _LCDDATA16_S36C1_SIZE                               0x1
#define _LCDDATA16_S36C1_LENGTH                             0x1
#define _LCDDATA16_S36C1_MASK                               0x10
#define _LCDDATA16_S37C1_POSN                               0x5
#define _LCDDATA16_S37C1_POSITION                           0x5
#define _LCDDATA16_S37C1_SIZE                               0x1
#define _LCDDATA16_S37C1_LENGTH                             0x1
#define _LCDDATA16_S37C1_MASK                               0x20
#define _LCDDATA16_S38C1_POSN                               0x6
#define _LCDDATA16_S38C1_POSITION                           0x6
#define _LCDDATA16_S38C1_SIZE                               0x1
#define _LCDDATA16_S38C1_LENGTH                             0x1
#define _LCDDATA16_S38C1_MASK                               0x40
#define _LCDDATA16_S39C1_POSN                               0x7
#define _LCDDATA16_S39C1_POSITION                           0x7
#define _LCDDATA16_S39C1_SIZE                               0x1
#define _LCDDATA16_S39C1_LENGTH                             0x1
#define _LCDDATA16_S39C1_MASK                               0x80

