MikroElektronika/core_packages/PIC/XC8/def/PIC16F946/mcu.h
// Register: LCDDATA17
#define LCDDATA17 LCDDATA17
extern volatile unsigned char           LCDDATA17           __at(0x195);
#ifndef _LIB_BUILD
asm("LCDDATA17 equ 0195h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SEG40                  :1;
        unsigned SEG41                  :1;
    };
    struct {
        unsigned SEG40COM1              :1;
        unsigned SEG41COM1              :1;
    };
    struct {
        unsigned S40C1                  :1;
        unsigned S41C1                  :1;
    };
} LCDDATA17bits_t;
extern volatile LCDDATA17bits_t LCDDATA17bits __at(0x195);
// bitfield macros
#define _LCDDATA17_SEG40_POSN                               0x0
#define _LCDDATA17_SEG40_POSITION                           0x0
#define _LCDDATA17_SEG40_SIZE                               0x1
#define _LCDDATA17_SEG40_LENGTH                             0x1
#define _LCDDATA17_SEG40_MASK                               0x1
#define _LCDDATA17_SEG41_POSN                               0x1
#define _LCDDATA17_SEG41_POSITION                           0x1
#define _LCDDATA17_SEG41_SIZE                               0x1
#define _LCDDATA17_SEG41_LENGTH                             0x1
#define _LCDDATA17_SEG41_MASK                               0x2
#define _LCDDATA17_SEG40COM1_POSN                           0x0
#define _LCDDATA17_SEG40COM1_POSITION                       0x0
#define _LCDDATA17_SEG40COM1_SIZE                           0x1
#define _LCDDATA17_SEG40COM1_LENGTH                         0x1
#define _LCDDATA17_SEG40COM1_MASK                           0x1
#define _LCDDATA17_SEG41COM1_POSN                           0x1
#define _LCDDATA17_SEG41COM1_POSITION                       0x1
#define _LCDDATA17_SEG41COM1_SIZE                           0x1
#define _LCDDATA17_SEG41COM1_LENGTH                         0x1
#define _LCDDATA17_SEG41COM1_MASK                           0x2
#define _LCDDATA17_S40C1_POSN                               0x0
#define _LCDDATA17_S40C1_POSITION                           0x0
#define _LCDDATA17_S40C1_SIZE                               0x1
#define _LCDDATA17_S40C1_LENGTH                             0x1
#define _LCDDATA17_S40C1_MASK                               0x1
#define _LCDDATA17_S41C1_POSN                               0x1
#define _LCDDATA17_S41C1_POSITION                           0x1
#define _LCDDATA17_S41C1_SIZE                               0x1
#define _LCDDATA17_S41C1_LENGTH                             0x1
#define _LCDDATA17_S41C1_MASK                               0x2

// Register: LCDDATA18
#define LCDDATA18 LCDDATA18
extern volatile unsigned char           LCDDATA18           __at(0x196);
#ifndef _LIB_BUILD
asm("LCDDATA18 equ 0196h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SEG24                  :1;
        unsigned SEG25                  :1;
        unsigned SEG26                  :1;
        unsigned SEG27                  :1;
        unsigned SEG28                  :1;
        unsigned SEG29                  :1;
        unsigned SEG30                  :1;
        unsigned SEG31                  :1;
    };
    struct {
        unsigned SEG24COM2              :1;
        unsigned SEG25COM2              :1;
        unsigned SEG26COM2              :1;
        unsigned SEG27COM2              :1;
        unsigned SEG28COM2              :1;
        unsigned SEG29COM2              :1;
        unsigned SEG30COM2              :1;
        unsigned SEG31COM2              :1;
    };
    struct {
        unsigned S24C2                  :1;
        unsigned S25C2                  :1;
        unsigned S26C2                  :1;
        unsigned S27C2                  :1;
        unsigned S28C2                  :1;
        unsigned S29C2                  :1;
        unsigned S30C2                  :1;
        unsigned S31C2                  :1;
    };
} LCDDATA18bits_t;
extern volatile LCDDATA18bits_t LCDDATA18bits __at(0x196);
// bitfield macros
#define _LCDDATA18_SEG24_POSN                               0x0
#define _LCDDATA18_SEG24_POSITION                           0x0
#define _LCDDATA18_SEG24_SIZE                               0x1
#define _LCDDATA18_SEG24_LENGTH                             0x1
#define _LCDDATA18_SEG24_MASK                               0x1
#define _LCDDATA18_SEG25_POSN                               0x1
#define _LCDDATA18_SEG25_POSITION                           0x1
#define _LCDDATA18_SEG25_SIZE                               0x1
#define _LCDDATA18_SEG25_LENGTH                             0x1
#define _LCDDATA18_SEG25_MASK                               0x2
#define _LCDDATA18_SEG26_POSN                               0x2
#define _LCDDATA18_SEG26_POSITION                           0x2
#define _LCDDATA18_SEG26_SIZE                               0x1
#define _LCDDATA18_SEG26_LENGTH                             0x1
#define _LCDDATA18_SEG26_MASK                               0x4
#define _LCDDATA18_SEG27_POSN                               0x3
#define _LCDDATA18_SEG27_POSITION                           0x3
#define _LCDDATA18_SEG27_SIZE                               0x1
#define _LCDDATA18_SEG27_LENGTH                             0x1
#define _LCDDATA18_SEG27_MASK                               0x8
#define _LCDDATA18_SEG28_POSN                               0x4
#define _LCDDATA18_SEG28_POSITION                           0x4
#define _LCDDATA18_SEG28_SIZE                               0x1
#define _LCDDATA18_SEG28_LENGTH                             0x1
#define _LCDDATA18_SEG28_MASK                               0x10
#define _LCDDATA18_SEG29_POSN                               0x5
#define _LCDDATA18_SEG29_POSITION                           0x5
#define _LCDDATA18_SEG29_SIZE                               0x1
#define _LCDDATA18_SEG29_LENGTH                             0x1
#define _LCDDATA18_SEG29_MASK                               0x20
#define _LCDDATA18_SEG30_POSN                               0x6
#define _LCDDATA18_SEG30_POSITION                           0x6
#define _LCDDATA18_SEG30_SIZE                               0x1
#define _LCDDATA18_SEG30_LENGTH                             0x1
#define _LCDDATA18_SEG30_MASK                               0x40
#define _LCDDATA18_SEG31_POSN                               0x7
#define _LCDDATA18_SEG31_POSITION                           0x7
#define _LCDDATA18_SEG31_SIZE                               0x1
#define _LCDDATA18_SEG31_LENGTH                             0x1
#define _LCDDATA18_SEG31_MASK                               0x80
#define _LCDDATA18_SEG24COM2_POSN                           0x0
#define _LCDDATA18_SEG24COM2_POSITION                       0x0
#define _LCDDATA18_SEG24COM2_SIZE                           0x1
#define _LCDDATA18_SEG24COM2_LENGTH                         0x1
#define _LCDDATA18_SEG24COM2_MASK                           0x1
#define _LCDDATA18_SEG25COM2_POSN                           0x1
#define _LCDDATA18_SEG25COM2_POSITION                       0x1
#define _LCDDATA18_SEG25COM2_SIZE                           0x1
#define _LCDDATA18_SEG25COM2_LENGTH                         0x1
#define _LCDDATA18_SEG25COM2_MASK                           0x2
#define _LCDDATA18_SEG26COM2_POSN                           0x2
#define _LCDDATA18_SEG26COM2_POSITION                       0x2
#define _LCDDATA18_SEG26COM2_SIZE                           0x1
#define _LCDDATA18_SEG26COM2_LENGTH                         0x1
#define _LCDDATA18_SEG26COM2_MASK                           0x4
#define _LCDDATA18_SEG27COM2_POSN                           0x3
#define _LCDDATA18_SEG27COM2_POSITION                       0x3
#define _LCDDATA18_SEG27COM2_SIZE                           0x1
#define _LCDDATA18_SEG27COM2_LENGTH                         0x1
#define _LCDDATA18_SEG27COM2_MASK                           0x8
#define _LCDDATA18_SEG28COM2_POSN                           0x4
#define _LCDDATA18_SEG28COM2_POSITION                       0x4
#define _LCDDATA18_SEG28COM2_SIZE                           0x1
#define _LCDDATA18_SEG28COM2_LENGTH                         0x1
#define _LCDDATA18_SEG28COM2_MASK                           0x10
#define _LCDDATA18_SEG29COM2_POSN                           0x5
#define _LCDDATA18_SEG29COM2_POSITION                       0x5
#define _LCDDATA18_SEG29COM2_SIZE                           0x1
#define _LCDDATA18_SEG29COM2_LENGTH                         0x1
#define _LCDDATA18_SEG29COM2_MASK                           0x20
#define _LCDDATA18_SEG30COM2_POSN                           0x6
#define _LCDDATA18_SEG30COM2_POSITION                       0x6
#define _LCDDATA18_SEG30COM2_SIZE                           0x1
#define _LCDDATA18_SEG30COM2_LENGTH                         0x1
#define _LCDDATA18_SEG30COM2_MASK                           0x40
#define _LCDDATA18_SEG31COM2_POSN                           0x7
#define _LCDDATA18_SEG31COM2_POSITION                       0x7
#define _LCDDATA18_SEG31COM2_SIZE                           0x1
#define _LCDDATA18_SEG31COM2_LENGTH                         0x1
#define _LCDDATA18_SEG31COM2_MASK                           0x80
#define _LCDDATA18_S24C2_POSN                               0x0
#define _LCDDATA18_S24C2_POSITION                           0x0
#define _LCDDATA18_S24C2_SIZE                               0x1
#define _LCDDATA18_S24C2_LENGTH                             0x1
#define _LCDDATA18_S24C2_MASK                               0x1
#define _LCDDATA18_S25C2_POSN                               0x1
#define _LCDDATA18_S25C2_POSITION                           0x1
#define _LCDDATA18_S25C2_SIZE                               0x1
#define _LCDDATA18_S25C2_LENGTH                             0x1
#define _LCDDATA18_S25C2_MASK                               0x2
#define _LCDDATA18_S26C2_POSN                               0x2
#define _LCDDATA18_S26C2_POSITION                           0x2
#define _LCDDATA18_S26C2_SIZE                               0x1
#define _LCDDATA18_S26C2_LENGTH                             0x1
#define _LCDDATA18_S26C2_MASK                               0x4
#define _LCDDATA18_S27C2_POSN                               0x3
#define _LCDDATA18_S27C2_POSITION                           0x3
#define _LCDDATA18_S27C2_SIZE                               0x1
#define _LCDDATA18_S27C2_LENGTH                             0x1
#define _LCDDATA18_S27C2_MASK                               0x8
#define _LCDDATA18_S28C2_POSN                               0x4
#define _LCDDATA18_S28C2_POSITION                           0x4
#define _LCDDATA18_S28C2_SIZE                               0x1
#define _LCDDATA18_S28C2_LENGTH                             0x1
#define _LCDDATA18_S28C2_MASK                               0x10
#define _LCDDATA18_S29C2_POSN                               0x5
#define _LCDDATA18_S29C2_POSITION                           0x5
#define _LCDDATA18_S29C2_SIZE                               0x1
#define _LCDDATA18_S29C2_LENGTH                             0x1
#define _LCDDATA18_S29C2_MASK                               0x20
#define _LCDDATA18_S30C2_POSN                               0x6
#define _LCDDATA18_S30C2_POSITION                           0x6
#define _LCDDATA18_S30C2_SIZE                               0x1
#define _LCDDATA18_S30C2_LENGTH                             0x1
#define _LCDDATA18_S30C2_MASK                               0x40
#define _LCDDATA18_S31C2_POSN                               0x7
#define _LCDDATA18_S31C2_POSITION                           0x7
#define _LCDDATA18_S31C2_SIZE                               0x1
#define _LCDDATA18_S31C2_LENGTH                             0x1
#define _LCDDATA18_S31C2_MASK                               0x80

// Register: LCDDATA19
#define LCDDATA19 LCDDATA19
extern volatile unsigned char           LCDDATA19           __at(0x197);
#ifndef _LIB_BUILD
asm("LCDDATA19 equ 0197h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SEG32                  :1;
        unsigned SEG33                  :1;
        unsigned SEG34                  :1;
        unsigned SEG35                  :1;
        unsigned SEG36                  :1;
        unsigned SEG37                  :1;
        unsigned SEG38                  :1;
        unsigned SEG39                  :1;
    };
    struct {
        unsigned SEG32COM2              :1;
        unsigned SEG33COM2              :1;
        unsigned SEG34COM2              :1;
        unsigned SEG35COM2              :1;
        unsigned SEG36COM2              :1;
        unsigned SEG37COM2              :1;
        unsigned SEG38COM2              :1;
        unsigned SEG39COM2              :1;
    };
    struct {
        unsigned S32C2                  :1;
        unsigned S33C2                  :1;
        unsigned S34C2                  :1;
        unsigned S35C2                  :1;
        unsigned S36C2                  :1;
        unsigned S37C2                  :1;
        unsigned S38C2                  :1;
        unsigned S39C2                  :1;
    };
} LCDDATA19bits_t;
extern volatile LCDDATA19bits_t LCDDATA19bits __at(0x197);
// bitfield macros
#define _LCDDATA19_SEG32_POSN                               0x0
#define _LCDDATA19_SEG32_POSITION                           0x0
#define _LCDDATA19_SEG32_SIZE                               0x1
#define _LCDDATA19_SEG32_LENGTH                             0x1
#define _LCDDATA19_SEG32_MASK                               0x1
#define _LCDDATA19_SEG33_POSN                               0x1
#define _LCDDATA19_SEG33_POSITION                           0x1
#define _LCDDATA19_SEG33_SIZE                               0x1
#define _LCDDATA19_SEG33_LENGTH                             0x1
#define _LCDDATA19_SEG33_MASK                               0x2
#define _LCDDATA19_SEG34_POSN                               0x2
#define _LCDDATA19_SEG34_POSITION                           0x2
#define _LCDDATA19_SEG34_SIZE                               0x1
#define _LCDDATA19_SEG34_LENGTH                             0x1
#define _LCDDATA19_SEG34_MASK                               0x4
#define _LCDDATA19_SEG35_POSN                               0x3
#define _LCDDATA19_SEG35_POSITION                           0x3
#define _LCDDATA19_SEG35_SIZE                               0x1
#define _LCDDATA19_SEG35_LENGTH                             0x1
#define _LCDDATA19_SEG35_MASK                               0x8
#define _LCDDATA19_SEG36_POSN                               0x4
#define _LCDDATA19_SEG36_POSITION                           0x4
#define _LCDDATA19_SEG36_SIZE                               0x1
#define _LCDDATA19_SEG36_LENGTH                             0x1
#define _LCDDATA19_SEG36_MASK                               0x10
#define _LCDDATA19_SEG37_POSN                               0x5
#define _LCDDATA19_SEG37_POSITION                           0x5
#define _LCDDATA19_SEG37_SIZE                               0x1
#define _LCDDATA19_SEG37_LENGTH                             0x1
#define _LCDDATA19_SEG37_MASK                               0x20
#define _LCDDATA19_SEG38_POSN                               0x6
#define _LCDDATA19_SEG38_POSITION                           0x6
#define _LCDDATA19_SEG38_SIZE                               0x1
#define _LCDDATA19_SEG38_LENGTH                             0x1
#define _LCDDATA19_SEG38_MASK                               0x40
#define _LCDDATA19_SEG39_POSN                               0x7
#define _LCDDATA19_SEG39_POSITION                           0x7
#define _LCDDATA19_SEG39_SIZE                               0x1
#define _LCDDATA19_SEG39_LENGTH                             0x1
#define _LCDDATA19_SEG39_MASK                               0x80
#define _LCDDATA19_SEG32COM2_POSN                           0x0
#define _LCDDATA19_SEG32COM2_POSITION                       0x0
#define _LCDDATA19_SEG32COM2_SIZE                           0x1
#define _LCDDATA19_SEG32COM2_LENGTH                         0x1
#define _LCDDATA19_SEG32COM2_MASK                           0x1
#define _LCDDATA19_SEG33COM2_POSN                           0x1
#define _LCDDATA19_SEG33COM2_POSITION                       0x1
#define _LCDDATA19_SEG33COM2_SIZE                           0x1
#define _LCDDATA19_SEG33COM2_LENGTH                         0x1
#define _LCDDATA19_SEG33COM2_MASK                           0x2
#define _LCDDATA19_SEG34COM2_POSN                           0x2
#define _LCDDATA19_SEG34COM2_POSITION                       0x2
#define _LCDDATA19_SEG34COM2_SIZE                           0x1
#define _LCDDATA19_SEG34COM2_LENGTH                         0x1
#define _LCDDATA19_SEG34COM2_MASK                           0x4
#define _LCDDATA19_SEG35COM2_POSN                           0x3
#define _LCDDATA19_SEG35COM2_POSITION                       0x3
#define _LCDDATA19_SEG35COM2_SIZE                           0x1
#define _LCDDATA19_SEG35COM2_LENGTH                         0x1
#define _LCDDATA19_SEG35COM2_MASK                           0x8
#define _LCDDATA19_SEG36COM2_POSN                           0x4
#define _LCDDATA19_SEG36COM2_POSITION                       0x4
#define _LCDDATA19_SEG36COM2_SIZE                           0x1
#define _LCDDATA19_SEG36COM2_LENGTH                         0x1
#define _LCDDATA19_SEG36COM2_MASK                           0x10
#define _LCDDATA19_SEG37COM2_POSN                           0x5
#define _LCDDATA19_SEG37COM2_POSITION                       0x5
#define _LCDDATA19_SEG37COM2_SIZE                           0x1
#define _LCDDATA19_SEG37COM2_LENGTH                         0x1
#define _LCDDATA19_SEG37COM2_MASK                           0x20
#define _LCDDATA19_SEG38COM2_POSN                           0x6
#define _LCDDATA19_SEG38COM2_POSITION                       0x6
#define _LCDDATA19_SEG38COM2_SIZE                           0x1
#define _LCDDATA19_SEG38COM2_LENGTH                         0x1
#define _LCDDATA19_SEG38COM2_MASK                           0x40
#define _LCDDATA19_SEG39COM2_POSN                           0x7
#define _LCDDATA19_SEG39COM2_POSITION                       0x7
#define _LCDDATA19_SEG39COM2_SIZE                           0x1
#define _LCDDATA19_SEG39COM2_LENGTH                         0x1
#define _LCDDATA19_SEG39COM2_MASK                           0x80
#define _LCDDATA19_S32C2_POSN                               0x0
#define _LCDDATA19_S32C2_POSITION                           0x0
#define _LCDDATA19_S32C2_SIZE                               0x1
#define _LCDDATA19_S32C2_LENGTH                             0x1
#define _LCDDATA19_S32C2_MASK                               0x1
#define _LCDDATA19_S33C2_POSN                               0x1
#define _LCDDATA19_S33C2_POSITION                           0x1
#define _LCDDATA19_S33C2_SIZE                               0x1
#define _LCDDATA19_S33C2_LENGTH                             0x1
#define _LCDDATA19_S33C2_MASK                               0x2
#define _LCDDATA19_S34C2_POSN                               0x2
#define _LCDDATA19_S34C2_POSITION                           0x2
#define _LCDDATA19_S34C2_SIZE                               0x1
#define _LCDDATA19_S34C2_LENGTH                             0x1
#define _LCDDATA19_S34C2_MASK                               0x4
#define _LCDDATA19_S35C2_POSN                               0x3
#define _LCDDATA19_S35C2_POSITION                           0x3
#define _LCDDATA19_S35C2_SIZE                               0x1
#define _LCDDATA19_S35C2_LENGTH                             0x1
#define _LCDDATA19_S35C2_MASK                               0x8
#define _LCDDATA19_S36C2_POSN                               0x4
#define _LCDDATA19_S36C2_POSITION                           0x4
#define _LCDDATA19_S36C2_SIZE                               0x1
#define _LCDDATA19_S36C2_LENGTH                             0x1
#define _LCDDATA19_S36C2_MASK                               0x10
#define _LCDDATA19_S37C2_POSN                               0x5
#define _LCDDATA19_S37C2_POSITION                           0x5
#define _LCDDATA19_S37C2_SIZE                               0x1
#define _LCDDATA19_S37C2_LENGTH                             0x1
#define _LCDDATA19_S37C2_MASK                               0x20
#define _LCDDATA19_S38C2_POSN                               0x6
#define _LCDDATA19_S38C2_POSITION                           0x6
#define _LCDDATA19_S38C2_SIZE                               0x1
#define _LCDDATA19_S38C2_LENGTH                             0x1
#define _LCDDATA19_S38C2_MASK                               0x40
#define _LCDDATA19_S39C2_POSN                               0x7
#define _LCDDATA19_S39C2_POSITION                           0x7
#define _LCDDATA19_S39C2_SIZE                               0x1
#define _LCDDATA19_S39C2_LENGTH                             0x1
#define _LCDDATA19_S39C2_MASK                               0x80

