MikroElektronika/core_packages/PIC/XC8/def/PIC16F946/mcu.h
// Register: LCDDATA20
#define LCDDATA20 LCDDATA20
extern volatile unsigned char           LCDDATA20           __at(0x198);
#ifndef _LIB_BUILD
asm("LCDDATA20 equ 0198h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SEG40                  :1;
        unsigned SEG41                  :1;
    };
    struct {
        unsigned SEG40COM2              :1;
        unsigned SEG41COM2              :1;
    };
    struct {
        unsigned S40C2                  :1;
        unsigned S41C2                  :1;
    };
} LCDDATA20bits_t;
extern volatile LCDDATA20bits_t LCDDATA20bits __at(0x198);
// bitfield macros
#define _LCDDATA20_SEG40_POSN                               0x0
#define _LCDDATA20_SEG40_POSITION                           0x0
#define _LCDDATA20_SEG40_SIZE                               0x1
#define _LCDDATA20_SEG40_LENGTH                             0x1
#define _LCDDATA20_SEG40_MASK                               0x1
#define _LCDDATA20_SEG41_POSN                               0x1
#define _LCDDATA20_SEG41_POSITION                           0x1
#define _LCDDATA20_SEG41_SIZE                               0x1
#define _LCDDATA20_SEG41_LENGTH                             0x1
#define _LCDDATA20_SEG41_MASK                               0x2
#define _LCDDATA20_SEG40COM2_POSN                           0x0
#define _LCDDATA20_SEG40COM2_POSITION                       0x0
#define _LCDDATA20_SEG40COM2_SIZE                           0x1
#define _LCDDATA20_SEG40COM2_LENGTH                         0x1
#define _LCDDATA20_SEG40COM2_MASK                           0x1
#define _LCDDATA20_SEG41COM2_POSN                           0x1
#define _LCDDATA20_SEG41COM2_POSITION                       0x1
#define _LCDDATA20_SEG41COM2_SIZE                           0x1
#define _LCDDATA20_SEG41COM2_LENGTH                         0x1
#define _LCDDATA20_SEG41COM2_MASK                           0x2
#define _LCDDATA20_S40C2_POSN                               0x0
#define _LCDDATA20_S40C2_POSITION                           0x0
#define _LCDDATA20_S40C2_SIZE                               0x1
#define _LCDDATA20_S40C2_LENGTH                             0x1
#define _LCDDATA20_S40C2_MASK                               0x1
#define _LCDDATA20_S41C2_POSN                               0x1
#define _LCDDATA20_S41C2_POSITION                           0x1
#define _LCDDATA20_S41C2_SIZE                               0x1
#define _LCDDATA20_S41C2_LENGTH                             0x1
#define _LCDDATA20_S41C2_MASK                               0x2

// Register: LCDDATA21
#define LCDDATA21 LCDDATA21
extern volatile unsigned char           LCDDATA21           __at(0x199);
#ifndef _LIB_BUILD
asm("LCDDATA21 equ 0199h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SEG24                  :1;
        unsigned SEG25                  :1;
        unsigned SEG26                  :1;
        unsigned SEG27                  :1;
        unsigned SEG28                  :1;
        unsigned SEG29                  :1;
        unsigned SEG30                  :1;
        unsigned SEG31                  :1;
    };
    struct {
        unsigned SEG24COM3              :1;
        unsigned SEG25COM3              :1;
        unsigned SEG26COM3              :1;
        unsigned SEG27COM3              :1;
        unsigned SEG28COM3              :1;
        unsigned SEG29COM3              :1;
        unsigned SEG30COM3              :1;
        unsigned SEG31COM3              :1;
    };
    struct {
        unsigned S24C3                  :1;
        unsigned S25C3                  :1;
        unsigned S26C3                  :1;
        unsigned S27C3                  :1;
        unsigned S28C3                  :1;
        unsigned S29C3                  :1;
        unsigned S30C3                  :1;
        unsigned S31C3                  :1;
    };
} LCDDATA21bits_t;
extern volatile LCDDATA21bits_t LCDDATA21bits __at(0x199);
// bitfield macros
#define _LCDDATA21_SEG24_POSN                               0x0
#define _LCDDATA21_SEG24_POSITION                           0x0
#define _LCDDATA21_SEG24_SIZE                               0x1
#define _LCDDATA21_SEG24_LENGTH                             0x1
#define _LCDDATA21_SEG24_MASK                               0x1
#define _LCDDATA21_SEG25_POSN                               0x1
#define _LCDDATA21_SEG25_POSITION                           0x1
#define _LCDDATA21_SEG25_SIZE                               0x1
#define _LCDDATA21_SEG25_LENGTH                             0x1
#define _LCDDATA21_SEG25_MASK                               0x2
#define _LCDDATA21_SEG26_POSN                               0x2
#define _LCDDATA21_SEG26_POSITION                           0x2
#define _LCDDATA21_SEG26_SIZE                               0x1
#define _LCDDATA21_SEG26_LENGTH                             0x1
#define _LCDDATA21_SEG26_MASK                               0x4
#define _LCDDATA21_SEG27_POSN                               0x3
#define _LCDDATA21_SEG27_POSITION                           0x3
#define _LCDDATA21_SEG27_SIZE                               0x1
#define _LCDDATA21_SEG27_LENGTH                             0x1
#define _LCDDATA21_SEG27_MASK                               0x8
#define _LCDDATA21_SEG28_POSN                               0x4
#define _LCDDATA21_SEG28_POSITION                           0x4
#define _LCDDATA21_SEG28_SIZE                               0x1
#define _LCDDATA21_SEG28_LENGTH                             0x1
#define _LCDDATA21_SEG28_MASK                               0x10
#define _LCDDATA21_SEG29_POSN                               0x5
#define _LCDDATA21_SEG29_POSITION                           0x5
#define _LCDDATA21_SEG29_SIZE                               0x1
#define _LCDDATA21_SEG29_LENGTH                             0x1
#define _LCDDATA21_SEG29_MASK                               0x20
#define _LCDDATA21_SEG30_POSN                               0x6
#define _LCDDATA21_SEG30_POSITION                           0x6
#define _LCDDATA21_SEG30_SIZE                               0x1
#define _LCDDATA21_SEG30_LENGTH                             0x1
#define _LCDDATA21_SEG30_MASK                               0x40
#define _LCDDATA21_SEG31_POSN                               0x7
#define _LCDDATA21_SEG31_POSITION                           0x7
#define _LCDDATA21_SEG31_SIZE                               0x1
#define _LCDDATA21_SEG31_LENGTH                             0x1
#define _LCDDATA21_SEG31_MASK                               0x80
#define _LCDDATA21_SEG24COM3_POSN                           0x0
#define _LCDDATA21_SEG24COM3_POSITION                       0x0
#define _LCDDATA21_SEG24COM3_SIZE                           0x1
#define _LCDDATA21_SEG24COM3_LENGTH                         0x1
#define _LCDDATA21_SEG24COM3_MASK                           0x1
#define _LCDDATA21_SEG25COM3_POSN                           0x1
#define _LCDDATA21_SEG25COM3_POSITION                       0x1
#define _LCDDATA21_SEG25COM3_SIZE                           0x1
#define _LCDDATA21_SEG25COM3_LENGTH                         0x1
#define _LCDDATA21_SEG25COM3_MASK                           0x2
#define _LCDDATA21_SEG26COM3_POSN                           0x2
#define _LCDDATA21_SEG26COM3_POSITION                       0x2
#define _LCDDATA21_SEG26COM3_SIZE                           0x1
#define _LCDDATA21_SEG26COM3_LENGTH                         0x1
#define _LCDDATA21_SEG26COM3_MASK                           0x4
#define _LCDDATA21_SEG27COM3_POSN                           0x3
#define _LCDDATA21_SEG27COM3_POSITION                       0x3
#define _LCDDATA21_SEG27COM3_SIZE                           0x1
#define _LCDDATA21_SEG27COM3_LENGTH                         0x1
#define _LCDDATA21_SEG27COM3_MASK                           0x8
#define _LCDDATA21_SEG28COM3_POSN                           0x4
#define _LCDDATA21_SEG28COM3_POSITION                       0x4
#define _LCDDATA21_SEG28COM3_SIZE                           0x1
#define _LCDDATA21_SEG28COM3_LENGTH                         0x1
#define _LCDDATA21_SEG28COM3_MASK                           0x10
#define _LCDDATA21_SEG29COM3_POSN                           0x5
#define _LCDDATA21_SEG29COM3_POSITION                       0x5
#define _LCDDATA21_SEG29COM3_SIZE                           0x1
#define _LCDDATA21_SEG29COM3_LENGTH                         0x1
#define _LCDDATA21_SEG29COM3_MASK                           0x20
#define _LCDDATA21_SEG30COM3_POSN                           0x6
#define _LCDDATA21_SEG30COM3_POSITION                       0x6
#define _LCDDATA21_SEG30COM3_SIZE                           0x1
#define _LCDDATA21_SEG30COM3_LENGTH                         0x1
#define _LCDDATA21_SEG30COM3_MASK                           0x40
#define _LCDDATA21_SEG31COM3_POSN                           0x7
#define _LCDDATA21_SEG31COM3_POSITION                       0x7
#define _LCDDATA21_SEG31COM3_SIZE                           0x1
#define _LCDDATA21_SEG31COM3_LENGTH                         0x1
#define _LCDDATA21_SEG31COM3_MASK                           0x80
#define _LCDDATA21_S24C3_POSN                               0x0
#define _LCDDATA21_S24C3_POSITION                           0x0
#define _LCDDATA21_S24C3_SIZE                               0x1
#define _LCDDATA21_S24C3_LENGTH                             0x1
#define _LCDDATA21_S24C3_MASK                               0x1
#define _LCDDATA21_S25C3_POSN                               0x1
#define _LCDDATA21_S25C3_POSITION                           0x1
#define _LCDDATA21_S25C3_SIZE                               0x1
#define _LCDDATA21_S25C3_LENGTH                             0x1
#define _LCDDATA21_S25C3_MASK                               0x2
#define _LCDDATA21_S26C3_POSN                               0x2
#define _LCDDATA21_S26C3_POSITION                           0x2
#define _LCDDATA21_S26C3_SIZE                               0x1
#define _LCDDATA21_S26C3_LENGTH                             0x1
#define _LCDDATA21_S26C3_MASK                               0x4
#define _LCDDATA21_S27C3_POSN                               0x3
#define _LCDDATA21_S27C3_POSITION                           0x3
#define _LCDDATA21_S27C3_SIZE                               0x1
#define _LCDDATA21_S27C3_LENGTH                             0x1
#define _LCDDATA21_S27C3_MASK                               0x8
#define _LCDDATA21_S28C3_POSN                               0x4
#define _LCDDATA21_S28C3_POSITION                           0x4
#define _LCDDATA21_S28C3_SIZE                               0x1
#define _LCDDATA21_S28C3_LENGTH                             0x1
#define _LCDDATA21_S28C3_MASK                               0x10
#define _LCDDATA21_S29C3_POSN                               0x5
#define _LCDDATA21_S29C3_POSITION                           0x5
#define _LCDDATA21_S29C3_SIZE                               0x1
#define _LCDDATA21_S29C3_LENGTH                             0x1
#define _LCDDATA21_S29C3_MASK                               0x20
#define _LCDDATA21_S30C3_POSN                               0x6
#define _LCDDATA21_S30C3_POSITION                           0x6
#define _LCDDATA21_S30C3_SIZE                               0x1
#define _LCDDATA21_S30C3_LENGTH                             0x1
#define _LCDDATA21_S30C3_MASK                               0x40
#define _LCDDATA21_S31C3_POSN                               0x7
#define _LCDDATA21_S31C3_POSITION                           0x7
#define _LCDDATA21_S31C3_SIZE                               0x1
#define _LCDDATA21_S31C3_LENGTH                             0x1
#define _LCDDATA21_S31C3_MASK                               0x80

