MikroElektronika/core_packages/PIC/XC8/def/PIC16F946/mcu.h
// Register: LCDDATA22
#define LCDDATA22 LCDDATA22
extern volatile unsigned char           LCDDATA22           __at(0x19A);
#ifndef _LIB_BUILD
asm("LCDDATA22 equ 019Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SEG32                  :1;
        unsigned SEG33                  :1;
        unsigned SEG34                  :1;
        unsigned SEG35                  :1;
        unsigned SEG36                  :1;
        unsigned SEG37                  :1;
        unsigned SEG38                  :1;
        unsigned SEG39                  :1;
    };
    struct {
        unsigned SEG32COM3              :1;
        unsigned SEG33COM3              :1;
        unsigned SEG34COM3              :1;
        unsigned SEG35COM3              :1;
        unsigned SEG36COM3              :1;
        unsigned SEG37COM3              :1;
        unsigned SEG38COM3              :1;
        unsigned SEG39COM3              :1;
    };
    struct {
        unsigned S32C3                  :1;
        unsigned S33C3                  :1;
        unsigned S34C3                  :1;
        unsigned S35C3                  :1;
        unsigned S36C3                  :1;
        unsigned S37C3                  :1;
        unsigned S38C3                  :1;
        unsigned S39C3                  :1;
    };
} LCDDATA22bits_t;
extern volatile LCDDATA22bits_t LCDDATA22bits __at(0x19A);
// bitfield macros
#define _LCDDATA22_SEG32_POSN                               0x0
#define _LCDDATA22_SEG32_POSITION                           0x0
#define _LCDDATA22_SEG32_SIZE                               0x1
#define _LCDDATA22_SEG32_LENGTH                             0x1
#define _LCDDATA22_SEG32_MASK                               0x1
#define _LCDDATA22_SEG33_POSN                               0x1
#define _LCDDATA22_SEG33_POSITION                           0x1
#define _LCDDATA22_SEG33_SIZE                               0x1
#define _LCDDATA22_SEG33_LENGTH                             0x1
#define _LCDDATA22_SEG33_MASK                               0x2
#define _LCDDATA22_SEG34_POSN                               0x2
#define _LCDDATA22_SEG34_POSITION                           0x2
#define _LCDDATA22_SEG34_SIZE                               0x1
#define _LCDDATA22_SEG34_LENGTH                             0x1
#define _LCDDATA22_SEG34_MASK                               0x4
#define _LCDDATA22_SEG35_POSN                               0x3
#define _LCDDATA22_SEG35_POSITION                           0x3
#define _LCDDATA22_SEG35_SIZE                               0x1
#define _LCDDATA22_SEG35_LENGTH                             0x1
#define _LCDDATA22_SEG35_MASK                               0x8
#define _LCDDATA22_SEG36_POSN                               0x4
#define _LCDDATA22_SEG36_POSITION                           0x4
#define _LCDDATA22_SEG36_SIZE                               0x1
#define _LCDDATA22_SEG36_LENGTH                             0x1
#define _LCDDATA22_SEG36_MASK                               0x10
#define _LCDDATA22_SEG37_POSN                               0x5
#define _LCDDATA22_SEG37_POSITION                           0x5
#define _LCDDATA22_SEG37_SIZE                               0x1
#define _LCDDATA22_SEG37_LENGTH                             0x1
#define _LCDDATA22_SEG37_MASK                               0x20
#define _LCDDATA22_SEG38_POSN                               0x6
#define _LCDDATA22_SEG38_POSITION                           0x6
#define _LCDDATA22_SEG38_SIZE                               0x1
#define _LCDDATA22_SEG38_LENGTH                             0x1
#define _LCDDATA22_SEG38_MASK                               0x40
#define _LCDDATA22_SEG39_POSN                               0x7
#define _LCDDATA22_SEG39_POSITION                           0x7
#define _LCDDATA22_SEG39_SIZE                               0x1
#define _LCDDATA22_SEG39_LENGTH                             0x1
#define _LCDDATA22_SEG39_MASK                               0x80
#define _LCDDATA22_SEG32COM3_POSN                           0x0
#define _LCDDATA22_SEG32COM3_POSITION                       0x0
#define _LCDDATA22_SEG32COM3_SIZE                           0x1
#define _LCDDATA22_SEG32COM3_LENGTH                         0x1
#define _LCDDATA22_SEG32COM3_MASK                           0x1
#define _LCDDATA22_SEG33COM3_POSN                           0x1
#define _LCDDATA22_SEG33COM3_POSITION                       0x1
#define _LCDDATA22_SEG33COM3_SIZE                           0x1
#define _LCDDATA22_SEG33COM3_LENGTH                         0x1
#define _LCDDATA22_SEG33COM3_MASK                           0x2
#define _LCDDATA22_SEG34COM3_POSN                           0x2
#define _LCDDATA22_SEG34COM3_POSITION                       0x2
#define _LCDDATA22_SEG34COM3_SIZE                           0x1
#define _LCDDATA22_SEG34COM3_LENGTH                         0x1
#define _LCDDATA22_SEG34COM3_MASK                           0x4
#define _LCDDATA22_SEG35COM3_POSN                           0x3
#define _LCDDATA22_SEG35COM3_POSITION                       0x3
#define _LCDDATA22_SEG35COM3_SIZE                           0x1
#define _LCDDATA22_SEG35COM3_LENGTH                         0x1
#define _LCDDATA22_SEG35COM3_MASK                           0x8
#define _LCDDATA22_SEG36COM3_POSN                           0x4
#define _LCDDATA22_SEG36COM3_POSITION                       0x4
#define _LCDDATA22_SEG36COM3_SIZE                           0x1
#define _LCDDATA22_SEG36COM3_LENGTH                         0x1
#define _LCDDATA22_SEG36COM3_MASK                           0x10
#define _LCDDATA22_SEG37COM3_POSN                           0x5
#define _LCDDATA22_SEG37COM3_POSITION                       0x5
#define _LCDDATA22_SEG37COM3_SIZE                           0x1
#define _LCDDATA22_SEG37COM3_LENGTH                         0x1
#define _LCDDATA22_SEG37COM3_MASK                           0x20
#define _LCDDATA22_SEG38COM3_POSN                           0x6
#define _LCDDATA22_SEG38COM3_POSITION                       0x6
#define _LCDDATA22_SEG38COM3_SIZE                           0x1
#define _LCDDATA22_SEG38COM3_LENGTH                         0x1
#define _LCDDATA22_SEG38COM3_MASK                           0x40
#define _LCDDATA22_SEG39COM3_POSN                           0x7
#define _LCDDATA22_SEG39COM3_POSITION                       0x7
#define _LCDDATA22_SEG39COM3_SIZE                           0x1
#define _LCDDATA22_SEG39COM3_LENGTH                         0x1
#define _LCDDATA22_SEG39COM3_MASK                           0x80
#define _LCDDATA22_S32C3_POSN                               0x0
#define _LCDDATA22_S32C3_POSITION                           0x0
#define _LCDDATA22_S32C3_SIZE                               0x1
#define _LCDDATA22_S32C3_LENGTH                             0x1
#define _LCDDATA22_S32C3_MASK                               0x1
#define _LCDDATA22_S33C3_POSN                               0x1
#define _LCDDATA22_S33C3_POSITION                           0x1
#define _LCDDATA22_S33C3_SIZE                               0x1
#define _LCDDATA22_S33C3_LENGTH                             0x1
#define _LCDDATA22_S33C3_MASK                               0x2
#define _LCDDATA22_S34C3_POSN                               0x2
#define _LCDDATA22_S34C3_POSITION                           0x2
#define _LCDDATA22_S34C3_SIZE                               0x1
#define _LCDDATA22_S34C3_LENGTH                             0x1
#define _LCDDATA22_S34C3_MASK                               0x4
#define _LCDDATA22_S35C3_POSN                               0x3
#define _LCDDATA22_S35C3_POSITION                           0x3
#define _LCDDATA22_S35C3_SIZE                               0x1
#define _LCDDATA22_S35C3_LENGTH                             0x1
#define _LCDDATA22_S35C3_MASK                               0x8
#define _LCDDATA22_S36C3_POSN                               0x4
#define _LCDDATA22_S36C3_POSITION                           0x4
#define _LCDDATA22_S36C3_SIZE                               0x1
#define _LCDDATA22_S36C3_LENGTH                             0x1
#define _LCDDATA22_S36C3_MASK                               0x10
#define _LCDDATA22_S37C3_POSN                               0x5
#define _LCDDATA22_S37C3_POSITION                           0x5
#define _LCDDATA22_S37C3_SIZE                               0x1
#define _LCDDATA22_S37C3_LENGTH                             0x1
#define _LCDDATA22_S37C3_MASK                               0x20
#define _LCDDATA22_S38C3_POSN                               0x6
#define _LCDDATA22_S38C3_POSITION                           0x6
#define _LCDDATA22_S38C3_SIZE                               0x1
#define _LCDDATA22_S38C3_LENGTH                             0x1
#define _LCDDATA22_S38C3_MASK                               0x40
#define _LCDDATA22_S39C3_POSN                               0x7
#define _LCDDATA22_S39C3_POSITION                           0x7
#define _LCDDATA22_S39C3_SIZE                               0x1
#define _LCDDATA22_S39C3_LENGTH                             0x1
#define _LCDDATA22_S39C3_MASK                               0x80

// Register: LCDDATA23
#define LCDDATA23 LCDDATA23
extern volatile unsigned char           LCDDATA23           __at(0x19B);
#ifndef _LIB_BUILD
asm("LCDDATA23 equ 019Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SEG40                  :1;
        unsigned SEG41                  :1;
    };
    struct {
        unsigned SEG40COM3              :1;
        unsigned SEG41COM3              :1;
    };
    struct {
        unsigned S40C3                  :1;
        unsigned S41C3                  :1;
    };
} LCDDATA23bits_t;
extern volatile LCDDATA23bits_t LCDDATA23bits __at(0x19B);
// bitfield macros
#define _LCDDATA23_SEG40_POSN                               0x0
#define _LCDDATA23_SEG40_POSITION                           0x0
#define _LCDDATA23_SEG40_SIZE                               0x1
#define _LCDDATA23_SEG40_LENGTH                             0x1
#define _LCDDATA23_SEG40_MASK                               0x1
#define _LCDDATA23_SEG41_POSN                               0x1
#define _LCDDATA23_SEG41_POSITION                           0x1
#define _LCDDATA23_SEG41_SIZE                               0x1
#define _LCDDATA23_SEG41_LENGTH                             0x1
#define _LCDDATA23_SEG41_MASK                               0x2
#define _LCDDATA23_SEG40COM3_POSN                           0x0
#define _LCDDATA23_SEG40COM3_POSITION                       0x0
#define _LCDDATA23_SEG40COM3_SIZE                           0x1
#define _LCDDATA23_SEG40COM3_LENGTH                         0x1
#define _LCDDATA23_SEG40COM3_MASK                           0x1
#define _LCDDATA23_SEG41COM3_POSN                           0x1
#define _LCDDATA23_SEG41COM3_POSITION                       0x1
#define _LCDDATA23_SEG41COM3_SIZE                           0x1
#define _LCDDATA23_SEG41COM3_LENGTH                         0x1
#define _LCDDATA23_SEG41COM3_MASK                           0x2
#define _LCDDATA23_S40C3_POSN                               0x0
#define _LCDDATA23_S40C3_POSITION                           0x0
#define _LCDDATA23_S40C3_SIZE                               0x1
#define _LCDDATA23_S40C3_LENGTH                             0x1
#define _LCDDATA23_S40C3_MASK                               0x1
#define _LCDDATA23_S41C3_POSN                               0x1
#define _LCDDATA23_S41C3_POSITION                           0x1
#define _LCDDATA23_S41C3_SIZE                               0x1
#define _LCDDATA23_S41C3_LENGTH                             0x1
#define _LCDDATA23_S41C3_MASK                               0x2

// Register: LCDSE3
#define LCDSE3 LCDSE3
extern volatile unsigned char           LCDSE3              __at(0x19C);
#ifndef _LIB_BUILD
asm("LCDSE3 equ 019Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SEG24                  :1;
        unsigned SEG25                  :1;
        unsigned SEG26                  :1;
        unsigned SEG27                  :1;
        unsigned SEG28                  :1;
        unsigned SEG29                  :1;
        unsigned SEG30                  :1;
        unsigned SEG31                  :1;
    };
    struct {
        unsigned SE24                   :1;
        unsigned SE25                   :1;
        unsigned SE26                   :1;
        unsigned SE27                   :1;
        unsigned SE28                   :1;
        unsigned SE29                   :1;
        unsigned SE30                   :1;
        unsigned SE31                   :1;
    };
    struct {
        unsigned SEGEN24                :1;
        unsigned SEGEN25                :1;
        unsigned SEGEN26                :1;
        unsigned SEGEN27                :1;
        unsigned SEGEN28                :1;
        unsigned SEGEN29                :1;
        unsigned SEGEN30                :1;
        unsigned SEGEN31                :1;
    };
} LCDSE3bits_t;
