MikroElektronika/core_packages/PIC/XC8/def/PIC16F946/mcu.h
extern volatile LCDSE3bits_t LCDSE3bits __at(0x19C);
// bitfield macros
#define _LCDSE3_SEG24_POSN                                  0x0
#define _LCDSE3_SEG24_POSITION                              0x0
#define _LCDSE3_SEG24_SIZE                                  0x1
#define _LCDSE3_SEG24_LENGTH                                0x1
#define _LCDSE3_SEG24_MASK                                  0x1
#define _LCDSE3_SEG25_POSN                                  0x1
#define _LCDSE3_SEG25_POSITION                              0x1
#define _LCDSE3_SEG25_SIZE                                  0x1
#define _LCDSE3_SEG25_LENGTH                                0x1
#define _LCDSE3_SEG25_MASK                                  0x2
#define _LCDSE3_SEG26_POSN                                  0x2
#define _LCDSE3_SEG26_POSITION                              0x2
#define _LCDSE3_SEG26_SIZE                                  0x1
#define _LCDSE3_SEG26_LENGTH                                0x1
#define _LCDSE3_SEG26_MASK                                  0x4
#define _LCDSE3_SEG27_POSN                                  0x3
#define _LCDSE3_SEG27_POSITION                              0x3
#define _LCDSE3_SEG27_SIZE                                  0x1
#define _LCDSE3_SEG27_LENGTH                                0x1
#define _LCDSE3_SEG27_MASK                                  0x8
#define _LCDSE3_SEG28_POSN                                  0x4
#define _LCDSE3_SEG28_POSITION                              0x4
#define _LCDSE3_SEG28_SIZE                                  0x1
#define _LCDSE3_SEG28_LENGTH                                0x1
#define _LCDSE3_SEG28_MASK                                  0x10
#define _LCDSE3_SEG29_POSN                                  0x5
#define _LCDSE3_SEG29_POSITION                              0x5
#define _LCDSE3_SEG29_SIZE                                  0x1
#define _LCDSE3_SEG29_LENGTH                                0x1
#define _LCDSE3_SEG29_MASK                                  0x20
#define _LCDSE3_SEG30_POSN                                  0x6
#define _LCDSE3_SEG30_POSITION                              0x6
#define _LCDSE3_SEG30_SIZE                                  0x1
#define _LCDSE3_SEG30_LENGTH                                0x1
#define _LCDSE3_SEG30_MASK                                  0x40
#define _LCDSE3_SEG31_POSN                                  0x7
#define _LCDSE3_SEG31_POSITION                              0x7
#define _LCDSE3_SEG31_SIZE                                  0x1
#define _LCDSE3_SEG31_LENGTH                                0x1
#define _LCDSE3_SEG31_MASK                                  0x80
#define _LCDSE3_SE24_POSN                                   0x0
#define _LCDSE3_SE24_POSITION                               0x0
#define _LCDSE3_SE24_SIZE                                   0x1
#define _LCDSE3_SE24_LENGTH                                 0x1
#define _LCDSE3_SE24_MASK                                   0x1
#define _LCDSE3_SE25_POSN                                   0x1
#define _LCDSE3_SE25_POSITION                               0x1
#define _LCDSE3_SE25_SIZE                                   0x1
#define _LCDSE3_SE25_LENGTH                                 0x1
#define _LCDSE3_SE25_MASK                                   0x2
#define _LCDSE3_SE26_POSN                                   0x2
#define _LCDSE3_SE26_POSITION                               0x2
#define _LCDSE3_SE26_SIZE                                   0x1
#define _LCDSE3_SE26_LENGTH                                 0x1
#define _LCDSE3_SE26_MASK                                   0x4
#define _LCDSE3_SE27_POSN                                   0x3
#define _LCDSE3_SE27_POSITION                               0x3
#define _LCDSE3_SE27_SIZE                                   0x1
#define _LCDSE3_SE27_LENGTH                                 0x1
#define _LCDSE3_SE27_MASK                                   0x8
#define _LCDSE3_SE28_POSN                                   0x4
#define _LCDSE3_SE28_POSITION                               0x4
#define _LCDSE3_SE28_SIZE                                   0x1
#define _LCDSE3_SE28_LENGTH                                 0x1
#define _LCDSE3_SE28_MASK                                   0x10
#define _LCDSE3_SE29_POSN                                   0x5
#define _LCDSE3_SE29_POSITION                               0x5
#define _LCDSE3_SE29_SIZE                                   0x1
#define _LCDSE3_SE29_LENGTH                                 0x1
#define _LCDSE3_SE29_MASK                                   0x20
#define _LCDSE3_SE30_POSN                                   0x6
#define _LCDSE3_SE30_POSITION                               0x6
#define _LCDSE3_SE30_SIZE                                   0x1
#define _LCDSE3_SE30_LENGTH                                 0x1
#define _LCDSE3_SE30_MASK                                   0x40
#define _LCDSE3_SE31_POSN                                   0x7
#define _LCDSE3_SE31_POSITION                               0x7
#define _LCDSE3_SE31_SIZE                                   0x1
#define _LCDSE3_SE31_LENGTH                                 0x1
#define _LCDSE3_SE31_MASK                                   0x80
#define _LCDSE3_SEGEN24_POSN                                0x0
#define _LCDSE3_SEGEN24_POSITION                            0x0
#define _LCDSE3_SEGEN24_SIZE                                0x1
#define _LCDSE3_SEGEN24_LENGTH                              0x1
#define _LCDSE3_SEGEN24_MASK                                0x1
#define _LCDSE3_SEGEN25_POSN                                0x1
#define _LCDSE3_SEGEN25_POSITION                            0x1
#define _LCDSE3_SEGEN25_SIZE                                0x1
#define _LCDSE3_SEGEN25_LENGTH                              0x1
#define _LCDSE3_SEGEN25_MASK                                0x2
#define _LCDSE3_SEGEN26_POSN                                0x2
#define _LCDSE3_SEGEN26_POSITION                            0x2
#define _LCDSE3_SEGEN26_SIZE                                0x1
#define _LCDSE3_SEGEN26_LENGTH                              0x1
#define _LCDSE3_SEGEN26_MASK                                0x4
#define _LCDSE3_SEGEN27_POSN                                0x3
#define _LCDSE3_SEGEN27_POSITION                            0x3
#define _LCDSE3_SEGEN27_SIZE                                0x1
#define _LCDSE3_SEGEN27_LENGTH                              0x1
#define _LCDSE3_SEGEN27_MASK                                0x8
#define _LCDSE3_SEGEN28_POSN                                0x4
#define _LCDSE3_SEGEN28_POSITION                            0x4
#define _LCDSE3_SEGEN28_SIZE                                0x1
#define _LCDSE3_SEGEN28_LENGTH                              0x1
#define _LCDSE3_SEGEN28_MASK                                0x10
#define _LCDSE3_SEGEN29_POSN                                0x5
#define _LCDSE3_SEGEN29_POSITION                            0x5
#define _LCDSE3_SEGEN29_SIZE                                0x1
#define _LCDSE3_SEGEN29_LENGTH                              0x1
#define _LCDSE3_SEGEN29_MASK                                0x20
#define _LCDSE3_SEGEN30_POSN                                0x6
#define _LCDSE3_SEGEN30_POSITION                            0x6
#define _LCDSE3_SEGEN30_SIZE                                0x1
#define _LCDSE3_SEGEN30_LENGTH                              0x1
#define _LCDSE3_SEGEN30_MASK                                0x40
#define _LCDSE3_SEGEN31_POSN                                0x7
#define _LCDSE3_SEGEN31_POSITION                            0x7
#define _LCDSE3_SEGEN31_SIZE                                0x1
#define _LCDSE3_SEGEN31_LENGTH                              0x1
#define _LCDSE3_SEGEN31_MASK                                0x80

