MikroElektronika/core_packages/PIC/XC8/def/PIC16F946/mcu.h
// Register: LCDSE4
#define LCDSE4 LCDSE4
extern volatile unsigned char           LCDSE4              __at(0x19D);
#ifndef _LIB_BUILD
asm("LCDSE4 equ 019Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SEG32                  :1;
        unsigned SEG33                  :1;
        unsigned SEG34                  :1;
        unsigned SEG35                  :1;
        unsigned SEG36                  :1;
        unsigned SEG37                  :1;
        unsigned SEG38                  :1;
        unsigned SEG39                  :1;
    };
    struct {
        unsigned SE32                   :1;
        unsigned SE33                   :1;
        unsigned SE34                   :1;
        unsigned SE35                   :1;
        unsigned SE36                   :1;
        unsigned SE37                   :1;
        unsigned SE38                   :1;
        unsigned SE39                   :1;
    };
    struct {
        unsigned SEGEN32                :1;
        unsigned SEGEN33                :1;
        unsigned SEGEN34                :1;
        unsigned SEGEN35                :1;
        unsigned SEGEN36                :1;
        unsigned SEGEN37                :1;
        unsigned SEGEN38                :1;
        unsigned SEGEN39                :1;
    };
} LCDSE4bits_t;
extern volatile LCDSE4bits_t LCDSE4bits __at(0x19D);
// bitfield macros
#define _LCDSE4_SEG32_POSN                                  0x0
#define _LCDSE4_SEG32_POSITION                              0x0
#define _LCDSE4_SEG32_SIZE                                  0x1
#define _LCDSE4_SEG32_LENGTH                                0x1
#define _LCDSE4_SEG32_MASK                                  0x1
#define _LCDSE4_SEG33_POSN                                  0x1
#define _LCDSE4_SEG33_POSITION                              0x1
#define _LCDSE4_SEG33_SIZE                                  0x1
#define _LCDSE4_SEG33_LENGTH                                0x1
#define _LCDSE4_SEG33_MASK                                  0x2
#define _LCDSE4_SEG34_POSN                                  0x2
#define _LCDSE4_SEG34_POSITION                              0x2
#define _LCDSE4_SEG34_SIZE                                  0x1
#define _LCDSE4_SEG34_LENGTH                                0x1
#define _LCDSE4_SEG34_MASK                                  0x4
#define _LCDSE4_SEG35_POSN                                  0x3
#define _LCDSE4_SEG35_POSITION                              0x3
#define _LCDSE4_SEG35_SIZE                                  0x1
#define _LCDSE4_SEG35_LENGTH                                0x1
#define _LCDSE4_SEG35_MASK                                  0x8
#define _LCDSE4_SEG36_POSN                                  0x4
#define _LCDSE4_SEG36_POSITION                              0x4
#define _LCDSE4_SEG36_SIZE                                  0x1
#define _LCDSE4_SEG36_LENGTH                                0x1
#define _LCDSE4_SEG36_MASK                                  0x10
#define _LCDSE4_SEG37_POSN                                  0x5
#define _LCDSE4_SEG37_POSITION                              0x5
#define _LCDSE4_SEG37_SIZE                                  0x1
#define _LCDSE4_SEG37_LENGTH                                0x1
#define _LCDSE4_SEG37_MASK                                  0x20
#define _LCDSE4_SEG38_POSN                                  0x6
#define _LCDSE4_SEG38_POSITION                              0x6
#define _LCDSE4_SEG38_SIZE                                  0x1
#define _LCDSE4_SEG38_LENGTH                                0x1
#define _LCDSE4_SEG38_MASK                                  0x40
#define _LCDSE4_SEG39_POSN                                  0x7
#define _LCDSE4_SEG39_POSITION                              0x7
#define _LCDSE4_SEG39_SIZE                                  0x1
#define _LCDSE4_SEG39_LENGTH                                0x1
#define _LCDSE4_SEG39_MASK                                  0x80
#define _LCDSE4_SE32_POSN                                   0x0
#define _LCDSE4_SE32_POSITION                               0x0
#define _LCDSE4_SE32_SIZE                                   0x1
#define _LCDSE4_SE32_LENGTH                                 0x1
#define _LCDSE4_SE32_MASK                                   0x1
#define _LCDSE4_SE33_POSN                                   0x1
#define _LCDSE4_SE33_POSITION                               0x1
#define _LCDSE4_SE33_SIZE                                   0x1
#define _LCDSE4_SE33_LENGTH                                 0x1
#define _LCDSE4_SE33_MASK                                   0x2
#define _LCDSE4_SE34_POSN                                   0x2
#define _LCDSE4_SE34_POSITION                               0x2
#define _LCDSE4_SE34_SIZE                                   0x1
#define _LCDSE4_SE34_LENGTH                                 0x1
#define _LCDSE4_SE34_MASK                                   0x4
#define _LCDSE4_SE35_POSN                                   0x3
#define _LCDSE4_SE35_POSITION                               0x3
#define _LCDSE4_SE35_SIZE                                   0x1
#define _LCDSE4_SE35_LENGTH                                 0x1
#define _LCDSE4_SE35_MASK                                   0x8
#define _LCDSE4_SE36_POSN                                   0x4
#define _LCDSE4_SE36_POSITION                               0x4
#define _LCDSE4_SE36_SIZE                                   0x1
#define _LCDSE4_SE36_LENGTH                                 0x1
#define _LCDSE4_SE36_MASK                                   0x10
#define _LCDSE4_SE37_POSN                                   0x5
#define _LCDSE4_SE37_POSITION                               0x5
#define _LCDSE4_SE37_SIZE                                   0x1
#define _LCDSE4_SE37_LENGTH                                 0x1
#define _LCDSE4_SE37_MASK                                   0x20
#define _LCDSE4_SE38_POSN                                   0x6
#define _LCDSE4_SE38_POSITION                               0x6
#define _LCDSE4_SE38_SIZE                                   0x1
#define _LCDSE4_SE38_LENGTH                                 0x1
#define _LCDSE4_SE38_MASK                                   0x40
#define _LCDSE4_SE39_POSN                                   0x7
#define _LCDSE4_SE39_POSITION                               0x7
#define _LCDSE4_SE39_SIZE                                   0x1
#define _LCDSE4_SE39_LENGTH                                 0x1
#define _LCDSE4_SE39_MASK                                   0x80
#define _LCDSE4_SEGEN32_POSN                                0x0
#define _LCDSE4_SEGEN32_POSITION                            0x0
#define _LCDSE4_SEGEN32_SIZE                                0x1
#define _LCDSE4_SEGEN32_LENGTH                              0x1
#define _LCDSE4_SEGEN32_MASK                                0x1
#define _LCDSE4_SEGEN33_POSN                                0x1
#define _LCDSE4_SEGEN33_POSITION                            0x1
#define _LCDSE4_SEGEN33_SIZE                                0x1
#define _LCDSE4_SEGEN33_LENGTH                              0x1
#define _LCDSE4_SEGEN33_MASK                                0x2
#define _LCDSE4_SEGEN34_POSN                                0x2
#define _LCDSE4_SEGEN34_POSITION                            0x2
#define _LCDSE4_SEGEN34_SIZE                                0x1
#define _LCDSE4_SEGEN34_LENGTH                              0x1
#define _LCDSE4_SEGEN34_MASK                                0x4
#define _LCDSE4_SEGEN35_POSN                                0x3
#define _LCDSE4_SEGEN35_POSITION                            0x3
#define _LCDSE4_SEGEN35_SIZE                                0x1
#define _LCDSE4_SEGEN35_LENGTH                              0x1
#define _LCDSE4_SEGEN35_MASK                                0x8
#define _LCDSE4_SEGEN36_POSN                                0x4
#define _LCDSE4_SEGEN36_POSITION                            0x4
#define _LCDSE4_SEGEN36_SIZE                                0x1
#define _LCDSE4_SEGEN36_LENGTH                              0x1
#define _LCDSE4_SEGEN36_MASK                                0x10
#define _LCDSE4_SEGEN37_POSN                                0x5
#define _LCDSE4_SEGEN37_POSITION                            0x5
#define _LCDSE4_SEGEN37_SIZE                                0x1
#define _LCDSE4_SEGEN37_LENGTH                              0x1
#define _LCDSE4_SEGEN37_MASK                                0x20
#define _LCDSE4_SEGEN38_POSN                                0x6
#define _LCDSE4_SEGEN38_POSITION                            0x6
#define _LCDSE4_SEGEN38_SIZE                                0x1
#define _LCDSE4_SEGEN38_LENGTH                              0x1
#define _LCDSE4_SEGEN38_MASK                                0x40
#define _LCDSE4_SEGEN39_POSN                                0x7
#define _LCDSE4_SEGEN39_POSITION                            0x7
#define _LCDSE4_SEGEN39_SIZE                                0x1
#define _LCDSE4_SEGEN39_LENGTH                              0x1
#define _LCDSE4_SEGEN39_MASK                                0x80

// Register: LCDSE5
#define LCDSE5 LCDSE5
extern volatile unsigned char           LCDSE5              __at(0x19E);
#ifndef _LIB_BUILD
asm("LCDSE5 equ 019Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SEG40                  :1;
        unsigned SEG41                  :1;
    };
    struct {
        unsigned SE40                   :1;
        unsigned SE41                   :1;
    };
    struct {
        unsigned SEGEN40                :1;
        unsigned SEGEN41                :1;
    };
} LCDSE5bits_t;
extern volatile LCDSE5bits_t LCDSE5bits __at(0x19E);
// bitfield macros
#define _LCDSE5_SEG40_POSN                                  0x0
#define _LCDSE5_SEG40_POSITION                              0x0
#define _LCDSE5_SEG40_SIZE                                  0x1
#define _LCDSE5_SEG40_LENGTH                                0x1
#define _LCDSE5_SEG40_MASK                                  0x1
#define _LCDSE5_SEG41_POSN                                  0x1
#define _LCDSE5_SEG41_POSITION                              0x1
#define _LCDSE5_SEG41_SIZE                                  0x1
#define _LCDSE5_SEG41_LENGTH                                0x1
#define _LCDSE5_SEG41_MASK                                  0x2
#define _LCDSE5_SE40_POSN                                   0x0
#define _LCDSE5_SE40_POSITION                               0x0
#define _LCDSE5_SE40_SIZE                                   0x1
#define _LCDSE5_SE40_LENGTH                                 0x1
#define _LCDSE5_SE40_MASK                                   0x1
#define _LCDSE5_SE41_POSN                                   0x1
#define _LCDSE5_SE41_POSITION                               0x1
#define _LCDSE5_SE41_SIZE                                   0x1
#define _LCDSE5_SE41_LENGTH                                 0x1
#define _LCDSE5_SE41_MASK                                   0x2
#define _LCDSE5_SEGEN40_POSN                                0x0
#define _LCDSE5_SEGEN40_POSITION                            0x0
#define _LCDSE5_SEGEN40_SIZE                                0x1
#define _LCDSE5_SEGEN40_LENGTH                              0x1
#define _LCDSE5_SEGEN40_MASK                                0x1
#define _LCDSE5_SEGEN41_POSN                                0x1
#define _LCDSE5_SEGEN41_POSITION                            0x1
#define _LCDSE5_SEGEN41_SIZE                                0x1
#define _LCDSE5_SEGEN41_LENGTH                              0x1
#define _LCDSE5_SEGEN41_MASK                                0x2

