MikroElektronika/core_packages/PIC/XC8/def/PIC16F946/mcu.h
/*
 * Bit Definitions
 */
#define _DEPRECATED __attribute__((__deprecated__))
#ifndef BANKMASK
#define BANKMASK(addr) ((addr)&07Fh)
#endif
#define _BIT_ACCESS(r,b) ___mkstr(BANKMASK(r)) "," ___mkstr(b)
#ifndef PAGEMASK
#define PAGEMASK(addr) ((addr)&07FFh)
#endif
// ADCON1<ADCS0>
extern volatile __bit                   ADCS0               __at(0x4FC);	// @ (0x9F * 8 + 4)
#define                                 ADCS0_bit           _BIT_ACCESS(ADCON1,4)
// ADCON1<ADCS1>
extern volatile __bit                   ADCS1               __at(0x4FD);	// @ (0x9F * 8 + 5)
#define                                 ADCS1_bit           _BIT_ACCESS(ADCON1,5)
// ADCON1<ADCS2>
extern volatile __bit                   ADCS2               __at(0x4FE);	// @ (0x9F * 8 + 6)
#define                                 ADCS2_bit           _BIT_ACCESS(ADCON1,6)
// RCSTA<ADDEN>
extern volatile __bit                   ADDEN               __at(0xC3);	// @ (0x18 * 8 + 3)
#define                                 ADDEN_bit           _BIT_ACCESS(RCSTA,3)
// ADCON0<ADFM>
extern volatile __bit                   ADFM                __at(0xFF);	// @ (0x1F * 8 + 7)
#define                                 ADFM_bit            _BIT_ACCESS(ADCON0,7)
// PIE1<ADIE>
extern volatile __bit                   ADIE                __at(0x466);	// @ (0x8C * 8 + 6)
#define                                 ADIE_bit            _BIT_ACCESS(PIE1,6)
// PIR1<ADIF>
extern volatile __bit                   ADIF                __at(0x66);	// @ (0xC * 8 + 6)
#define                                 ADIF_bit            _BIT_ACCESS(PIR1,6)
// ADCON0<ADON>
extern volatile __bit                   ADON                __at(0xF8);	// @ (0x1F * 8 + 0)
#define                                 ADON_bit            _BIT_ACCESS(ADCON0,0)
// ANSEL<AN0>
extern volatile __bit                   AN0                 __at(0x488);	// @ (0x91 * 8 + 0)
#define                                 AN0_bit             _BIT_ACCESS(ANSEL,0)
// ANSEL<AN1>
extern volatile __bit                   AN1                 __at(0x489);	// @ (0x91 * 8 + 1)
#define                                 AN1_bit             _BIT_ACCESS(ANSEL,1)
// ANSEL<AN2>
extern volatile __bit                   AN2                 __at(0x48A);	// @ (0x91 * 8 + 2)
#define                                 AN2_bit             _BIT_ACCESS(ANSEL,2)
// ANSEL<AN3>
extern volatile __bit                   AN3                 __at(0x48B);	// @ (0x91 * 8 + 3)
#define                                 AN3_bit             _BIT_ACCESS(ANSEL,3)
// ANSEL<AN4>
extern volatile __bit                   AN4                 __at(0x48C);	// @ (0x91 * 8 + 4)
#define                                 AN4_bit             _BIT_ACCESS(ANSEL,4)
// ANSEL<AN5>
extern volatile __bit                   AN5                 __at(0x48D);	// @ (0x91 * 8 + 5)
#define                                 AN5_bit             _BIT_ACCESS(ANSEL,5)
// ANSEL<AN6>
extern volatile __bit                   AN6                 __at(0x48E);	// @ (0x91 * 8 + 6)
#define                                 AN6_bit             _BIT_ACCESS(ANSEL,6)
// ANSEL<AN7>
extern volatile __bit                   AN7                 __at(0x48F);	// @ (0x91 * 8 + 7)
#define                                 AN7_bit             _BIT_ACCESS(ANSEL,7)
// ANSEL<ANS0>
extern volatile __bit                   ANS0                __at(0x488);	// @ (0x91 * 8 + 0)
#define                                 ANS0_bit            _BIT_ACCESS(ANSEL,0)
// ANSEL<ANS1>
extern volatile __bit                   ANS1                __at(0x489);	// @ (0x91 * 8 + 1)
#define                                 ANS1_bit            _BIT_ACCESS(ANSEL,1)
// ANSEL<ANS2>
extern volatile __bit                   ANS2                __at(0x48A);	// @ (0x91 * 8 + 2)
#define                                 ANS2_bit            _BIT_ACCESS(ANSEL,2)
// ANSEL<ANS3>
extern volatile __bit                   ANS3                __at(0x48B);	// @ (0x91 * 8 + 3)
#define                                 ANS3_bit            _BIT_ACCESS(ANSEL,3)
// ANSEL<ANS4>
extern volatile __bit                   ANS4                __at(0x48C);	// @ (0x91 * 8 + 4)
#define                                 ANS4_bit            _BIT_ACCESS(ANSEL,4)
// ANSEL<ANS5>
extern volatile __bit                   ANS5                __at(0x48D);	// @ (0x91 * 8 + 5)
#define                                 ANS5_bit            _BIT_ACCESS(ANSEL,5)
// ANSEL<ANS6>
extern volatile __bit                   ANS6                __at(0x48E);	// @ (0x91 * 8 + 6)
#define                                 ANS6_bit            _BIT_ACCESS(ANSEL,6)
// ANSEL<ANS7>
extern volatile __bit                   ANS7                __at(0x48F);	// @ (0x91 * 8 + 7)
#define                                 ANS7_bit            _BIT_ACCESS(ANSEL,7)
// SSPSTAT<BF>
extern volatile __bit                   BF                  __at(0x4A0);	// @ (0x94 * 8 + 0)
#define                                 BF_bit              _BIT_ACCESS(SSPSTAT,0)
// LCDPS<BIASMD>
extern volatile __bit                   BIASMD              __at(0x846);	// @ (0x108 * 8 + 6)
#define                                 BIASMD_bit          _BIT_ACCESS(LCDPS,6)
// TXSTA<BRGH>
extern volatile __bit                   BRGH                __at(0x4C2);	// @ (0x98 * 8 + 2)
#define                                 BRGH_bit            _BIT_ACCESS(TXSTA,2)
// PIE2<C1IE>
extern volatile __bit                   C1IE                __at(0x46D);	// @ (0x8D * 8 + 5)
#define                                 C1IE_bit            _BIT_ACCESS(PIE2,5)
// PIR2<C1IF>
extern volatile __bit                   C1IF                __at(0x6D);	// @ (0xD * 8 + 5)
#define                                 C1IF_bit            _BIT_ACCESS(PIR2,5)
// CMCON0<C1INV>
extern volatile __bit                   C1INV               __at(0x4E4);	// @ (0x9C * 8 + 4)
#define                                 C1INV_bit           _BIT_ACCESS(CMCON0,4)
// CMCON0<C1OUT>
extern volatile __bit                   C1OUT               __at(0x4E6);	// @ (0x9C * 8 + 6)
#define                                 C1OUT_bit           _BIT_ACCESS(CMCON0,6)
// PIE2<C2IE>
extern volatile __bit                   C2IE                __at(0x46E);	// @ (0x8D * 8 + 6)
#define                                 C2IE_bit            _BIT_ACCESS(PIE2,6)
// PIR2<C2IF>
extern volatile __bit                   C2IF                __at(0x6E);	// @ (0xD * 8 + 6)
#define                                 C2IF_bit            _BIT_ACCESS(PIR2,6)
// CMCON0<C2INV>
extern volatile __bit                   C2INV               __at(0x4E5);	// @ (0x9C * 8 + 5)
#define                                 C2INV_bit           _BIT_ACCESS(CMCON0,5)
// CMCON0<C2OUT>
extern volatile __bit                   C2OUT               __at(0x4E7);	// @ (0x9C * 8 + 7)
#define                                 C2OUT_bit           _BIT_ACCESS(CMCON0,7)
// CMCON1<C2SYNC>
extern volatile __bit                   C2SYNC              __at(0x4B8);	// @ (0x97 * 8 + 0)
#define                                 C2SYNC_bit          _BIT_ACCESS(CMCON1,0)
// STATUS<CARRY>
extern volatile __bit                   CARRY               __at(0x18);	// @ (0x3 * 8 + 0)
#define                                 CARRY_bit           _BIT_ACCESS(STATUS,0)
// PIE1<CCP1IE>
extern volatile __bit                   CCP1IE              __at(0x462);	// @ (0x8C * 8 + 2)
#define                                 CCP1IE_bit          _BIT_ACCESS(PIE1,2)
// PIR1<CCP1IF>
extern volatile __bit                   CCP1IF              __at(0x62);	// @ (0xC * 8 + 2)
#define                                 CCP1IF_bit          _BIT_ACCESS(PIR1,2)
// CCP1CON<CCP1M0>
extern volatile __bit                   CCP1M0              __at(0xB8);	// @ (0x17 * 8 + 0)
#define                                 CCP1M0_bit          _BIT_ACCESS(CCP1CON,0)
// CCP1CON<CCP1M1>
extern volatile __bit                   CCP1M1              __at(0xB9);	// @ (0x17 * 8 + 1)
#define                                 CCP1M1_bit          _BIT_ACCESS(CCP1CON,1)
// CCP1CON<CCP1M2>
extern volatile __bit                   CCP1M2              __at(0xBA);	// @ (0x17 * 8 + 2)
#define                                 CCP1M2_bit          _BIT_ACCESS(CCP1CON,2)
// CCP1CON<CCP1M3>
extern volatile __bit                   CCP1M3              __at(0xBB);	// @ (0x17 * 8 + 3)
#define                                 CCP1M3_bit          _BIT_ACCESS(CCP1CON,3)
// CCP1CON<CCP1X>
extern volatile __bit                   CCP1X               __at(0xBD);	// @ (0x17 * 8 + 5)
#define                                 CCP1X_bit           _BIT_ACCESS(CCP1CON,5)
// CCP1CON<CCP1Y>
extern volatile __bit                   CCP1Y               __at(0xBC);	// @ (0x17 * 8 + 4)
#define                                 CCP1Y_bit           _BIT_ACCESS(CCP1CON,4)
// PIE2<CCP2IE>
extern volatile __bit                   CCP2IE              __at(0x468);	// @ (0x8D * 8 + 0)
#define                                 CCP2IE_bit          _BIT_ACCESS(PIE2,0)
// PIR2<CCP2IF>
extern volatile __bit                   CCP2IF              __at(0x68);	// @ (0xD * 8 + 0)
#define                                 CCP2IF_bit          _BIT_ACCESS(PIR2,0)
// CCP2CON<CCP2M0>
extern volatile __bit                   CCP2M0              __at(0xE8);	// @ (0x1D * 8 + 0)
#define                                 CCP2M0_bit          _BIT_ACCESS(CCP2CON,0)
// CCP2CON<CCP2M1>
extern volatile __bit                   CCP2M1              __at(0xE9);	// @ (0x1D * 8 + 1)
#define                                 CCP2M1_bit          _BIT_ACCESS(CCP2CON,1)
// CCP2CON<CCP2M2>
extern volatile __bit                   CCP2M2              __at(0xEA);	// @ (0x1D * 8 + 2)
#define                                 CCP2M2_bit          _BIT_ACCESS(CCP2CON,2)
// CCP2CON<CCP2M3>
extern volatile __bit                   CCP2M3              __at(0xEB);	// @ (0x1D * 8 + 3)
#define                                 CCP2M3_bit          _BIT_ACCESS(CCP2CON,3)
// CCP2CON<CCP2X>
extern volatile __bit                   CCP2X               __at(0xED);	// @ (0x1D * 8 + 5)
#define                                 CCP2X_bit           _BIT_ACCESS(CCP2CON,5)
// CCP2CON<CCP2Y>
extern volatile __bit                   CCP2Y               __at(0xEC);	// @ (0x1D * 8 + 4)
#define                                 CCP2Y_bit           _BIT_ACCESS(CCP2CON,4)
// ADCON0<CHS0>
extern volatile __bit                   CHS0                __at(0xFA);	// @ (0x1F * 8 + 2)
#define                                 CHS0_bit            _BIT_ACCESS(ADCON0,2)
// ADCON0<CHS1>
extern volatile __bit                   CHS1                __at(0xFB);	// @ (0x1F * 8 + 3)
#define                                 CHS1_bit            _BIT_ACCESS(ADCON0,3)
// ADCON0<CHS2>
extern volatile __bit                   CHS2                __at(0xFC);	// @ (0x1F * 8 + 4)
#define                                 CHS2_bit            _BIT_ACCESS(ADCON0,4)
// CMCON0<CIS>
extern volatile __bit                   CIS                 __at(0x4E3);	// @ (0x9C * 8 + 3)
#define                                 CIS_bit             _BIT_ACCESS(CMCON0,3)
// SSPSTAT<CKE>
extern volatile __bit                   CKE                 __at(0x4A6);	// @ (0x94 * 8 + 6)
#define                                 CKE_bit             _BIT_ACCESS(SSPSTAT,6)
// SSPCON<CKP>
extern volatile __bit                   CKP                 __at(0xA4);	// @ (0x14 * 8 + 4)
#define                                 CKP_bit             _BIT_ACCESS(SSPCON,4)
// CMCON0<CM0>
extern volatile __bit                   CM0                 __at(0x4E0);	// @ (0x9C * 8 + 0)
#define                                 CM0_bit             _BIT_ACCESS(CMCON0,0)
// CMCON0<CM1>
extern volatile __bit                   CM1                 __at(0x4E1);	// @ (0x9C * 8 + 1)
#define                                 CM1_bit             _BIT_ACCESS(CMCON0,1)
// CMCON0<CM2>
extern volatile __bit                   CM2                 __at(0x4E2);	// @ (0x9C * 8 + 2)
#define                                 CM2_bit             _BIT_ACCESS(CMCON0,2)
// RCSTA<CREN>
extern volatile __bit                   CREN                __at(0xC4);	// @ (0x18 * 8 + 4)
#define                                 CREN_bit            _BIT_ACCESS(RCSTA,4)
// LCDCON<CS0>
extern volatile __bit                   CS0                 __at(0x83A);	// @ (0x107 * 8 + 2)
#define                                 CS0_bit             _BIT_ACCESS(LCDCON,2)
// LCDCON<CS1>
extern volatile __bit                   CS1                 __at(0x83B);	// @ (0x107 * 8 + 3)
#define                                 CS1_bit             _BIT_ACCESS(LCDCON,3)
// TXSTA<CSRC>
extern volatile __bit                   CSRC                __at(0x4C7);	// @ (0x98 * 8 + 7)
#define                                 CSRC_bit            _BIT_ACCESS(TXSTA,7)
// SSPSTAT<DATA_ADDRESS>
extern volatile __bit                   DATA_ADDRESS        __at(0x4A5);	// @ (0x94 * 8 + 5)
#define                                 DATA_ADDRESS_bit    _BIT_ACCESS(SSPSTAT,5)
// STATUS<DC>
extern volatile __bit                   DC                  __at(0x19);	// @ (0x3 * 8 + 1)
#define                                 DC_bit              _BIT_ACCESS(STATUS,1)
// SSPSTAT<D_A>
extern volatile __bit                   D_A                 __at(0x4A5);	// @ (0x94 * 8 + 5)
#define                                 D_A_bit             _BIT_ACCESS(SSPSTAT,5)
// SSPSTAT<D_nA>
extern volatile __bit                   D_nA                __at(0x4A5);	// @ (0x94 * 8 + 5)
#define                                 D_nA_bit            _BIT_ACCESS(SSPSTAT,5)
// EEADRH<EEADRH0>
extern volatile __bit                   EEADRH0             __at(0x878);	// @ (0x10F * 8 + 0)
#define                                 EEADRH0_bit         _BIT_ACCESS(EEADRH,0)
// EEADRH<EEADRH1>
extern volatile __bit                   EEADRH1             __at(0x879);	// @ (0x10F * 8 + 1)
#define                                 EEADRH1_bit         _BIT_ACCESS(EEADRH,1)
// EEADRH<EEADRH2>
extern volatile __bit                   EEADRH2             __at(0x87A);	// @ (0x10F * 8 + 2)
#define                                 EEADRH2_bit         _BIT_ACCESS(EEADRH,2)
// EEADRH<EEADRH3>
extern volatile __bit                   EEADRH3             __at(0x87B);	// @ (0x10F * 8 + 3)
#define                                 EEADRH3_bit         _BIT_ACCESS(EEADRH,3)
// EEADRH<EEADRH4>
extern volatile __bit                   EEADRH4             __at(0x87C);	// @ (0x10F * 8 + 4)
#define                                 EEADRH4_bit         _BIT_ACCESS(EEADRH,4)
// EEADRL<EEADRL0>
extern volatile __bit                   EEADRL0             __at(0x868);	// @ (0x10D * 8 + 0)
#define                                 EEADRL0_bit         _BIT_ACCESS(EEADRL,0)
// EEADRL<EEADRL1>
extern volatile __bit                   EEADRL1             __at(0x869);	// @ (0x10D * 8 + 1)
#define                                 EEADRL1_bit         _BIT_ACCESS(EEADRL,1)
// EEADRL<EEADRL2>
extern volatile __bit                   EEADRL2             __at(0x86A);	// @ (0x10D * 8 + 2)
#define                                 EEADRL2_bit         _BIT_ACCESS(EEADRL,2)
// EEADRL<EEADRL3>
extern volatile __bit                   EEADRL3             __at(0x86B);	// @ (0x10D * 8 + 3)
#define                                 EEADRL3_bit         _BIT_ACCESS(EEADRL,3)
// EEADRL<EEADRL4>
extern volatile __bit                   EEADRL4             __at(0x86C);	// @ (0x10D * 8 + 4)
#define                                 EEADRL4_bit         _BIT_ACCESS(EEADRL,4)
// EEADRL<EEADRL5>
extern volatile __bit                   EEADRL5             __at(0x86D);	// @ (0x10D * 8 + 5)
#define                                 EEADRL5_bit         _BIT_ACCESS(EEADRL,5)
// EEADRL<EEADRL6>
extern volatile __bit                   EEADRL6             __at(0x86E);	// @ (0x10D * 8 + 6)
#define                                 EEADRL6_bit         _BIT_ACCESS(EEADRL,6)
// EEADRL<EEADRL7>
extern volatile __bit                   EEADRL7             __at(0x86F);	// @ (0x10D * 8 + 7)
#define                                 EEADRL7_bit         _BIT_ACCESS(EEADRL,7)
// EEDATH<EEDATH0>
extern volatile __bit                   EEDATH0             __at(0x870);	// @ (0x10E * 8 + 0)
#define                                 EEDATH0_bit         _BIT_ACCESS(EEDATH,0)
// EEDATH<EEDATH1>
extern volatile __bit                   EEDATH1             __at(0x871);	// @ (0x10E * 8 + 1)
#define                                 EEDATH1_bit         _BIT_ACCESS(EEDATH,1)
// EEDATH<EEDATH2>
extern volatile __bit                   EEDATH2             __at(0x872);	// @ (0x10E * 8 + 2)
#define                                 EEDATH2_bit         _BIT_ACCESS(EEDATH,2)
// EEDATH<EEDATH3>
extern volatile __bit                   EEDATH3             __at(0x873);	// @ (0x10E * 8 + 3)
#define                                 EEDATH3_bit         _BIT_ACCESS(EEDATH,3)
// EEDATH<EEDATH4>
extern volatile __bit                   EEDATH4             __at(0x874);	// @ (0x10E * 8 + 4)
#define                                 EEDATH4_bit         _BIT_ACCESS(EEDATH,4)
// EEDATH<EEDATH5>
extern volatile __bit                   EEDATH5             __at(0x875);	// @ (0x10E * 8 + 5)
#define                                 EEDATH5_bit         _BIT_ACCESS(EEDATH,5)
// EEDATL<EEDATL0>
extern volatile __bit                   EEDATL0             __at(0x860);	// @ (0x10C * 8 + 0)
#define                                 EEDATL0_bit         _BIT_ACCESS(EEDATL,0)
// EEDATL<EEDATL1>
extern volatile __bit                   EEDATL1             __at(0x861);	// @ (0x10C * 8 + 1)
#define                                 EEDATL1_bit         _BIT_ACCESS(EEDATL,1)
// EEDATL<EEDATL2>
extern volatile __bit                   EEDATL2             __at(0x862);	// @ (0x10C * 8 + 2)
#define                                 EEDATL2_bit         _BIT_ACCESS(EEDATL,2)
// EEDATL<EEDATL3>
extern volatile __bit                   EEDATL3             __at(0x863);	// @ (0x10C * 8 + 3)
#define                                 EEDATL3_bit         _BIT_ACCESS(EEDATL,3)
// EEDATL<EEDATL4>
extern volatile __bit                   EEDATL4             __at(0x864);	// @ (0x10C * 8 + 4)
#define                                 EEDATL4_bit         _BIT_ACCESS(EEDATL,4)
// EEDATL<EEDATL5>
extern volatile __bit                   EEDATL5             __at(0x865);	// @ (0x10C * 8 + 5)
#define                                 EEDATL5_bit         _BIT_ACCESS(EEDATL,5)
// EEDATL<EEDATL6>
extern volatile __bit                   EEDATL6             __at(0x866);	// @ (0x10C * 8 + 6)
#define                                 EEDATL6_bit         _BIT_ACCESS(EEDATL,6)
// EEDATL<EEDATL7>
extern volatile __bit                   EEDATL7             __at(0x867);	// @ (0x10C * 8 + 7)
#define                                 EEDATL7_bit         _BIT_ACCESS(EEDATL,7)
// PIE1<EEIE>
extern volatile __bit                   EEIE                __at(0x467);	// @ (0x8C * 8 + 7)
#define                                 EEIE_bit            _BIT_ACCESS(PIE1,7)
// PIR1<EEIF>
extern volatile __bit                   EEIF                __at(0x67);	// @ (0xC * 8 + 7)
#define                                 EEIF_bit            _BIT_ACCESS(PIR1,7)
// EECON1<EEPGD>
extern volatile __bit                   EEPGD               __at(0xC67);	// @ (0x18C * 8 + 7)
#define                                 EEPGD_bit           _BIT_ACCESS(EECON1,7)
// EECON1<EERD>
extern volatile __bit                   EERD                __at(0xC60);	// @ (0x18C * 8 + 0)
#define                                 EERD_bit            _BIT_ACCESS(EECON1,0)
// EECON1<EEWR>
extern volatile __bit                   EEWR                __at(0xC61);	// @ (0x18C * 8 + 1)
#define                                 EEWR_bit            _BIT_ACCESS(EECON1,1)
// RCSTA<FERR>
extern volatile __bit                   FERR                __at(0xC2);	// @ (0x18 * 8 + 2)
#define                                 FERR_bit            _BIT_ACCESS(RCSTA,2)
// INTCON<GIE>
extern volatile __bit                   GIE                 __at(0x5F);	// @ (0xB * 8 + 7)
#define                                 GIE_bit             _BIT_ACCESS(INTCON,7)
// ADCON0<GO>
extern volatile __bit                   GO                  __at(0xF9);	// @ (0x1F * 8 + 1)
#define                                 GO_bit              _BIT_ACCESS(ADCON0,1)
// ADCON0<GO_DONE>
extern volatile __bit                   GO_DONE             __at(0xF9);	// @ (0x1F * 8 + 1)
#define                                 GO_DONE_bit         _BIT_ACCESS(ADCON0,1)
// ADCON0<GO_nDONE>
extern volatile __bit                   GO_nDONE            __at(0xF9);	// @ (0x1F * 8 + 1)
#define                                 GO_nDONE_bit        _BIT_ACCESS(ADCON0,1)
// OSCCON<HTS>
extern volatile __bit                   HTS                 __at(0x47A);	// @ (0x8F * 8 + 2)
#define                                 HTS_bit             _BIT_ACCESS(OSCCON,2)
// SSPSTAT<I2C_DATA>
extern volatile __bit                   I2C_DATA            __at(0x4A5);	// @ (0x94 * 8 + 5)
#define                                 I2C_DATA_bit        _BIT_ACCESS(SSPSTAT,5)
// SSPSTAT<I2C_READ>
extern volatile __bit                   I2C_READ            __at(0x4A2);	// @ (0x94 * 8 + 2)
#define                                 I2C_READ_bit        _BIT_ACCESS(SSPSTAT,2)
// SSPSTAT<I2C_START>
extern volatile __bit                   I2C_START           __at(0x4A3);	// @ (0x94 * 8 + 3)
#define                                 I2C_START_bit       _BIT_ACCESS(SSPSTAT,3)
// SSPSTAT<I2C_STOP>
extern volatile __bit                   I2C_STOP            __at(0x4A4);	// @ (0x94 * 8 + 4)
#define                                 I2C_STOP_bit        _BIT_ACCESS(SSPSTAT,4)
// INTCON<INTE>
extern volatile __bit                   INTE                __at(0x5C);	// @ (0xB * 8 + 4)
#define                                 INTE_bit            _BIT_ACCESS(INTCON,4)
// OPTION_REG<INTEDG>
extern volatile __bit                   INTEDG              __at(0x40E);	// @ (0x81 * 8 + 6)
#define                                 INTEDG_bit          _BIT_ACCESS(OPTION_REG,6)
// INTCON<INTF>
extern volatile __bit                   INTF                __at(0x59);	// @ (0xB * 8 + 1)
#define                                 INTF_bit            _BIT_ACCESS(INTCON,1)
// IOCB<IOC4>
extern volatile __bit                   IOC4                __at(0x4B4);	// @ (0x96 * 8 + 4)
#define                                 IOC4_bit            _BIT_ACCESS(IOCB,4)
// IOCB<IOC5>
extern volatile __bit                   IOC5                __at(0x4B5);	// @ (0x96 * 8 + 5)
#define                                 IOC5_bit            _BIT_ACCESS(IOCB,5)
// IOCB<IOC6>
extern volatile __bit                   IOC6                __at(0x4B6);	// @ (0x96 * 8 + 6)
#define                                 IOC6_bit            _BIT_ACCESS(IOCB,6)
// IOCB<IOC7>
extern volatile __bit                   IOC7                __at(0x4B7);	// @ (0x96 * 8 + 7)
#define                                 IOC7_bit            _BIT_ACCESS(IOCB,7)
// IOCB<IOCB4>
extern volatile __bit                   IOCB4               __at(0x4B4);	// @ (0x96 * 8 + 4)
#define                                 IOCB4_bit           _BIT_ACCESS(IOCB,4)
// IOCB<IOCB5>
extern volatile __bit                   IOCB5               __at(0x4B5);	// @ (0x96 * 8 + 5)
#define                                 IOCB5_bit           _BIT_ACCESS(IOCB,5)
// IOCB<IOCB6>
extern volatile __bit                   IOCB6               __at(0x4B6);	// @ (0x96 * 8 + 6)
#define                                 IOCB6_bit           _BIT_ACCESS(IOCB,6)
// IOCB<IOCB7>
extern volatile __bit                   IOCB7               __at(0x4B7);	// @ (0x96 * 8 + 7)
#define                                 IOCB7_bit           _BIT_ACCESS(IOCB,7)
// OSCCON<IRCF0>
extern volatile __bit                   IRCF0               __at(0x47C);	// @ (0x8F * 8 + 4)
#define                                 IRCF0_bit           _BIT_ACCESS(OSCCON,4)
