MikroElektronika/core_packages/PIC/XC8/def/PIC16F946/mcu.h
#define                                 S15C2_bit           _BIT_ACCESS(LCDDATA7,7)
// LCDDATA10<S15C3>
extern volatile __bit                   S15C3               __at(0x8D7);	// @ (0x11A * 8 + 7)
#define                                 S15C3_bit           _BIT_ACCESS(LCDDATA10,7)
// LCDDATA2<S16C0>
extern volatile __bit                   S16C0               __at(0x890);	// @ (0x112 * 8 + 0)
#define                                 S16C0_bit           _BIT_ACCESS(LCDDATA2,0)
// LCDDATA5<S16C1>
extern volatile __bit                   S16C1               __at(0x8A8);	// @ (0x115 * 8 + 0)
#define                                 S16C1_bit           _BIT_ACCESS(LCDDATA5,0)
// LCDDATA8<S16C2>
extern volatile __bit                   S16C2               __at(0x8C0);	// @ (0x118 * 8 + 0)
#define                                 S16C2_bit           _BIT_ACCESS(LCDDATA8,0)
// LCDDATA11<S16C3>
extern volatile __bit                   S16C3               __at(0x8D8);	// @ (0x11B * 8 + 0)
#define                                 S16C3_bit           _BIT_ACCESS(LCDDATA11,0)
// LCDDATA2<S17C0>
extern volatile __bit                   S17C0               __at(0x891);	// @ (0x112 * 8 + 1)
#define                                 S17C0_bit           _BIT_ACCESS(LCDDATA2,1)
// LCDDATA5<S17C1>
extern volatile __bit                   S17C1               __at(0x8A9);	// @ (0x115 * 8 + 1)
#define                                 S17C1_bit           _BIT_ACCESS(LCDDATA5,1)
// LCDDATA8<S17C2>
extern volatile __bit                   S17C2               __at(0x8C1);	// @ (0x118 * 8 + 1)
#define                                 S17C2_bit           _BIT_ACCESS(LCDDATA8,1)
// LCDDATA11<S17C3>
extern volatile __bit                   S17C3               __at(0x8D9);	// @ (0x11B * 8 + 1)
#define                                 S17C3_bit           _BIT_ACCESS(LCDDATA11,1)
// LCDDATA2<S18C0>
extern volatile __bit                   S18C0               __at(0x892);	// @ (0x112 * 8 + 2)
#define                                 S18C0_bit           _BIT_ACCESS(LCDDATA2,2)
// LCDDATA5<S18C1>
extern volatile __bit                   S18C1               __at(0x8AA);	// @ (0x115 * 8 + 2)
#define                                 S18C1_bit           _BIT_ACCESS(LCDDATA5,2)
// LCDDATA8<S18C2>
extern volatile __bit                   S18C2               __at(0x8C2);	// @ (0x118 * 8 + 2)
#define                                 S18C2_bit           _BIT_ACCESS(LCDDATA8,2)
// LCDDATA11<S18C3>
extern volatile __bit                   S18C3               __at(0x8DA);	// @ (0x11B * 8 + 2)
#define                                 S18C3_bit           _BIT_ACCESS(LCDDATA11,2)
// LCDDATA2<S19C0>
extern volatile __bit                   S19C0               __at(0x893);	// @ (0x112 * 8 + 3)
#define                                 S19C0_bit           _BIT_ACCESS(LCDDATA2,3)
// LCDDATA5<S19C1>
extern volatile __bit                   S19C1               __at(0x8AB);	// @ (0x115 * 8 + 3)
#define                                 S19C1_bit           _BIT_ACCESS(LCDDATA5,3)
// LCDDATA8<S19C2>
extern volatile __bit                   S19C2               __at(0x8C3);	// @ (0x118 * 8 + 3)
#define                                 S19C2_bit           _BIT_ACCESS(LCDDATA8,3)
// LCDDATA11<S19C3>
extern volatile __bit                   S19C3               __at(0x8DB);	// @ (0x11B * 8 + 3)
#define                                 S19C3_bit           _BIT_ACCESS(LCDDATA11,3)
// LCDDATA0<S1C0>
extern volatile __bit                   S1C0                __at(0x881);	// @ (0x110 * 8 + 1)
#define                                 S1C0_bit            _BIT_ACCESS(LCDDATA0,1)
// LCDDATA3<S1C1>
extern volatile __bit                   S1C1                __at(0x899);	// @ (0x113 * 8 + 1)
#define                                 S1C1_bit            _BIT_ACCESS(LCDDATA3,1)
// LCDDATA6<S1C2>
extern volatile __bit                   S1C2                __at(0x8B1);	// @ (0x116 * 8 + 1)
#define                                 S1C2_bit            _BIT_ACCESS(LCDDATA6,1)
// LCDDATA9<S1C3>
extern volatile __bit                   S1C3                __at(0x8C9);	// @ (0x119 * 8 + 1)
#define                                 S1C3_bit            _BIT_ACCESS(LCDDATA9,1)
// LCDDATA2<S20C0>
extern volatile __bit                   S20C0               __at(0x894);	// @ (0x112 * 8 + 4)
#define                                 S20C0_bit           _BIT_ACCESS(LCDDATA2,4)
// LCDDATA5<S20C1>
extern volatile __bit                   S20C1               __at(0x8AC);	// @ (0x115 * 8 + 4)
#define                                 S20C1_bit           _BIT_ACCESS(LCDDATA5,4)
// LCDDATA8<S20C2>
extern volatile __bit                   S20C2               __at(0x8C4);	// @ (0x118 * 8 + 4)
#define                                 S20C2_bit           _BIT_ACCESS(LCDDATA8,4)
// LCDDATA11<S20C3>
extern volatile __bit                   S20C3               __at(0x8DC);	// @ (0x11B * 8 + 4)
#define                                 S20C3_bit           _BIT_ACCESS(LCDDATA11,4)
// LCDDATA2<S21C0>
extern volatile __bit                   S21C0               __at(0x895);	// @ (0x112 * 8 + 5)
#define                                 S21C0_bit           _BIT_ACCESS(LCDDATA2,5)
// LCDDATA5<S21C1>
extern volatile __bit                   S21C1               __at(0x8AD);	// @ (0x115 * 8 + 5)
#define                                 S21C1_bit           _BIT_ACCESS(LCDDATA5,5)
// LCDDATA8<S21C2>
extern volatile __bit                   S21C2               __at(0x8C5);	// @ (0x118 * 8 + 5)
#define                                 S21C2_bit           _BIT_ACCESS(LCDDATA8,5)
// LCDDATA11<S21C3>
extern volatile __bit                   S21C3               __at(0x8DD);	// @ (0x11B * 8 + 5)
#define                                 S21C3_bit           _BIT_ACCESS(LCDDATA11,5)
// LCDDATA2<S22C0>
extern volatile __bit                   S22C0               __at(0x896);	// @ (0x112 * 8 + 6)
#define                                 S22C0_bit           _BIT_ACCESS(LCDDATA2,6)
// LCDDATA5<S22C1>
extern volatile __bit                   S22C1               __at(0x8AE);	// @ (0x115 * 8 + 6)
#define                                 S22C1_bit           _BIT_ACCESS(LCDDATA5,6)
// LCDDATA8<S22C2>
extern volatile __bit                   S22C2               __at(0x8C6);	// @ (0x118 * 8 + 6)
#define                                 S22C2_bit           _BIT_ACCESS(LCDDATA8,6)
// LCDDATA11<S22C3>
extern volatile __bit                   S22C3               __at(0x8DE);	// @ (0x11B * 8 + 6)
#define                                 S22C3_bit           _BIT_ACCESS(LCDDATA11,6)
// LCDDATA2<S23C0>
extern volatile __bit                   S23C0               __at(0x897);	// @ (0x112 * 8 + 7)
#define                                 S23C0_bit           _BIT_ACCESS(LCDDATA2,7)
// LCDDATA5<S23C1>
extern volatile __bit                   S23C1               __at(0x8AF);	// @ (0x115 * 8 + 7)
#define                                 S23C1_bit           _BIT_ACCESS(LCDDATA5,7)
// LCDDATA8<S23C2>
extern volatile __bit                   S23C2               __at(0x8C7);	// @ (0x118 * 8 + 7)
#define                                 S23C2_bit           _BIT_ACCESS(LCDDATA8,7)
// LCDDATA11<S23C3>
extern volatile __bit                   S23C3               __at(0x8DF);	// @ (0x11B * 8 + 7)
#define                                 S23C3_bit           _BIT_ACCESS(LCDDATA11,7)
// LCDDATA12<S24C0>
extern volatile __bit                   S24C0               __at(0xC80);	// @ (0x190 * 8 + 0)
#define                                 S24C0_bit           _BIT_ACCESS(LCDDATA12,0)
// LCDDATA15<S24C1>
extern volatile __bit                   S24C1               __at(0xC98);	// @ (0x193 * 8 + 0)
#define                                 S24C1_bit           _BIT_ACCESS(LCDDATA15,0)
// LCDDATA18<S24C2>
extern volatile __bit                   S24C2               __at(0xCB0);	// @ (0x196 * 8 + 0)
#define                                 S24C2_bit           _BIT_ACCESS(LCDDATA18,0)
// LCDDATA21<S24C3>
extern volatile __bit                   S24C3               __at(0xCC8);	// @ (0x199 * 8 + 0)
#define                                 S24C3_bit           _BIT_ACCESS(LCDDATA21,0)
// LCDDATA12<S25C0>
extern volatile __bit                   S25C0               __at(0xC81);	// @ (0x190 * 8 + 1)
#define                                 S25C0_bit           _BIT_ACCESS(LCDDATA12,1)
// LCDDATA15<S25C1>
extern volatile __bit                   S25C1               __at(0xC99);	// @ (0x193 * 8 + 1)
#define                                 S25C1_bit           _BIT_ACCESS(LCDDATA15,1)
// LCDDATA18<S25C2>
extern volatile __bit                   S25C2               __at(0xCB1);	// @ (0x196 * 8 + 1)
#define                                 S25C2_bit           _BIT_ACCESS(LCDDATA18,1)
// LCDDATA21<S25C3>
extern volatile __bit                   S25C3               __at(0xCC9);	// @ (0x199 * 8 + 1)
#define                                 S25C3_bit           _BIT_ACCESS(LCDDATA21,1)
// LCDDATA12<S26C0>
extern volatile __bit                   S26C0               __at(0xC82);	// @ (0x190 * 8 + 2)
#define                                 S26C0_bit           _BIT_ACCESS(LCDDATA12,2)
// LCDDATA15<S26C1>
extern volatile __bit                   S26C1               __at(0xC9A);	// @ (0x193 * 8 + 2)
#define                                 S26C1_bit           _BIT_ACCESS(LCDDATA15,2)
// LCDDATA18<S26C2>
extern volatile __bit                   S26C2               __at(0xCB2);	// @ (0x196 * 8 + 2)
#define                                 S26C2_bit           _BIT_ACCESS(LCDDATA18,2)
// LCDDATA21<S26C3>
extern volatile __bit                   S26C3               __at(0xCCA);	// @ (0x199 * 8 + 2)
#define                                 S26C3_bit           _BIT_ACCESS(LCDDATA21,2)
// LCDDATA12<S27C0>
extern volatile __bit                   S27C0               __at(0xC83);	// @ (0x190 * 8 + 3)
#define                                 S27C0_bit           _BIT_ACCESS(LCDDATA12,3)
// LCDDATA15<S27C1>
extern volatile __bit                   S27C1               __at(0xC9B);	// @ (0x193 * 8 + 3)
#define                                 S27C1_bit           _BIT_ACCESS(LCDDATA15,3)
// LCDDATA18<S27C2>
extern volatile __bit                   S27C2               __at(0xCB3);	// @ (0x196 * 8 + 3)
#define                                 S27C2_bit           _BIT_ACCESS(LCDDATA18,3)
// LCDDATA21<S27C3>
extern volatile __bit                   S27C3               __at(0xCCB);	// @ (0x199 * 8 + 3)
#define                                 S27C3_bit           _BIT_ACCESS(LCDDATA21,3)
// LCDDATA12<S28C0>
extern volatile __bit                   S28C0               __at(0xC84);	// @ (0x190 * 8 + 4)
#define                                 S28C0_bit           _BIT_ACCESS(LCDDATA12,4)
// LCDDATA15<S28C1>
extern volatile __bit                   S28C1               __at(0xC9C);	// @ (0x193 * 8 + 4)
#define                                 S28C1_bit           _BIT_ACCESS(LCDDATA15,4)
// LCDDATA18<S28C2>
extern volatile __bit                   S28C2               __at(0xCB4);	// @ (0x196 * 8 + 4)
#define                                 S28C2_bit           _BIT_ACCESS(LCDDATA18,4)
// LCDDATA21<S28C3>
extern volatile __bit                   S28C3               __at(0xCCC);	// @ (0x199 * 8 + 4)
#define                                 S28C3_bit           _BIT_ACCESS(LCDDATA21,4)
// LCDDATA12<S29C0>
extern volatile __bit                   S29C0               __at(0xC85);	// @ (0x190 * 8 + 5)
#define                                 S29C0_bit           _BIT_ACCESS(LCDDATA12,5)
// LCDDATA15<S29C1>
extern volatile __bit                   S29C1               __at(0xC9D);	// @ (0x193 * 8 + 5)
#define                                 S29C1_bit           _BIT_ACCESS(LCDDATA15,5)
// LCDDATA18<S29C2>
extern volatile __bit                   S29C2               __at(0xCB5);	// @ (0x196 * 8 + 5)
#define                                 S29C2_bit           _BIT_ACCESS(LCDDATA18,5)
// LCDDATA21<S29C3>
extern volatile __bit                   S29C3               __at(0xCCD);	// @ (0x199 * 8 + 5)
#define                                 S29C3_bit           _BIT_ACCESS(LCDDATA21,5)
// LCDDATA0<S2C0>
extern volatile __bit                   S2C0                __at(0x882);	// @ (0x110 * 8 + 2)
#define                                 S2C0_bit            _BIT_ACCESS(LCDDATA0,2)
// LCDDATA3<S2C1>
extern volatile __bit                   S2C1                __at(0x89A);	// @ (0x113 * 8 + 2)
#define                                 S2C1_bit            _BIT_ACCESS(LCDDATA3,2)
// LCDDATA6<S2C2>
extern volatile __bit                   S2C2                __at(0x8B2);	// @ (0x116 * 8 + 2)
#define                                 S2C2_bit            _BIT_ACCESS(LCDDATA6,2)
// LCDDATA9<S2C3>
extern volatile __bit                   S2C3                __at(0x8CA);	// @ (0x119 * 8 + 2)
#define                                 S2C3_bit            _BIT_ACCESS(LCDDATA9,2)
// LCDDATA12<S30C0>
extern volatile __bit                   S30C0               __at(0xC86);	// @ (0x190 * 8 + 6)
#define                                 S30C0_bit           _BIT_ACCESS(LCDDATA12,6)
// LCDDATA15<S30C1>
extern volatile __bit                   S30C1               __at(0xC9E);	// @ (0x193 * 8 + 6)
#define                                 S30C1_bit           _BIT_ACCESS(LCDDATA15,6)
// LCDDATA18<S30C2>
extern volatile __bit                   S30C2               __at(0xCB6);	// @ (0x196 * 8 + 6)
#define                                 S30C2_bit           _BIT_ACCESS(LCDDATA18,6)
// LCDDATA21<S30C3>
extern volatile __bit                   S30C3               __at(0xCCE);	// @ (0x199 * 8 + 6)
#define                                 S30C3_bit           _BIT_ACCESS(LCDDATA21,6)
// LCDDATA12<S31C0>
extern volatile __bit                   S31C0               __at(0xC87);	// @ (0x190 * 8 + 7)
#define                                 S31C0_bit           _BIT_ACCESS(LCDDATA12,7)
// LCDDATA15<S31C1>
extern volatile __bit                   S31C1               __at(0xC9F);	// @ (0x193 * 8 + 7)
#define                                 S31C1_bit           _BIT_ACCESS(LCDDATA15,7)
// LCDDATA18<S31C2>
extern volatile __bit                   S31C2               __at(0xCB7);	// @ (0x196 * 8 + 7)
#define                                 S31C2_bit           _BIT_ACCESS(LCDDATA18,7)
// LCDDATA21<S31C3>
extern volatile __bit                   S31C3               __at(0xCCF);	// @ (0x199 * 8 + 7)
#define                                 S31C3_bit           _BIT_ACCESS(LCDDATA21,7)
// LCDDATA13<S32C0>
extern volatile __bit                   S32C0               __at(0xC88);	// @ (0x191 * 8 + 0)
#define                                 S32C0_bit           _BIT_ACCESS(LCDDATA13,0)
// LCDDATA16<S32C1>
extern volatile __bit                   S32C1               __at(0xCA0);	// @ (0x194 * 8 + 0)
#define                                 S32C1_bit           _BIT_ACCESS(LCDDATA16,0)
// LCDDATA19<S32C2>
extern volatile __bit                   S32C2               __at(0xCB8);	// @ (0x197 * 8 + 0)
#define                                 S32C2_bit           _BIT_ACCESS(LCDDATA19,0)
// LCDDATA22<S32C3>
extern volatile __bit                   S32C3               __at(0xCD0);	// @ (0x19A * 8 + 0)
#define                                 S32C3_bit           _BIT_ACCESS(LCDDATA22,0)
// LCDDATA13<S33C0>
extern volatile __bit                   S33C0               __at(0xC89);	// @ (0x191 * 8 + 1)
#define                                 S33C0_bit           _BIT_ACCESS(LCDDATA13,1)
// LCDDATA16<S33C1>
extern volatile __bit                   S33C1               __at(0xCA1);	// @ (0x194 * 8 + 1)
#define                                 S33C1_bit           _BIT_ACCESS(LCDDATA16,1)
// LCDDATA19<S33C2>
extern volatile __bit                   S33C2               __at(0xCB9);	// @ (0x197 * 8 + 1)
#define                                 S33C2_bit           _BIT_ACCESS(LCDDATA19,1)
// LCDDATA22<S33C3>
extern volatile __bit                   S33C3               __at(0xCD1);	// @ (0x19A * 8 + 1)
#define                                 S33C3_bit           _BIT_ACCESS(LCDDATA22,1)
// LCDDATA13<S34C0>
extern volatile __bit                   S34C0               __at(0xC8A);	// @ (0x191 * 8 + 2)
#define                                 S34C0_bit           _BIT_ACCESS(LCDDATA13,2)
// LCDDATA16<S34C1>
extern volatile __bit                   S34C1               __at(0xCA2);	// @ (0x194 * 8 + 2)
#define                                 S34C1_bit           _BIT_ACCESS(LCDDATA16,2)
// LCDDATA19<S34C2>
extern volatile __bit                   S34C2               __at(0xCBA);	// @ (0x197 * 8 + 2)
#define                                 S34C2_bit           _BIT_ACCESS(LCDDATA19,2)
// LCDDATA22<S34C3>
extern volatile __bit                   S34C3               __at(0xCD2);	// @ (0x19A * 8 + 2)
#define                                 S34C3_bit           _BIT_ACCESS(LCDDATA22,2)
// LCDDATA13<S35C0>
extern volatile __bit                   S35C0               __at(0xC8B);	// @ (0x191 * 8 + 3)
#define                                 S35C0_bit           _BIT_ACCESS(LCDDATA13,3)
// LCDDATA16<S35C1>
extern volatile __bit                   S35C1               __at(0xCA3);	// @ (0x194 * 8 + 3)
#define                                 S35C1_bit           _BIT_ACCESS(LCDDATA16,3)
// LCDDATA19<S35C2>
extern volatile __bit                   S35C2               __at(0xCBB);	// @ (0x197 * 8 + 3)
#define                                 S35C2_bit           _BIT_ACCESS(LCDDATA19,3)
// LCDDATA22<S35C3>
extern volatile __bit                   S35C3               __at(0xCD3);	// @ (0x19A * 8 + 3)
#define                                 S35C3_bit           _BIT_ACCESS(LCDDATA22,3)
// LCDDATA13<S36C0>
extern volatile __bit                   S36C0               __at(0xC8C);	// @ (0x191 * 8 + 4)
#define                                 S36C0_bit           _BIT_ACCESS(LCDDATA13,4)
// LCDDATA16<S36C1>
extern volatile __bit                   S36C1               __at(0xCA4);	// @ (0x194 * 8 + 4)
#define                                 S36C1_bit           _BIT_ACCESS(LCDDATA16,4)
// LCDDATA19<S36C2>
extern volatile __bit                   S36C2               __at(0xCBC);	// @ (0x197 * 8 + 4)
#define                                 S36C2_bit           _BIT_ACCESS(LCDDATA19,4)
// LCDDATA22<S36C3>
extern volatile __bit                   S36C3               __at(0xCD4);	// @ (0x19A * 8 + 4)
#define                                 S36C3_bit           _BIT_ACCESS(LCDDATA22,4)
// LCDDATA13<S37C0>
extern volatile __bit                   S37C0               __at(0xC8D);	// @ (0x191 * 8 + 5)
#define                                 S37C0_bit           _BIT_ACCESS(LCDDATA13,5)
// LCDDATA16<S37C1>
extern volatile __bit                   S37C1               __at(0xCA5);	// @ (0x194 * 8 + 5)
#define                                 S37C1_bit           _BIT_ACCESS(LCDDATA16,5)
// LCDDATA19<S37C2>
extern volatile __bit                   S37C2               __at(0xCBD);	// @ (0x197 * 8 + 5)
#define                                 S37C2_bit           _BIT_ACCESS(LCDDATA19,5)
// LCDDATA22<S37C3>
extern volatile __bit                   S37C3               __at(0xCD5);	// @ (0x19A * 8 + 5)
#define                                 S37C3_bit           _BIT_ACCESS(LCDDATA22,5)
// LCDDATA13<S38C0>
extern volatile __bit                   S38C0               __at(0xC8E);	// @ (0x191 * 8 + 6)
#define                                 S38C0_bit           _BIT_ACCESS(LCDDATA13,6)
// LCDDATA16<S38C1>
extern volatile __bit                   S38C1               __at(0xCA6);	// @ (0x194 * 8 + 6)
#define                                 S38C1_bit           _BIT_ACCESS(LCDDATA16,6)
// LCDDATA19<S38C2>
extern volatile __bit                   S38C2               __at(0xCBE);	// @ (0x197 * 8 + 6)
#define                                 S38C2_bit           _BIT_ACCESS(LCDDATA19,6)
// LCDDATA22<S38C3>
extern volatile __bit                   S38C3               __at(0xCD6);	// @ (0x19A * 8 + 6)
#define                                 S38C3_bit           _BIT_ACCESS(LCDDATA22,6)
// LCDDATA13<S39C0>
extern volatile __bit                   S39C0               __at(0xC8F);	// @ (0x191 * 8 + 7)
#define                                 S39C0_bit           _BIT_ACCESS(LCDDATA13,7)
// LCDDATA16<S39C1>
extern volatile __bit                   S39C1               __at(0xCA7);	// @ (0x194 * 8 + 7)
#define                                 S39C1_bit           _BIT_ACCESS(LCDDATA16,7)
// LCDDATA19<S39C2>
extern volatile __bit                   S39C2               __at(0xCBF);	// @ (0x197 * 8 + 7)
#define                                 S39C2_bit           _BIT_ACCESS(LCDDATA19,7)
// LCDDATA22<S39C3>
extern volatile __bit                   S39C3               __at(0xCD7);	// @ (0x19A * 8 + 7)
#define                                 S39C3_bit           _BIT_ACCESS(LCDDATA22,7)
// LCDDATA0<S3C0>
extern volatile __bit                   S3C0                __at(0x883);	// @ (0x110 * 8 + 3)
#define                                 S3C0_bit            _BIT_ACCESS(LCDDATA0,3)
// LCDDATA3<S3C1>
extern volatile __bit                   S3C1                __at(0x89B);	// @ (0x113 * 8 + 3)
#define                                 S3C1_bit            _BIT_ACCESS(LCDDATA3,3)
// LCDDATA6<S3C2>
extern volatile __bit                   S3C2                __at(0x8B3);	// @ (0x116 * 8 + 3)
#define                                 S3C2_bit            _BIT_ACCESS(LCDDATA6,3)
// LCDDATA9<S3C3>
extern volatile __bit                   S3C3                __at(0x8CB);	// @ (0x119 * 8 + 3)
#define                                 S3C3_bit            _BIT_ACCESS(LCDDATA9,3)
// LCDDATA14<S40C0>
extern volatile __bit                   S40C0               __at(0xC90);	// @ (0x192 * 8 + 0)
#define                                 S40C0_bit           _BIT_ACCESS(LCDDATA14,0)
// LCDDATA17<S40C1>
extern volatile __bit                   S40C1               __at(0xCA8);	// @ (0x195 * 8 + 0)
#define                                 S40C1_bit           _BIT_ACCESS(LCDDATA17,0)
// LCDDATA20<S40C2>
extern volatile __bit                   S40C2               __at(0xCC0);	// @ (0x198 * 8 + 0)
#define                                 S40C2_bit           _BIT_ACCESS(LCDDATA20,0)
// LCDDATA23<S40C3>
extern volatile __bit                   S40C3               __at(0xCD8);	// @ (0x19B * 8 + 0)
#define                                 S40C3_bit           _BIT_ACCESS(LCDDATA23,0)
// LCDDATA14<S41C0>
extern volatile __bit                   S41C0               __at(0xC91);	// @ (0x192 * 8 + 1)
#define                                 S41C0_bit           _BIT_ACCESS(LCDDATA14,1)
// LCDDATA17<S41C1>
extern volatile __bit                   S41C1               __at(0xCA9);	// @ (0x195 * 8 + 1)
#define                                 S41C1_bit           _BIT_ACCESS(LCDDATA17,1)
// LCDDATA20<S41C2>
extern volatile __bit                   S41C2               __at(0xCC1);	// @ (0x198 * 8 + 1)
#define                                 S41C2_bit           _BIT_ACCESS(LCDDATA20,1)
// LCDDATA23<S41C3>
extern volatile __bit                   S41C3               __at(0xCD9);	// @ (0x19B * 8 + 1)
#define                                 S41C3_bit           _BIT_ACCESS(LCDDATA23,1)
// LCDDATA0<S4C0>
extern volatile __bit                   S4C0                __at(0x884);	// @ (0x110 * 8 + 4)
#define                                 S4C0_bit            _BIT_ACCESS(LCDDATA0,4)
// LCDDATA3<S4C1>
extern volatile __bit                   S4C1                __at(0x89C);	// @ (0x113 * 8 + 4)
#define                                 S4C1_bit            _BIT_ACCESS(LCDDATA3,4)
// LCDDATA6<S4C2>
extern volatile __bit                   S4C2                __at(0x8B4);	// @ (0x116 * 8 + 4)
#define                                 S4C2_bit            _BIT_ACCESS(LCDDATA6,4)
// LCDDATA9<S4C3>
extern volatile __bit                   S4C3                __at(0x8CC);	// @ (0x119 * 8 + 4)
