MikroElektronika/core_packages/PIC/XC8/def/PIC16F946/mcu.h
#define                                 S4C3_bit            _BIT_ACCESS(LCDDATA9,4)
// LCDDATA0<S5C0>
extern volatile __bit                   S5C0                __at(0x885);	// @ (0x110 * 8 + 5)
#define                                 S5C0_bit            _BIT_ACCESS(LCDDATA0,5)
// LCDDATA3<S5C1>
extern volatile __bit                   S5C1                __at(0x89D);	// @ (0x113 * 8 + 5)
#define                                 S5C1_bit            _BIT_ACCESS(LCDDATA3,5)
// LCDDATA6<S5C2>
extern volatile __bit                   S5C2                __at(0x8B5);	// @ (0x116 * 8 + 5)
#define                                 S5C2_bit            _BIT_ACCESS(LCDDATA6,5)
// LCDDATA9<S5C3>
extern volatile __bit                   S5C3                __at(0x8CD);	// @ (0x119 * 8 + 5)
#define                                 S5C3_bit            _BIT_ACCESS(LCDDATA9,5)
// LCDDATA0<S6C0>
extern volatile __bit                   S6C0                __at(0x886);	// @ (0x110 * 8 + 6)
#define                                 S6C0_bit            _BIT_ACCESS(LCDDATA0,6)
// LCDDATA3<S6C1>
extern volatile __bit                   S6C1                __at(0x89E);	// @ (0x113 * 8 + 6)
#define                                 S6C1_bit            _BIT_ACCESS(LCDDATA3,6)
// LCDDATA6<S6C2>
extern volatile __bit                   S6C2                __at(0x8B6);	// @ (0x116 * 8 + 6)
#define                                 S6C2_bit            _BIT_ACCESS(LCDDATA6,6)
// LCDDATA9<S6C3>
extern volatile __bit                   S6C3                __at(0x8CE);	// @ (0x119 * 8 + 6)
#define                                 S6C3_bit            _BIT_ACCESS(LCDDATA9,6)
// LCDDATA0<S7C0>
extern volatile __bit                   S7C0                __at(0x887);	// @ (0x110 * 8 + 7)
#define                                 S7C0_bit            _BIT_ACCESS(LCDDATA0,7)
// LCDDATA3<S7C1>
extern volatile __bit                   S7C1                __at(0x89F);	// @ (0x113 * 8 + 7)
#define                                 S7C1_bit            _BIT_ACCESS(LCDDATA3,7)
// LCDDATA6<S7C2>
extern volatile __bit                   S7C2                __at(0x8B7);	// @ (0x116 * 8 + 7)
#define                                 S7C2_bit            _BIT_ACCESS(LCDDATA6,7)
// LCDDATA9<S7C3>
extern volatile __bit                   S7C3                __at(0x8CF);	// @ (0x119 * 8 + 7)
#define                                 S7C3_bit            _BIT_ACCESS(LCDDATA9,7)
// LCDDATA1<S8C0>
extern volatile __bit                   S8C0                __at(0x888);	// @ (0x111 * 8 + 0)
#define                                 S8C0_bit            _BIT_ACCESS(LCDDATA1,0)
// LCDDATA4<S8C1>
extern volatile __bit                   S8C1                __at(0x8A0);	// @ (0x114 * 8 + 0)
#define                                 S8C1_bit            _BIT_ACCESS(LCDDATA4,0)
// LCDDATA7<S8C2>
extern volatile __bit                   S8C2                __at(0x8B8);	// @ (0x117 * 8 + 0)
#define                                 S8C2_bit            _BIT_ACCESS(LCDDATA7,0)
// LCDDATA10<S8C3>
extern volatile __bit                   S8C3                __at(0x8D0);	// @ (0x11A * 8 + 0)
#define                                 S8C3_bit            _BIT_ACCESS(LCDDATA10,0)
// LCDDATA1<S9C0>
extern volatile __bit                   S9C0                __at(0x889);	// @ (0x111 * 8 + 1)
#define                                 S9C0_bit            _BIT_ACCESS(LCDDATA1,1)
// LCDDATA4<S9C1>
extern volatile __bit                   S9C1                __at(0x8A1);	// @ (0x114 * 8 + 1)
#define                                 S9C1_bit            _BIT_ACCESS(LCDDATA4,1)
// LCDDATA7<S9C2>
extern volatile __bit                   S9C2                __at(0x8B9);	// @ (0x117 * 8 + 1)
#define                                 S9C2_bit            _BIT_ACCESS(LCDDATA7,1)
// LCDDATA10<S9C3>
extern volatile __bit                   S9C3                __at(0x8D1);	// @ (0x11A * 8 + 1)
#define                                 S9C3_bit            _BIT_ACCESS(LCDDATA10,1)
// PCON<SBOREN>
extern volatile __bit                   SBOREN              __at(0x474);	// @ (0x8E * 8 + 4)
#define                                 SBOREN_bit          _BIT_ACCESS(PCON,4)
// OSCCON<SCS>
extern volatile __bit                   SCS                 __at(0x478);	// @ (0x8F * 8 + 0)
#define                                 SCS_bit             _BIT_ACCESS(OSCCON,0)
// LCDSE0<SE0>
extern volatile __bit                   SE0                 __at(0x8E0);	// @ (0x11C * 8 + 0)
#define                                 SE0_bit             _BIT_ACCESS(LCDSE0,0)
// LCDSE0<SE1>
extern volatile __bit                   SE1                 __at(0x8E1);	// @ (0x11C * 8 + 1)
#define                                 SE1_bit             _BIT_ACCESS(LCDSE0,1)
// LCDSE1<SE10>
extern volatile __bit                   SE10                __at(0x8EA);	// @ (0x11D * 8 + 2)
#define                                 SE10_bit            _BIT_ACCESS(LCDSE1,2)
// LCDSE1<SE11>
extern volatile __bit                   SE11                __at(0x8EB);	// @ (0x11D * 8 + 3)
#define                                 SE11_bit            _BIT_ACCESS(LCDSE1,3)
// LCDSE1<SE12>
extern volatile __bit                   SE12                __at(0x8EC);	// @ (0x11D * 8 + 4)
#define                                 SE12_bit            _BIT_ACCESS(LCDSE1,4)
// LCDSE1<SE13>
extern volatile __bit                   SE13                __at(0x8ED);	// @ (0x11D * 8 + 5)
#define                                 SE13_bit            _BIT_ACCESS(LCDSE1,5)
// LCDSE1<SE14>
extern volatile __bit                   SE14                __at(0x8EE);	// @ (0x11D * 8 + 6)
#define                                 SE14_bit            _BIT_ACCESS(LCDSE1,6)
// LCDSE1<SE15>
extern volatile __bit                   SE15                __at(0x8EF);	// @ (0x11D * 8 + 7)
#define                                 SE15_bit            _BIT_ACCESS(LCDSE1,7)
// LCDSE2<SE16>
extern volatile __bit                   SE16                __at(0x8F0);	// @ (0x11E * 8 + 0)
#define                                 SE16_bit            _BIT_ACCESS(LCDSE2,0)
// LCDSE2<SE17>
extern volatile __bit                   SE17                __at(0x8F1);	// @ (0x11E * 8 + 1)
#define                                 SE17_bit            _BIT_ACCESS(LCDSE2,1)
// LCDSE2<SE18>
extern volatile __bit                   SE18                __at(0x8F2);	// @ (0x11E * 8 + 2)
#define                                 SE18_bit            _BIT_ACCESS(LCDSE2,2)
// LCDSE2<SE19>
extern volatile __bit                   SE19                __at(0x8F3);	// @ (0x11E * 8 + 3)
#define                                 SE19_bit            _BIT_ACCESS(LCDSE2,3)
// LCDSE0<SE2>
extern volatile __bit                   SE2                 __at(0x8E2);	// @ (0x11C * 8 + 2)
#define                                 SE2_bit             _BIT_ACCESS(LCDSE0,2)
// LCDSE2<SE20>
extern volatile __bit                   SE20                __at(0x8F4);	// @ (0x11E * 8 + 4)
#define                                 SE20_bit            _BIT_ACCESS(LCDSE2,4)
// LCDSE2<SE21>
extern volatile __bit                   SE21                __at(0x8F5);	// @ (0x11E * 8 + 5)
#define                                 SE21_bit            _BIT_ACCESS(LCDSE2,5)
// LCDSE2<SE22>
extern volatile __bit                   SE22                __at(0x8F6);	// @ (0x11E * 8 + 6)
#define                                 SE22_bit            _BIT_ACCESS(LCDSE2,6)
// LCDSE2<SE23>
extern volatile __bit                   SE23                __at(0x8F7);	// @ (0x11E * 8 + 7)
#define                                 SE23_bit            _BIT_ACCESS(LCDSE2,7)
// LCDSE3<SE24>
extern volatile __bit                   SE24                __at(0xCE0);	// @ (0x19C * 8 + 0)
#define                                 SE24_bit            _BIT_ACCESS(LCDSE3,0)
// LCDSE3<SE25>
extern volatile __bit                   SE25                __at(0xCE1);	// @ (0x19C * 8 + 1)
#define                                 SE25_bit            _BIT_ACCESS(LCDSE3,1)
// LCDSE3<SE26>
extern volatile __bit                   SE26                __at(0xCE2);	// @ (0x19C * 8 + 2)
#define                                 SE26_bit            _BIT_ACCESS(LCDSE3,2)
// LCDSE3<SE27>
extern volatile __bit                   SE27                __at(0xCE3);	// @ (0x19C * 8 + 3)
#define                                 SE27_bit            _BIT_ACCESS(LCDSE3,3)
// LCDSE3<SE28>
extern volatile __bit                   SE28                __at(0xCE4);	// @ (0x19C * 8 + 4)
#define                                 SE28_bit            _BIT_ACCESS(LCDSE3,4)
// LCDSE3<SE29>
extern volatile __bit                   SE29                __at(0xCE5);	// @ (0x19C * 8 + 5)
#define                                 SE29_bit            _BIT_ACCESS(LCDSE3,5)
// LCDSE0<SE3>
extern volatile __bit                   SE3                 __at(0x8E3);	// @ (0x11C * 8 + 3)
#define                                 SE3_bit             _BIT_ACCESS(LCDSE0,3)
// LCDSE3<SE30>
extern volatile __bit                   SE30                __at(0xCE6);	// @ (0x19C * 8 + 6)
#define                                 SE30_bit            _BIT_ACCESS(LCDSE3,6)
// LCDSE3<SE31>
extern volatile __bit                   SE31                __at(0xCE7);	// @ (0x19C * 8 + 7)
#define                                 SE31_bit            _BIT_ACCESS(LCDSE3,7)
// LCDSE4<SE32>
extern volatile __bit                   SE32                __at(0xCE8);	// @ (0x19D * 8 + 0)
#define                                 SE32_bit            _BIT_ACCESS(LCDSE4,0)
// LCDSE4<SE33>
extern volatile __bit                   SE33                __at(0xCE9);	// @ (0x19D * 8 + 1)
#define                                 SE33_bit            _BIT_ACCESS(LCDSE4,1)
// LCDSE4<SE34>
extern volatile __bit                   SE34                __at(0xCEA);	// @ (0x19D * 8 + 2)
#define                                 SE34_bit            _BIT_ACCESS(LCDSE4,2)
// LCDSE4<SE35>
extern volatile __bit                   SE35                __at(0xCEB);	// @ (0x19D * 8 + 3)
#define                                 SE35_bit            _BIT_ACCESS(LCDSE4,3)
// LCDSE4<SE36>
extern volatile __bit                   SE36                __at(0xCEC);	// @ (0x19D * 8 + 4)
#define                                 SE36_bit            _BIT_ACCESS(LCDSE4,4)
// LCDSE4<SE37>
extern volatile __bit                   SE37                __at(0xCED);	// @ (0x19D * 8 + 5)
#define                                 SE37_bit            _BIT_ACCESS(LCDSE4,5)
// LCDSE4<SE38>
extern volatile __bit                   SE38                __at(0xCEE);	// @ (0x19D * 8 + 6)
#define                                 SE38_bit            _BIT_ACCESS(LCDSE4,6)
// LCDSE4<SE39>
extern volatile __bit                   SE39                __at(0xCEF);	// @ (0x19D * 8 + 7)
#define                                 SE39_bit            _BIT_ACCESS(LCDSE4,7)
// LCDSE0<SE4>
extern volatile __bit                   SE4                 __at(0x8E4);	// @ (0x11C * 8 + 4)
#define                                 SE4_bit             _BIT_ACCESS(LCDSE0,4)
// LCDSE5<SE40>
extern volatile __bit                   SE40                __at(0xCF0);	// @ (0x19E * 8 + 0)
#define                                 SE40_bit            _BIT_ACCESS(LCDSE5,0)
// LCDSE5<SE41>
extern volatile __bit                   SE41                __at(0xCF1);	// @ (0x19E * 8 + 1)
#define                                 SE41_bit            _BIT_ACCESS(LCDSE5,1)
// LCDSE0<SE5>
extern volatile __bit                   SE5                 __at(0x8E5);	// @ (0x11C * 8 + 5)
#define                                 SE5_bit             _BIT_ACCESS(LCDSE0,5)
// LCDSE0<SE6>
extern volatile __bit                   SE6                 __at(0x8E6);	// @ (0x11C * 8 + 6)
#define                                 SE6_bit             _BIT_ACCESS(LCDSE0,6)
// LCDSE0<SE7>
extern volatile __bit                   SE7                 __at(0x8E7);	// @ (0x11C * 8 + 7)
#define                                 SE7_bit             _BIT_ACCESS(LCDSE0,7)
// LCDSE1<SE8>
extern volatile __bit                   SE8                 __at(0x8E8);	// @ (0x11D * 8 + 0)
#define                                 SE8_bit             _BIT_ACCESS(LCDSE1,0)
// LCDSE1<SE9>
extern volatile __bit                   SE9                 __at(0x8E9);	// @ (0x11D * 8 + 1)
#define                                 SE9_bit             _BIT_ACCESS(LCDSE1,1)
// LCDDATA0<SEG0COM0>
extern volatile __bit                   SEG0COM0            __at(0x880);	// @ (0x110 * 8 + 0)
#define                                 SEG0COM0_bit        _BIT_ACCESS(LCDDATA0,0)
// LCDDATA3<SEG0COM1>
extern volatile __bit                   SEG0COM1            __at(0x898);	// @ (0x113 * 8 + 0)
#define                                 SEG0COM1_bit        _BIT_ACCESS(LCDDATA3,0)
// LCDDATA6<SEG0COM2>
extern volatile __bit                   SEG0COM2            __at(0x8B0);	// @ (0x116 * 8 + 0)
#define                                 SEG0COM2_bit        _BIT_ACCESS(LCDDATA6,0)
// LCDDATA9<SEG0COM3>
extern volatile __bit                   SEG0COM3            __at(0x8C8);	// @ (0x119 * 8 + 0)
#define                                 SEG0COM3_bit        _BIT_ACCESS(LCDDATA9,0)
// LCDDATA1<SEG10COM0>
extern volatile __bit                   SEG10COM0           __at(0x88A);	// @ (0x111 * 8 + 2)
#define                                 SEG10COM0_bit       _BIT_ACCESS(LCDDATA1,2)
// LCDDATA4<SEG10COM1>
extern volatile __bit                   SEG10COM1           __at(0x8A2);	// @ (0x114 * 8 + 2)
#define                                 SEG10COM1_bit       _BIT_ACCESS(LCDDATA4,2)
// LCDDATA7<SEG10COM2>
extern volatile __bit                   SEG10COM2           __at(0x8BA);	// @ (0x117 * 8 + 2)
#define                                 SEG10COM2_bit       _BIT_ACCESS(LCDDATA7,2)
// LCDDATA10<SEG10COM3>
extern volatile __bit                   SEG10COM3           __at(0x8D2);	// @ (0x11A * 8 + 2)
#define                                 SEG10COM3_bit       _BIT_ACCESS(LCDDATA10,2)
// LCDDATA1<SEG11COM0>
extern volatile __bit                   SEG11COM0           __at(0x88B);	// @ (0x111 * 8 + 3)
#define                                 SEG11COM0_bit       _BIT_ACCESS(LCDDATA1,3)
// LCDDATA4<SEG11COM1>
extern volatile __bit                   SEG11COM1           __at(0x8A3);	// @ (0x114 * 8 + 3)
#define                                 SEG11COM1_bit       _BIT_ACCESS(LCDDATA4,3)
// LCDDATA7<SEG11COM2>
extern volatile __bit                   SEG11COM2           __at(0x8BB);	// @ (0x117 * 8 + 3)
#define                                 SEG11COM2_bit       _BIT_ACCESS(LCDDATA7,3)
// LCDDATA10<SEG11COM3>
extern volatile __bit                   SEG11COM3           __at(0x8D3);	// @ (0x11A * 8 + 3)
#define                                 SEG11COM3_bit       _BIT_ACCESS(LCDDATA10,3)
// LCDDATA1<SEG12COM0>
extern volatile __bit                   SEG12COM0           __at(0x88C);	// @ (0x111 * 8 + 4)
#define                                 SEG12COM0_bit       _BIT_ACCESS(LCDDATA1,4)
// LCDDATA4<SEG12COM1>
extern volatile __bit                   SEG12COM1           __at(0x8A4);	// @ (0x114 * 8 + 4)
#define                                 SEG12COM1_bit       _BIT_ACCESS(LCDDATA4,4)
// LCDDATA7<SEG12COM2>
extern volatile __bit                   SEG12COM2           __at(0x8BC);	// @ (0x117 * 8 + 4)
#define                                 SEG12COM2_bit       _BIT_ACCESS(LCDDATA7,4)
// LCDDATA10<SEG12COM3>
extern volatile __bit                   SEG12COM3           __at(0x8D4);	// @ (0x11A * 8 + 4)
#define                                 SEG12COM3_bit       _BIT_ACCESS(LCDDATA10,4)
// LCDDATA1<SEG13COM0>
extern volatile __bit                   SEG13COM0           __at(0x88D);	// @ (0x111 * 8 + 5)
#define                                 SEG13COM0_bit       _BIT_ACCESS(LCDDATA1,5)
// LCDDATA4<SEG13COM1>
extern volatile __bit                   SEG13COM1           __at(0x8A5);	// @ (0x114 * 8 + 5)
#define                                 SEG13COM1_bit       _BIT_ACCESS(LCDDATA4,5)
// LCDDATA7<SEG13COM2>
extern volatile __bit                   SEG13COM2           __at(0x8BD);	// @ (0x117 * 8 + 5)
#define                                 SEG13COM2_bit       _BIT_ACCESS(LCDDATA7,5)
// LCDDATA10<SEG13COM3>
extern volatile __bit                   SEG13COM3           __at(0x8D5);	// @ (0x11A * 8 + 5)
#define                                 SEG13COM3_bit       _BIT_ACCESS(LCDDATA10,5)
// LCDDATA1<SEG14COM0>
extern volatile __bit                   SEG14COM0           __at(0x88E);	// @ (0x111 * 8 + 6)
#define                                 SEG14COM0_bit       _BIT_ACCESS(LCDDATA1,6)
// LCDDATA4<SEG14COM1>
extern volatile __bit                   SEG14COM1           __at(0x8A6);	// @ (0x114 * 8 + 6)
#define                                 SEG14COM1_bit       _BIT_ACCESS(LCDDATA4,6)
// LCDDATA7<SEG14COM2>
extern volatile __bit                   SEG14COM2           __at(0x8BE);	// @ (0x117 * 8 + 6)
#define                                 SEG14COM2_bit       _BIT_ACCESS(LCDDATA7,6)
// LCDDATA10<SEG14COM3>
extern volatile __bit                   SEG14COM3           __at(0x8D6);	// @ (0x11A * 8 + 6)
#define                                 SEG14COM3_bit       _BIT_ACCESS(LCDDATA10,6)
// LCDDATA1<SEG15COM0>
extern volatile __bit                   SEG15COM0           __at(0x88F);	// @ (0x111 * 8 + 7)
#define                                 SEG15COM0_bit       _BIT_ACCESS(LCDDATA1,7)
// LCDDATA4<SEG15COM1>
extern volatile __bit                   SEG15COM1           __at(0x8A7);	// @ (0x114 * 8 + 7)
#define                                 SEG15COM1_bit       _BIT_ACCESS(LCDDATA4,7)
// LCDDATA7<SEG15COM2>
extern volatile __bit                   SEG15COM2           __at(0x8BF);	// @ (0x117 * 8 + 7)
#define                                 SEG15COM2_bit       _BIT_ACCESS(LCDDATA7,7)
// LCDDATA10<SEG15COM3>
extern volatile __bit                   SEG15COM3           __at(0x8D7);	// @ (0x11A * 8 + 7)
#define                                 SEG15COM3_bit       _BIT_ACCESS(LCDDATA10,7)
// LCDDATA2<SEG16COM0>
extern volatile __bit                   SEG16COM0           __at(0x890);	// @ (0x112 * 8 + 0)
#define                                 SEG16COM0_bit       _BIT_ACCESS(LCDDATA2,0)
// LCDDATA5<SEG16COM1>
extern volatile __bit                   SEG16COM1           __at(0x8A8);	// @ (0x115 * 8 + 0)
#define                                 SEG16COM1_bit       _BIT_ACCESS(LCDDATA5,0)
// LCDDATA8<SEG16COM2>
extern volatile __bit                   SEG16COM2           __at(0x8C0);	// @ (0x118 * 8 + 0)
#define                                 SEG16COM2_bit       _BIT_ACCESS(LCDDATA8,0)
// LCDDATA11<SEG16COM3>
extern volatile __bit                   SEG16COM3           __at(0x8D8);	// @ (0x11B * 8 + 0)
#define                                 SEG16COM3_bit       _BIT_ACCESS(LCDDATA11,0)
// LCDDATA2<SEG17COM0>
extern volatile __bit                   SEG17COM0           __at(0x891);	// @ (0x112 * 8 + 1)
#define                                 SEG17COM0_bit       _BIT_ACCESS(LCDDATA2,1)
// LCDDATA5<SEG17COM1>
extern volatile __bit                   SEG17COM1           __at(0x8A9);	// @ (0x115 * 8 + 1)
#define                                 SEG17COM1_bit       _BIT_ACCESS(LCDDATA5,1)
// LCDDATA8<SEG17COM2>
extern volatile __bit                   SEG17COM2           __at(0x8C1);	// @ (0x118 * 8 + 1)
#define                                 SEG17COM2_bit       _BIT_ACCESS(LCDDATA8,1)
// LCDDATA11<SEG17COM3>
extern volatile __bit                   SEG17COM3           __at(0x8D9);	// @ (0x11B * 8 + 1)
#define                                 SEG17COM3_bit       _BIT_ACCESS(LCDDATA11,1)
// LCDDATA2<SEG18COM0>
extern volatile __bit                   SEG18COM0           __at(0x892);	// @ (0x112 * 8 + 2)
#define                                 SEG18COM0_bit       _BIT_ACCESS(LCDDATA2,2)
// LCDDATA5<SEG18COM1>
extern volatile __bit                   SEG18COM1           __at(0x8AA);	// @ (0x115 * 8 + 2)
#define                                 SEG18COM1_bit       _BIT_ACCESS(LCDDATA5,2)
// LCDDATA8<SEG18COM2>
extern volatile __bit                   SEG18COM2           __at(0x8C2);	// @ (0x118 * 8 + 2)
#define                                 SEG18COM2_bit       _BIT_ACCESS(LCDDATA8,2)
// LCDDATA11<SEG18COM3>
extern volatile __bit                   SEG18COM3           __at(0x8DA);	// @ (0x11B * 8 + 2)
#define                                 SEG18COM3_bit       _BIT_ACCESS(LCDDATA11,2)
// LCDDATA2<SEG19COM0>
extern volatile __bit                   SEG19COM0           __at(0x893);	// @ (0x112 * 8 + 3)
#define                                 SEG19COM0_bit       _BIT_ACCESS(LCDDATA2,3)
// LCDDATA5<SEG19COM1>
extern volatile __bit                   SEG19COM1           __at(0x8AB);	// @ (0x115 * 8 + 3)
#define                                 SEG19COM1_bit       _BIT_ACCESS(LCDDATA5,3)
// LCDDATA8<SEG19COM2>
extern volatile __bit                   SEG19COM2           __at(0x8C3);	// @ (0x118 * 8 + 3)
#define                                 SEG19COM2_bit       _BIT_ACCESS(LCDDATA8,3)
// LCDDATA11<SEG19COM3>
extern volatile __bit                   SEG19COM3           __at(0x8DB);	// @ (0x11B * 8 + 3)
#define                                 SEG19COM3_bit       _BIT_ACCESS(LCDDATA11,3)
// LCDDATA0<SEG1COM0>
extern volatile __bit                   SEG1COM0            __at(0x881);	// @ (0x110 * 8 + 1)
#define                                 SEG1COM0_bit        _BIT_ACCESS(LCDDATA0,1)
// LCDDATA3<SEG1COM1>
extern volatile __bit                   SEG1COM1            __at(0x899);	// @ (0x113 * 8 + 1)
#define                                 SEG1COM1_bit        _BIT_ACCESS(LCDDATA3,1)
// LCDDATA6<SEG1COM2>
extern volatile __bit                   SEG1COM2            __at(0x8B1);	// @ (0x116 * 8 + 1)
#define                                 SEG1COM2_bit        _BIT_ACCESS(LCDDATA6,1)
// LCDDATA9<SEG1COM3>
extern volatile __bit                   SEG1COM3            __at(0x8C9);	// @ (0x119 * 8 + 1)
#define                                 SEG1COM3_bit        _BIT_ACCESS(LCDDATA9,1)
// LCDDATA2<SEG20COM0>
extern volatile __bit                   SEG20COM0           __at(0x894);	// @ (0x112 * 8 + 4)
#define                                 SEG20COM0_bit       _BIT_ACCESS(LCDDATA2,4)
// LCDDATA5<SEG20COM1>
extern volatile __bit                   SEG20COM1           __at(0x8AC);	// @ (0x115 * 8 + 4)
#define                                 SEG20COM1_bit       _BIT_ACCESS(LCDDATA5,4)
// LCDDATA8<SEG20COM2>
extern volatile __bit                   SEG20COM2           __at(0x8C4);	// @ (0x118 * 8 + 4)
#define                                 SEG20COM2_bit       _BIT_ACCESS(LCDDATA8,4)
// LCDDATA11<SEG20COM3>
extern volatile __bit                   SEG20COM3           __at(0x8DC);	// @ (0x11B * 8 + 4)
#define                                 SEG20COM3_bit       _BIT_ACCESS(LCDDATA11,4)
// LCDDATA2<SEG21COM0>
extern volatile __bit                   SEG21COM0           __at(0x895);	// @ (0x112 * 8 + 5)
#define                                 SEG21COM0_bit       _BIT_ACCESS(LCDDATA2,5)
// LCDDATA5<SEG21COM1>
extern volatile __bit                   SEG21COM1           __at(0x8AD);	// @ (0x115 * 8 + 5)
#define                                 SEG21COM1_bit       _BIT_ACCESS(LCDDATA5,5)
// LCDDATA8<SEG21COM2>
extern volatile __bit                   SEG21COM2           __at(0x8C5);	// @ (0x118 * 8 + 5)
#define                                 SEG21COM2_bit       _BIT_ACCESS(LCDDATA8,5)
// LCDDATA11<SEG21COM3>
extern volatile __bit                   SEG21COM3           __at(0x8DD);	// @ (0x11B * 8 + 5)
#define                                 SEG21COM3_bit       _BIT_ACCESS(LCDDATA11,5)
// LCDDATA2<SEG22COM0>
extern volatile __bit                   SEG22COM0           __at(0x896);	// @ (0x112 * 8 + 6)
#define                                 SEG22COM0_bit       _BIT_ACCESS(LCDDATA2,6)
// LCDDATA5<SEG22COM1>
