MikroElektronika/core_packages/PIC/XC8/def/PIC16F946/mcu.h
extern volatile __bit                   SEG22COM1           __at(0x8AE);	// @ (0x115 * 8 + 6)
#define                                 SEG22COM1_bit       _BIT_ACCESS(LCDDATA5,6)
// LCDDATA8<SEG22COM2>
extern volatile __bit                   SEG22COM2           __at(0x8C6);	// @ (0x118 * 8 + 6)
#define                                 SEG22COM2_bit       _BIT_ACCESS(LCDDATA8,6)
// LCDDATA11<SEG22COM3>
extern volatile __bit                   SEG22COM3           __at(0x8DE);	// @ (0x11B * 8 + 6)
#define                                 SEG22COM3_bit       _BIT_ACCESS(LCDDATA11,6)
// LCDDATA2<SEG23COM0>
extern volatile __bit                   SEG23COM0           __at(0x897);	// @ (0x112 * 8 + 7)
#define                                 SEG23COM0_bit       _BIT_ACCESS(LCDDATA2,7)
// LCDDATA5<SEG23COM1>
extern volatile __bit                   SEG23COM1           __at(0x8AF);	// @ (0x115 * 8 + 7)
#define                                 SEG23COM1_bit       _BIT_ACCESS(LCDDATA5,7)
// LCDDATA8<SEG23COM2>
extern volatile __bit                   SEG23COM2           __at(0x8C7);	// @ (0x118 * 8 + 7)
#define                                 SEG23COM2_bit       _BIT_ACCESS(LCDDATA8,7)
// LCDDATA11<SEG23COM3>
extern volatile __bit                   SEG23COM3           __at(0x8DF);	// @ (0x11B * 8 + 7)
#define                                 SEG23COM3_bit       _BIT_ACCESS(LCDDATA11,7)
// LCDDATA12<SEG24COM0>
extern volatile __bit                   SEG24COM0           __at(0xC80);	// @ (0x190 * 8 + 0)
#define                                 SEG24COM0_bit       _BIT_ACCESS(LCDDATA12,0)
// LCDDATA15<SEG24COM1>
extern volatile __bit                   SEG24COM1           __at(0xC98);	// @ (0x193 * 8 + 0)
#define                                 SEG24COM1_bit       _BIT_ACCESS(LCDDATA15,0)
// LCDDATA18<SEG24COM2>
extern volatile __bit                   SEG24COM2           __at(0xCB0);	// @ (0x196 * 8 + 0)
#define                                 SEG24COM2_bit       _BIT_ACCESS(LCDDATA18,0)
// LCDDATA21<SEG24COM3>
extern volatile __bit                   SEG24COM3           __at(0xCC8);	// @ (0x199 * 8 + 0)
#define                                 SEG24COM3_bit       _BIT_ACCESS(LCDDATA21,0)
// LCDDATA12<SEG25COM0>
extern volatile __bit                   SEG25COM0           __at(0xC81);	// @ (0x190 * 8 + 1)
#define                                 SEG25COM0_bit       _BIT_ACCESS(LCDDATA12,1)
// LCDDATA15<SEG25COM1>
extern volatile __bit                   SEG25COM1           __at(0xC99);	// @ (0x193 * 8 + 1)
#define                                 SEG25COM1_bit       _BIT_ACCESS(LCDDATA15,1)
// LCDDATA18<SEG25COM2>
extern volatile __bit                   SEG25COM2           __at(0xCB1);	// @ (0x196 * 8 + 1)
#define                                 SEG25COM2_bit       _BIT_ACCESS(LCDDATA18,1)
// LCDDATA21<SEG25COM3>
extern volatile __bit                   SEG25COM3           __at(0xCC9);	// @ (0x199 * 8 + 1)
#define                                 SEG25COM3_bit       _BIT_ACCESS(LCDDATA21,1)
// LCDDATA12<SEG26COM0>
extern volatile __bit                   SEG26COM0           __at(0xC82);	// @ (0x190 * 8 + 2)
#define                                 SEG26COM0_bit       _BIT_ACCESS(LCDDATA12,2)
// LCDDATA15<SEG26COM1>
extern volatile __bit                   SEG26COM1           __at(0xC9A);	// @ (0x193 * 8 + 2)
#define                                 SEG26COM1_bit       _BIT_ACCESS(LCDDATA15,2)
// LCDDATA18<SEG26COM2>
extern volatile __bit                   SEG26COM2           __at(0xCB2);	// @ (0x196 * 8 + 2)
#define                                 SEG26COM2_bit       _BIT_ACCESS(LCDDATA18,2)
// LCDDATA21<SEG26COM3>
extern volatile __bit                   SEG26COM3           __at(0xCCA);	// @ (0x199 * 8 + 2)
#define                                 SEG26COM3_bit       _BIT_ACCESS(LCDDATA21,2)
// LCDDATA12<SEG27COM0>
extern volatile __bit                   SEG27COM0           __at(0xC83);	// @ (0x190 * 8 + 3)
#define                                 SEG27COM0_bit       _BIT_ACCESS(LCDDATA12,3)
// LCDDATA15<SEG27COM1>
extern volatile __bit                   SEG27COM1           __at(0xC9B);	// @ (0x193 * 8 + 3)
#define                                 SEG27COM1_bit       _BIT_ACCESS(LCDDATA15,3)
// LCDDATA18<SEG27COM2>
extern volatile __bit                   SEG27COM2           __at(0xCB3);	// @ (0x196 * 8 + 3)
#define                                 SEG27COM2_bit       _BIT_ACCESS(LCDDATA18,3)
// LCDDATA21<SEG27COM3>
extern volatile __bit                   SEG27COM3           __at(0xCCB);	// @ (0x199 * 8 + 3)
#define                                 SEG27COM3_bit       _BIT_ACCESS(LCDDATA21,3)
// LCDDATA12<SEG28COM0>
extern volatile __bit                   SEG28COM0           __at(0xC84);	// @ (0x190 * 8 + 4)
#define                                 SEG28COM0_bit       _BIT_ACCESS(LCDDATA12,4)
// LCDDATA15<SEG28COM1>
extern volatile __bit                   SEG28COM1           __at(0xC9C);	// @ (0x193 * 8 + 4)
#define                                 SEG28COM1_bit       _BIT_ACCESS(LCDDATA15,4)
// LCDDATA18<SEG28COM2>
extern volatile __bit                   SEG28COM2           __at(0xCB4);	// @ (0x196 * 8 + 4)
#define                                 SEG28COM2_bit       _BIT_ACCESS(LCDDATA18,4)
// LCDDATA21<SEG28COM3>
extern volatile __bit                   SEG28COM3           __at(0xCCC);	// @ (0x199 * 8 + 4)
#define                                 SEG28COM3_bit       _BIT_ACCESS(LCDDATA21,4)
// LCDDATA12<SEG29COM0>
extern volatile __bit                   SEG29COM0           __at(0xC85);	// @ (0x190 * 8 + 5)
#define                                 SEG29COM0_bit       _BIT_ACCESS(LCDDATA12,5)
// LCDDATA15<SEG29COM1>
extern volatile __bit                   SEG29COM1           __at(0xC9D);	// @ (0x193 * 8 + 5)
#define                                 SEG29COM1_bit       _BIT_ACCESS(LCDDATA15,5)
// LCDDATA18<SEG29COM2>
extern volatile __bit                   SEG29COM2           __at(0xCB5);	// @ (0x196 * 8 + 5)
#define                                 SEG29COM2_bit       _BIT_ACCESS(LCDDATA18,5)
// LCDDATA21<SEG29COM3>
extern volatile __bit                   SEG29COM3           __at(0xCCD);	// @ (0x199 * 8 + 5)
#define                                 SEG29COM3_bit       _BIT_ACCESS(LCDDATA21,5)
// LCDDATA0<SEG2COM0>
extern volatile __bit                   SEG2COM0            __at(0x882);	// @ (0x110 * 8 + 2)
#define                                 SEG2COM0_bit        _BIT_ACCESS(LCDDATA0,2)
// LCDDATA3<SEG2COM1>
extern volatile __bit                   SEG2COM1            __at(0x89A);	// @ (0x113 * 8 + 2)
#define                                 SEG2COM1_bit        _BIT_ACCESS(LCDDATA3,2)
// LCDDATA6<SEG2COM2>
extern volatile __bit                   SEG2COM2            __at(0x8B2);	// @ (0x116 * 8 + 2)
#define                                 SEG2COM2_bit        _BIT_ACCESS(LCDDATA6,2)
// LCDDATA9<SEG2COM3>
extern volatile __bit                   SEG2COM3            __at(0x8CA);	// @ (0x119 * 8 + 2)
#define                                 SEG2COM3_bit        _BIT_ACCESS(LCDDATA9,2)
// LCDDATA12<SEG30COM0>
extern volatile __bit                   SEG30COM0           __at(0xC86);	// @ (0x190 * 8 + 6)
#define                                 SEG30COM0_bit       _BIT_ACCESS(LCDDATA12,6)
// LCDDATA15<SEG30COM1>
extern volatile __bit                   SEG30COM1           __at(0xC9E);	// @ (0x193 * 8 + 6)
#define                                 SEG30COM1_bit       _BIT_ACCESS(LCDDATA15,6)
// LCDDATA18<SEG30COM2>
extern volatile __bit                   SEG30COM2           __at(0xCB6);	// @ (0x196 * 8 + 6)
#define                                 SEG30COM2_bit       _BIT_ACCESS(LCDDATA18,6)
// LCDDATA21<SEG30COM3>
extern volatile __bit                   SEG30COM3           __at(0xCCE);	// @ (0x199 * 8 + 6)
#define                                 SEG30COM3_bit       _BIT_ACCESS(LCDDATA21,6)
// LCDDATA12<SEG31COM0>
extern volatile __bit                   SEG31COM0           __at(0xC87);	// @ (0x190 * 8 + 7)
#define                                 SEG31COM0_bit       _BIT_ACCESS(LCDDATA12,7)
// LCDDATA15<SEG31COM1>
extern volatile __bit                   SEG31COM1           __at(0xC9F);	// @ (0x193 * 8 + 7)
#define                                 SEG31COM1_bit       _BIT_ACCESS(LCDDATA15,7)
// LCDDATA18<SEG31COM2>
extern volatile __bit                   SEG31COM2           __at(0xCB7);	// @ (0x196 * 8 + 7)
#define                                 SEG31COM2_bit       _BIT_ACCESS(LCDDATA18,7)
// LCDDATA21<SEG31COM3>
extern volatile __bit                   SEG31COM3           __at(0xCCF);	// @ (0x199 * 8 + 7)
#define                                 SEG31COM3_bit       _BIT_ACCESS(LCDDATA21,7)
// LCDDATA13<SEG32COM0>
extern volatile __bit                   SEG32COM0           __at(0xC88);	// @ (0x191 * 8 + 0)
#define                                 SEG32COM0_bit       _BIT_ACCESS(LCDDATA13,0)
// LCDDATA16<SEG32COM1>
extern volatile __bit                   SEG32COM1           __at(0xCA0);	// @ (0x194 * 8 + 0)
#define                                 SEG32COM1_bit       _BIT_ACCESS(LCDDATA16,0)
// LCDDATA19<SEG32COM2>
extern volatile __bit                   SEG32COM2           __at(0xCB8);	// @ (0x197 * 8 + 0)
#define                                 SEG32COM2_bit       _BIT_ACCESS(LCDDATA19,0)
// LCDDATA22<SEG32COM3>
extern volatile __bit                   SEG32COM3           __at(0xCD0);	// @ (0x19A * 8 + 0)
#define                                 SEG32COM3_bit       _BIT_ACCESS(LCDDATA22,0)
// LCDDATA13<SEG33COM0>
extern volatile __bit                   SEG33COM0           __at(0xC89);	// @ (0x191 * 8 + 1)
#define                                 SEG33COM0_bit       _BIT_ACCESS(LCDDATA13,1)
// LCDDATA16<SEG33COM1>
extern volatile __bit                   SEG33COM1           __at(0xCA1);	// @ (0x194 * 8 + 1)
#define                                 SEG33COM1_bit       _BIT_ACCESS(LCDDATA16,1)
// LCDDATA19<SEG33COM2>
extern volatile __bit                   SEG33COM2           __at(0xCB9);	// @ (0x197 * 8 + 1)
#define                                 SEG33COM2_bit       _BIT_ACCESS(LCDDATA19,1)
// LCDDATA22<SEG33COM3>
extern volatile __bit                   SEG33COM3           __at(0xCD1);	// @ (0x19A * 8 + 1)
#define                                 SEG33COM3_bit       _BIT_ACCESS(LCDDATA22,1)
// LCDDATA13<SEG34COM0>
extern volatile __bit                   SEG34COM0           __at(0xC8A);	// @ (0x191 * 8 + 2)
#define                                 SEG34COM0_bit       _BIT_ACCESS(LCDDATA13,2)
// LCDDATA16<SEG34COM1>
extern volatile __bit                   SEG34COM1           __at(0xCA2);	// @ (0x194 * 8 + 2)
#define                                 SEG34COM1_bit       _BIT_ACCESS(LCDDATA16,2)
// LCDDATA19<SEG34COM2>
extern volatile __bit                   SEG34COM2           __at(0xCBA);	// @ (0x197 * 8 + 2)
#define                                 SEG34COM2_bit       _BIT_ACCESS(LCDDATA19,2)
// LCDDATA22<SEG34COM3>
extern volatile __bit                   SEG34COM3           __at(0xCD2);	// @ (0x19A * 8 + 2)
#define                                 SEG34COM3_bit       _BIT_ACCESS(LCDDATA22,2)
// LCDDATA13<SEG35COM0>
extern volatile __bit                   SEG35COM0           __at(0xC8B);	// @ (0x191 * 8 + 3)
#define                                 SEG35COM0_bit       _BIT_ACCESS(LCDDATA13,3)
// LCDDATA16<SEG35COM1>
extern volatile __bit                   SEG35COM1           __at(0xCA3);	// @ (0x194 * 8 + 3)
#define                                 SEG35COM1_bit       _BIT_ACCESS(LCDDATA16,3)
// LCDDATA19<SEG35COM2>
extern volatile __bit                   SEG35COM2           __at(0xCBB);	// @ (0x197 * 8 + 3)
#define                                 SEG35COM2_bit       _BIT_ACCESS(LCDDATA19,3)
// LCDDATA22<SEG35COM3>
extern volatile __bit                   SEG35COM3           __at(0xCD3);	// @ (0x19A * 8 + 3)
#define                                 SEG35COM3_bit       _BIT_ACCESS(LCDDATA22,3)
// LCDDATA13<SEG36COM0>
extern volatile __bit                   SEG36COM0           __at(0xC8C);	// @ (0x191 * 8 + 4)
#define                                 SEG36COM0_bit       _BIT_ACCESS(LCDDATA13,4)
// LCDDATA16<SEG36COM1>
extern volatile __bit                   SEG36COM1           __at(0xCA4);	// @ (0x194 * 8 + 4)
#define                                 SEG36COM1_bit       _BIT_ACCESS(LCDDATA16,4)
// LCDDATA19<SEG36COM2>
extern volatile __bit                   SEG36COM2           __at(0xCBC);	// @ (0x197 * 8 + 4)
#define                                 SEG36COM2_bit       _BIT_ACCESS(LCDDATA19,4)
// LCDDATA22<SEG36COM3>
extern volatile __bit                   SEG36COM3           __at(0xCD4);	// @ (0x19A * 8 + 4)
#define                                 SEG36COM3_bit       _BIT_ACCESS(LCDDATA22,4)
// LCDDATA13<SEG37COM0>
extern volatile __bit                   SEG37COM0           __at(0xC8D);	// @ (0x191 * 8 + 5)
#define                                 SEG37COM0_bit       _BIT_ACCESS(LCDDATA13,5)
// LCDDATA16<SEG37COM1>
extern volatile __bit                   SEG37COM1           __at(0xCA5);	// @ (0x194 * 8 + 5)
#define                                 SEG37COM1_bit       _BIT_ACCESS(LCDDATA16,5)
// LCDDATA19<SEG37COM2>
extern volatile __bit                   SEG37COM2           __at(0xCBD);	// @ (0x197 * 8 + 5)
#define                                 SEG37COM2_bit       _BIT_ACCESS(LCDDATA19,5)
// LCDDATA22<SEG37COM3>
extern volatile __bit                   SEG37COM3           __at(0xCD5);	// @ (0x19A * 8 + 5)
#define                                 SEG37COM3_bit       _BIT_ACCESS(LCDDATA22,5)
// LCDDATA13<SEG38COM0>
extern volatile __bit                   SEG38COM0           __at(0xC8E);	// @ (0x191 * 8 + 6)
#define                                 SEG38COM0_bit       _BIT_ACCESS(LCDDATA13,6)
// LCDDATA16<SEG38COM1>
extern volatile __bit                   SEG38COM1           __at(0xCA6);	// @ (0x194 * 8 + 6)
#define                                 SEG38COM1_bit       _BIT_ACCESS(LCDDATA16,6)
// LCDDATA19<SEG38COM2>
extern volatile __bit                   SEG38COM2           __at(0xCBE);	// @ (0x197 * 8 + 6)
#define                                 SEG38COM2_bit       _BIT_ACCESS(LCDDATA19,6)
// LCDDATA22<SEG38COM3>
extern volatile __bit                   SEG38COM3           __at(0xCD6);	// @ (0x19A * 8 + 6)
#define                                 SEG38COM3_bit       _BIT_ACCESS(LCDDATA22,6)
// LCDDATA13<SEG39COM0>
extern volatile __bit                   SEG39COM0           __at(0xC8F);	// @ (0x191 * 8 + 7)
#define                                 SEG39COM0_bit       _BIT_ACCESS(LCDDATA13,7)
// LCDDATA16<SEG39COM1>
extern volatile __bit                   SEG39COM1           __at(0xCA7);	// @ (0x194 * 8 + 7)
#define                                 SEG39COM1_bit       _BIT_ACCESS(LCDDATA16,7)
// LCDDATA19<SEG39COM2>
extern volatile __bit                   SEG39COM2           __at(0xCBF);	// @ (0x197 * 8 + 7)
#define                                 SEG39COM2_bit       _BIT_ACCESS(LCDDATA19,7)
// LCDDATA22<SEG39COM3>
extern volatile __bit                   SEG39COM3           __at(0xCD7);	// @ (0x19A * 8 + 7)
#define                                 SEG39COM3_bit       _BIT_ACCESS(LCDDATA22,7)
// LCDDATA0<SEG3COM0>
extern volatile __bit                   SEG3COM0            __at(0x883);	// @ (0x110 * 8 + 3)
#define                                 SEG3COM0_bit        _BIT_ACCESS(LCDDATA0,3)
// LCDDATA3<SEG3COM1>
extern volatile __bit                   SEG3COM1            __at(0x89B);	// @ (0x113 * 8 + 3)
#define                                 SEG3COM1_bit        _BIT_ACCESS(LCDDATA3,3)
// LCDDATA6<SEG3COM2>
extern volatile __bit                   SEG3COM2            __at(0x8B3);	// @ (0x116 * 8 + 3)
#define                                 SEG3COM2_bit        _BIT_ACCESS(LCDDATA6,3)
// LCDDATA9<SEG3COM3>
extern volatile __bit                   SEG3COM3            __at(0x8CB);	// @ (0x119 * 8 + 3)
#define                                 SEG3COM3_bit        _BIT_ACCESS(LCDDATA9,3)
// LCDDATA14<SEG40COM0>
extern volatile __bit                   SEG40COM0           __at(0xC90);	// @ (0x192 * 8 + 0)
#define                                 SEG40COM0_bit       _BIT_ACCESS(LCDDATA14,0)
// LCDDATA17<SEG40COM1>
extern volatile __bit                   SEG40COM1           __at(0xCA8);	// @ (0x195 * 8 + 0)
#define                                 SEG40COM1_bit       _BIT_ACCESS(LCDDATA17,0)
// LCDDATA20<SEG40COM2>
extern volatile __bit                   SEG40COM2           __at(0xCC0);	// @ (0x198 * 8 + 0)
#define                                 SEG40COM2_bit       _BIT_ACCESS(LCDDATA20,0)
// LCDDATA23<SEG40COM3>
extern volatile __bit                   SEG40COM3           __at(0xCD8);	// @ (0x19B * 8 + 0)
#define                                 SEG40COM3_bit       _BIT_ACCESS(LCDDATA23,0)
// LCDDATA14<SEG41COM0>
extern volatile __bit                   SEG41COM0           __at(0xC91);	// @ (0x192 * 8 + 1)
#define                                 SEG41COM0_bit       _BIT_ACCESS(LCDDATA14,1)
// LCDDATA17<SEG41COM1>
extern volatile __bit                   SEG41COM1           __at(0xCA9);	// @ (0x195 * 8 + 1)
#define                                 SEG41COM1_bit       _BIT_ACCESS(LCDDATA17,1)
// LCDDATA20<SEG41COM2>
extern volatile __bit                   SEG41COM2           __at(0xCC1);	// @ (0x198 * 8 + 1)
#define                                 SEG41COM2_bit       _BIT_ACCESS(LCDDATA20,1)
// LCDDATA23<SEG41COM3>
extern volatile __bit                   SEG41COM3           __at(0xCD9);	// @ (0x19B * 8 + 1)
#define                                 SEG41COM3_bit       _BIT_ACCESS(LCDDATA23,1)
// LCDDATA0<SEG4COM0>
extern volatile __bit                   SEG4COM0            __at(0x884);	// @ (0x110 * 8 + 4)
#define                                 SEG4COM0_bit        _BIT_ACCESS(LCDDATA0,4)
// LCDDATA3<SEG4COM1>
extern volatile __bit                   SEG4COM1            __at(0x89C);	// @ (0x113 * 8 + 4)
#define                                 SEG4COM1_bit        _BIT_ACCESS(LCDDATA3,4)
// LCDDATA6<SEG4COM2>
extern volatile __bit                   SEG4COM2            __at(0x8B4);	// @ (0x116 * 8 + 4)
#define                                 SEG4COM2_bit        _BIT_ACCESS(LCDDATA6,4)
// LCDDATA9<SEG4COM3>
extern volatile __bit                   SEG4COM3            __at(0x8CC);	// @ (0x119 * 8 + 4)
#define                                 SEG4COM3_bit        _BIT_ACCESS(LCDDATA9,4)
// LCDDATA0<SEG5COM0>
extern volatile __bit                   SEG5COM0            __at(0x885);	// @ (0x110 * 8 + 5)
#define                                 SEG5COM0_bit        _BIT_ACCESS(LCDDATA0,5)
// LCDDATA3<SEG5COM1>
extern volatile __bit                   SEG5COM1            __at(0x89D);	// @ (0x113 * 8 + 5)
#define                                 SEG5COM1_bit        _BIT_ACCESS(LCDDATA3,5)
// LCDDATA6<SEG5COM2>
extern volatile __bit                   SEG5COM2            __at(0x8B5);	// @ (0x116 * 8 + 5)
#define                                 SEG5COM2_bit        _BIT_ACCESS(LCDDATA6,5)
// LCDDATA9<SEG5COM3>
extern volatile __bit                   SEG5COM3            __at(0x8CD);	// @ (0x119 * 8 + 5)
#define                                 SEG5COM3_bit        _BIT_ACCESS(LCDDATA9,5)
// LCDDATA0<SEG6COM0>
extern volatile __bit                   SEG6COM0            __at(0x886);	// @ (0x110 * 8 + 6)
#define                                 SEG6COM0_bit        _BIT_ACCESS(LCDDATA0,6)
// LCDDATA3<SEG6COM1>
extern volatile __bit                   SEG6COM1            __at(0x89E);	// @ (0x113 * 8 + 6)
#define                                 SEG6COM1_bit        _BIT_ACCESS(LCDDATA3,6)
// LCDDATA6<SEG6COM2>
extern volatile __bit                   SEG6COM2            __at(0x8B6);	// @ (0x116 * 8 + 6)
#define                                 SEG6COM2_bit        _BIT_ACCESS(LCDDATA6,6)
// LCDDATA9<SEG6COM3>
extern volatile __bit                   SEG6COM3            __at(0x8CE);	// @ (0x119 * 8 + 6)
#define                                 SEG6COM3_bit        _BIT_ACCESS(LCDDATA9,6)
// LCDDATA0<SEG7COM0>
extern volatile __bit                   SEG7COM0            __at(0x887);	// @ (0x110 * 8 + 7)
#define                                 SEG7COM0_bit        _BIT_ACCESS(LCDDATA0,7)
// LCDDATA3<SEG7COM1>
extern volatile __bit                   SEG7COM1            __at(0x89F);	// @ (0x113 * 8 + 7)
#define                                 SEG7COM1_bit        _BIT_ACCESS(LCDDATA3,7)
// LCDDATA6<SEG7COM2>
extern volatile __bit                   SEG7COM2            __at(0x8B7);	// @ (0x116 * 8 + 7)
#define                                 SEG7COM2_bit        _BIT_ACCESS(LCDDATA6,7)
// LCDDATA9<SEG7COM3>
extern volatile __bit                   SEG7COM3            __at(0x8CF);	// @ (0x119 * 8 + 7)
#define                                 SEG7COM3_bit        _BIT_ACCESS(LCDDATA9,7)
// LCDDATA1<SEG8COM0>
extern volatile __bit                   SEG8COM0            __at(0x888);	// @ (0x111 * 8 + 0)
#define                                 SEG8COM0_bit        _BIT_ACCESS(LCDDATA1,0)
// LCDDATA4<SEG8COM1>
extern volatile __bit                   SEG8COM1            __at(0x8A0);	// @ (0x114 * 8 + 0)
#define                                 SEG8COM1_bit        _BIT_ACCESS(LCDDATA4,0)
// LCDDATA7<SEG8COM2>
extern volatile __bit                   SEG8COM2            __at(0x8B8);	// @ (0x117 * 8 + 0)
#define                                 SEG8COM2_bit        _BIT_ACCESS(LCDDATA7,0)
// LCDDATA10<SEG8COM3>
extern volatile __bit                   SEG8COM3            __at(0x8D0);	// @ (0x11A * 8 + 0)
#define                                 SEG8COM3_bit        _BIT_ACCESS(LCDDATA10,0)
// LCDDATA1<SEG9COM0>
extern volatile __bit                   SEG9COM0            __at(0x889);	// @ (0x111 * 8 + 1)
#define                                 SEG9COM0_bit        _BIT_ACCESS(LCDDATA1,1)
// LCDDATA4<SEG9COM1>
extern volatile __bit                   SEG9COM1            __at(0x8A1);	// @ (0x114 * 8 + 1)
#define                                 SEG9COM1_bit        _BIT_ACCESS(LCDDATA4,1)
// LCDDATA7<SEG9COM2>
extern volatile __bit                   SEG9COM2            __at(0x8B9);	// @ (0x117 * 8 + 1)
#define                                 SEG9COM2_bit        _BIT_ACCESS(LCDDATA7,1)
// LCDDATA10<SEG9COM3>
extern volatile __bit                   SEG9COM3            __at(0x8D1);	// @ (0x11A * 8 + 1)
#define                                 SEG9COM3_bit        _BIT_ACCESS(LCDDATA10,1)
// LCDSE0<SEGEN0>
extern volatile __bit                   SEGEN0              __at(0x8E0);	// @ (0x11C * 8 + 0)
#define                                 SEGEN0_bit          _BIT_ACCESS(LCDSE0,0)
// LCDSE0<SEGEN1>
extern volatile __bit                   SEGEN1              __at(0x8E1);	// @ (0x11C * 8 + 1)
#define                                 SEGEN1_bit          _BIT_ACCESS(LCDSE0,1)
// LCDSE1<SEGEN10>
extern volatile __bit                   SEGEN10             __at(0x8EA);	// @ (0x11D * 8 + 2)
#define                                 SEGEN10_bit         _BIT_ACCESS(LCDSE1,2)
// LCDSE1<SEGEN11>
extern volatile __bit                   SEGEN11             __at(0x8EB);	// @ (0x11D * 8 + 3)
#define                                 SEGEN11_bit         _BIT_ACCESS(LCDSE1,3)
// LCDSE1<SEGEN12>
extern volatile __bit                   SEGEN12             __at(0x8EC);	// @ (0x11D * 8 + 4)
#define                                 SEGEN12_bit         _BIT_ACCESS(LCDSE1,4)
// LCDSE1<SEGEN13>
extern volatile __bit                   SEGEN13             __at(0x8ED);	// @ (0x11D * 8 + 5)
#define                                 SEGEN13_bit         _BIT_ACCESS(LCDSE1,5)
// LCDSE1<SEGEN14>
extern volatile __bit                   SEGEN14             __at(0x8EE);	// @ (0x11D * 8 + 6)
#define                                 SEGEN14_bit         _BIT_ACCESS(LCDSE1,6)
// LCDSE1<SEGEN15>
extern volatile __bit                   SEGEN15             __at(0x8EF);	// @ (0x11D * 8 + 7)
#define                                 SEGEN15_bit         _BIT_ACCESS(LCDSE1,7)
// LCDSE2<SEGEN16>
