MikroElektronika/core_packages/PIC/XC8/def/PIC16F946/mcu.h
extern volatile __bit                   SEGEN16             __at(0x8F0);	// @ (0x11E * 8 + 0)
#define                                 SEGEN16_bit         _BIT_ACCESS(LCDSE2,0)
// LCDSE2<SEGEN17>
extern volatile __bit                   SEGEN17             __at(0x8F1);	// @ (0x11E * 8 + 1)
#define                                 SEGEN17_bit         _BIT_ACCESS(LCDSE2,1)
// LCDSE2<SEGEN18>
extern volatile __bit                   SEGEN18             __at(0x8F2);	// @ (0x11E * 8 + 2)
#define                                 SEGEN18_bit         _BIT_ACCESS(LCDSE2,2)
// LCDSE2<SEGEN19>
extern volatile __bit                   SEGEN19             __at(0x8F3);	// @ (0x11E * 8 + 3)
#define                                 SEGEN19_bit         _BIT_ACCESS(LCDSE2,3)
// LCDSE0<SEGEN2>
extern volatile __bit                   SEGEN2              __at(0x8E2);	// @ (0x11C * 8 + 2)
#define                                 SEGEN2_bit          _BIT_ACCESS(LCDSE0,2)
// LCDSE2<SEGEN20>
extern volatile __bit                   SEGEN20             __at(0x8F4);	// @ (0x11E * 8 + 4)
#define                                 SEGEN20_bit         _BIT_ACCESS(LCDSE2,4)
// LCDSE2<SEGEN21>
extern volatile __bit                   SEGEN21             __at(0x8F5);	// @ (0x11E * 8 + 5)
#define                                 SEGEN21_bit         _BIT_ACCESS(LCDSE2,5)
// LCDSE2<SEGEN22>
extern volatile __bit                   SEGEN22             __at(0x8F6);	// @ (0x11E * 8 + 6)
#define                                 SEGEN22_bit         _BIT_ACCESS(LCDSE2,6)
// LCDSE2<SEGEN23>
extern volatile __bit                   SEGEN23             __at(0x8F7);	// @ (0x11E * 8 + 7)
#define                                 SEGEN23_bit         _BIT_ACCESS(LCDSE2,7)
// LCDSE3<SEGEN24>
extern volatile __bit                   SEGEN24             __at(0xCE0);	// @ (0x19C * 8 + 0)
#define                                 SEGEN24_bit         _BIT_ACCESS(LCDSE3,0)
// LCDSE3<SEGEN25>
extern volatile __bit                   SEGEN25             __at(0xCE1);	// @ (0x19C * 8 + 1)
#define                                 SEGEN25_bit         _BIT_ACCESS(LCDSE3,1)
// LCDSE3<SEGEN26>
extern volatile __bit                   SEGEN26             __at(0xCE2);	// @ (0x19C * 8 + 2)
#define                                 SEGEN26_bit         _BIT_ACCESS(LCDSE3,2)
// LCDSE3<SEGEN27>
extern volatile __bit                   SEGEN27             __at(0xCE3);	// @ (0x19C * 8 + 3)
#define                                 SEGEN27_bit         _BIT_ACCESS(LCDSE3,3)
// LCDSE3<SEGEN28>
extern volatile __bit                   SEGEN28             __at(0xCE4);	// @ (0x19C * 8 + 4)
#define                                 SEGEN28_bit         _BIT_ACCESS(LCDSE3,4)
// LCDSE3<SEGEN29>
extern volatile __bit                   SEGEN29             __at(0xCE5);	// @ (0x19C * 8 + 5)
#define                                 SEGEN29_bit         _BIT_ACCESS(LCDSE3,5)
// LCDSE0<SEGEN3>
extern volatile __bit                   SEGEN3              __at(0x8E3);	// @ (0x11C * 8 + 3)
#define                                 SEGEN3_bit          _BIT_ACCESS(LCDSE0,3)
// LCDSE3<SEGEN30>
extern volatile __bit                   SEGEN30             __at(0xCE6);	// @ (0x19C * 8 + 6)
#define                                 SEGEN30_bit         _BIT_ACCESS(LCDSE3,6)
// LCDSE3<SEGEN31>
extern volatile __bit                   SEGEN31             __at(0xCE7);	// @ (0x19C * 8 + 7)
#define                                 SEGEN31_bit         _BIT_ACCESS(LCDSE3,7)
// LCDSE4<SEGEN32>
extern volatile __bit                   SEGEN32             __at(0xCE8);	// @ (0x19D * 8 + 0)
#define                                 SEGEN32_bit         _BIT_ACCESS(LCDSE4,0)
// LCDSE4<SEGEN33>
extern volatile __bit                   SEGEN33             __at(0xCE9);	// @ (0x19D * 8 + 1)
#define                                 SEGEN33_bit         _BIT_ACCESS(LCDSE4,1)
// LCDSE4<SEGEN34>
extern volatile __bit                   SEGEN34             __at(0xCEA);	// @ (0x19D * 8 + 2)
#define                                 SEGEN34_bit         _BIT_ACCESS(LCDSE4,2)
// LCDSE4<SEGEN35>
extern volatile __bit                   SEGEN35             __at(0xCEB);	// @ (0x19D * 8 + 3)
#define                                 SEGEN35_bit         _BIT_ACCESS(LCDSE4,3)
// LCDSE4<SEGEN36>
extern volatile __bit                   SEGEN36             __at(0xCEC);	// @ (0x19D * 8 + 4)
#define                                 SEGEN36_bit         _BIT_ACCESS(LCDSE4,4)
// LCDSE4<SEGEN37>
extern volatile __bit                   SEGEN37             __at(0xCED);	// @ (0x19D * 8 + 5)
#define                                 SEGEN37_bit         _BIT_ACCESS(LCDSE4,5)
// LCDSE4<SEGEN38>
extern volatile __bit                   SEGEN38             __at(0xCEE);	// @ (0x19D * 8 + 6)
#define                                 SEGEN38_bit         _BIT_ACCESS(LCDSE4,6)
// LCDSE4<SEGEN39>
extern volatile __bit                   SEGEN39             __at(0xCEF);	// @ (0x19D * 8 + 7)
#define                                 SEGEN39_bit         _BIT_ACCESS(LCDSE4,7)
// LCDSE0<SEGEN4>
extern volatile __bit                   SEGEN4              __at(0x8E4);	// @ (0x11C * 8 + 4)
#define                                 SEGEN4_bit          _BIT_ACCESS(LCDSE0,4)
// LCDSE5<SEGEN40>
extern volatile __bit                   SEGEN40             __at(0xCF0);	// @ (0x19E * 8 + 0)
#define                                 SEGEN40_bit         _BIT_ACCESS(LCDSE5,0)
// LCDSE5<SEGEN41>
extern volatile __bit                   SEGEN41             __at(0xCF1);	// @ (0x19E * 8 + 1)
#define                                 SEGEN41_bit         _BIT_ACCESS(LCDSE5,1)
// LCDSE0<SEGEN5>
extern volatile __bit                   SEGEN5              __at(0x8E5);	// @ (0x11C * 8 + 5)
#define                                 SEGEN5_bit          _BIT_ACCESS(LCDSE0,5)
// LCDSE0<SEGEN6>
extern volatile __bit                   SEGEN6              __at(0x8E6);	// @ (0x11C * 8 + 6)
#define                                 SEGEN6_bit          _BIT_ACCESS(LCDSE0,6)
// LCDSE0<SEGEN7>
extern volatile __bit                   SEGEN7              __at(0x8E7);	// @ (0x11C * 8 + 7)
#define                                 SEGEN7_bit          _BIT_ACCESS(LCDSE0,7)
// LCDSE1<SEGEN8>
extern volatile __bit                   SEGEN8              __at(0x8E8);	// @ (0x11D * 8 + 0)
#define                                 SEGEN8_bit          _BIT_ACCESS(LCDSE1,0)
// LCDSE1<SEGEN9>
extern volatile __bit                   SEGEN9              __at(0x8E9);	// @ (0x11D * 8 + 1)
#define                                 SEGEN9_bit          _BIT_ACCESS(LCDSE1,1)
// LCDCON<SLPEN>
extern volatile __bit                   SLPEN               __at(0x83E);	// @ (0x107 * 8 + 6)
#define                                 SLPEN_bit           _BIT_ACCESS(LCDCON,6)
// SSPSTAT<SMP>
extern volatile __bit                   SMP                 __at(0x4A7);	// @ (0x94 * 8 + 7)
#define                                 SMP_bit             _BIT_ACCESS(SSPSTAT,7)
// RCSTA<SPEN>
extern volatile __bit                   SPEN                __at(0xC7);	// @ (0x18 * 8 + 7)
#define                                 SPEN_bit            _BIT_ACCESS(RCSTA,7)
// RCSTA<SREN>
extern volatile __bit                   SREN                __at(0xC5);	// @ (0x18 * 8 + 5)
#define                                 SREN_bit            _BIT_ACCESS(RCSTA,5)
// SSPCON<SSPEN>
extern volatile __bit                   SSPEN               __at(0xA5);	// @ (0x14 * 8 + 5)
#define                                 SSPEN_bit           _BIT_ACCESS(SSPCON,5)
// PIE1<SSPIE>
extern volatile __bit                   SSPIE               __at(0x463);	// @ (0x8C * 8 + 3)
#define                                 SSPIE_bit           _BIT_ACCESS(PIE1,3)
// PIR1<SSPIF>
extern volatile __bit                   SSPIF               __at(0x63);	// @ (0xC * 8 + 3)
#define                                 SSPIF_bit           _BIT_ACCESS(PIR1,3)
// SSPCON<SSPM0>
extern volatile __bit                   SSPM0               __at(0xA0);	// @ (0x14 * 8 + 0)
#define                                 SSPM0_bit           _BIT_ACCESS(SSPCON,0)
// SSPCON<SSPM1>
extern volatile __bit                   SSPM1               __at(0xA1);	// @ (0x14 * 8 + 1)
#define                                 SSPM1_bit           _BIT_ACCESS(SSPCON,1)
// SSPCON<SSPM2>
extern volatile __bit                   SSPM2               __at(0xA2);	// @ (0x14 * 8 + 2)
#define                                 SSPM2_bit           _BIT_ACCESS(SSPCON,2)
// SSPCON<SSPM3>
extern volatile __bit                   SSPM3               __at(0xA3);	// @ (0x14 * 8 + 3)
#define                                 SSPM3_bit           _BIT_ACCESS(SSPCON,3)
// SSPCON<SSPOV>
extern volatile __bit                   SSPOV               __at(0xA6);	// @ (0x14 * 8 + 6)
#define                                 SSPOV_bit           _BIT_ACCESS(SSPCON,6)
// WDTCON<SWDTE>
extern volatile __bit                   SWDTE               __at(0x828);	// @ (0x105 * 8 + 0)
#define                                 SWDTE_bit           _BIT_ACCESS(WDTCON,0)
// WDTCON<SWDTEN>
extern volatile __bit                   SWDTEN              __at(0x828);	// @ (0x105 * 8 + 0)
#define                                 SWDTEN_bit          _BIT_ACCESS(WDTCON,0)
// TXSTA<SYNC>
extern volatile __bit                   SYNC                __at(0x4C4);	// @ (0x98 * 8 + 4)
#define                                 SYNC_bit            _BIT_ACCESS(TXSTA,4)
// OPTION_REG<T0CS>
extern volatile __bit                   T0CS                __at(0x40D);	// @ (0x81 * 8 + 5)
#define                                 T0CS_bit            _BIT_ACCESS(OPTION_REG,5)
// INTCON<T0IE>
extern volatile __bit                   T0IE                __at(0x5D);	// @ (0xB * 8 + 5)
#define                                 T0IE_bit            _BIT_ACCESS(INTCON,5)
// INTCON<T0IF>
extern volatile __bit                   T0IF                __at(0x5A);	// @ (0xB * 8 + 2)
#define                                 T0IF_bit            _BIT_ACCESS(INTCON,2)
// OPTION_REG<T0SE>
extern volatile __bit                   T0SE                __at(0x40C);	// @ (0x81 * 8 + 4)
#define                                 T0SE_bit            _BIT_ACCESS(OPTION_REG,4)
// T1CON<T1CKPS0>
extern volatile __bit                   T1CKPS0             __at(0x84);	// @ (0x10 * 8 + 4)
#define                                 T1CKPS0_bit         _BIT_ACCESS(T1CON,4)
// T1CON<T1CKPS1>
extern volatile __bit                   T1CKPS1             __at(0x85);	// @ (0x10 * 8 + 5)
#define                                 T1CKPS1_bit         _BIT_ACCESS(T1CON,5)
// T1CON<T1GE>
extern volatile __bit                   T1GE                __at(0x86);	// @ (0x10 * 8 + 6)
#define                                 T1GE_bit            _BIT_ACCESS(T1CON,6)
// T1CON<T1GINV>
extern volatile __bit                   T1GINV              __at(0x87);	// @ (0x10 * 8 + 7)
#define                                 T1GINV_bit          _BIT_ACCESS(T1CON,7)
// CMCON1<T1GSS>
extern volatile __bit                   T1GSS               __at(0x4B9);	// @ (0x97 * 8 + 1)
#define                                 T1GSS_bit           _BIT_ACCESS(CMCON1,1)
// T1CON<T1INSYNC>
extern volatile __bit                   T1INSYNC            __at(0x82);	// @ (0x10 * 8 + 2)
#define                                 T1INSYNC_bit        _BIT_ACCESS(T1CON,2)
// T1CON<T1OSCEN>
extern volatile __bit                   T1OSCEN             __at(0x83);	// @ (0x10 * 8 + 3)
#define                                 T1OSCEN_bit         _BIT_ACCESS(T1CON,3)
// T1CON<T1SYNC>
extern volatile __bit                   T1SYNC              __at(0x82);	// @ (0x10 * 8 + 2)
#define                                 T1SYNC_bit          _BIT_ACCESS(T1CON,2)
// T2CON<T2CKPS0>
extern volatile __bit                   T2CKPS0             __at(0x90);	// @ (0x12 * 8 + 0)
#define                                 T2CKPS0_bit         _BIT_ACCESS(T2CON,0)
// T2CON<T2CKPS1>
extern volatile __bit                   T2CKPS1             __at(0x91);	// @ (0x12 * 8 + 1)
#define                                 T2CKPS1_bit         _BIT_ACCESS(T2CON,1)
// INTCON<TMR0IE>
extern volatile __bit                   TMR0IE              __at(0x5D);	// @ (0xB * 8 + 5)
#define                                 TMR0IE_bit          _BIT_ACCESS(INTCON,5)
// INTCON<TMR0IF>
extern volatile __bit                   TMR0IF              __at(0x5A);	// @ (0xB * 8 + 2)
#define                                 TMR0IF_bit          _BIT_ACCESS(INTCON,2)
// T1CON<TMR1CS>
extern volatile __bit                   TMR1CS              __at(0x81);	// @ (0x10 * 8 + 1)
#define                                 TMR1CS_bit          _BIT_ACCESS(T1CON,1)
// T1CON<TMR1GE>
extern volatile __bit                   TMR1GE              __at(0x86);	// @ (0x10 * 8 + 6)
#define                                 TMR1GE_bit          _BIT_ACCESS(T1CON,6)
// PIE1<TMR1IE>
extern volatile __bit                   TMR1IE              __at(0x460);	// @ (0x8C * 8 + 0)
#define                                 TMR1IE_bit          _BIT_ACCESS(PIE1,0)
// PIR1<TMR1IF>
extern volatile __bit                   TMR1IF              __at(0x60);	// @ (0xC * 8 + 0)
#define                                 TMR1IF_bit          _BIT_ACCESS(PIR1,0)
// T1CON<TMR1ON>
extern volatile __bit                   TMR1ON              __at(0x80);	// @ (0x10 * 8 + 0)
#define                                 TMR1ON_bit          _BIT_ACCESS(T1CON,0)
// PIE1<TMR2IE>
extern volatile __bit                   TMR2IE              __at(0x461);	// @ (0x8C * 8 + 1)
#define                                 TMR2IE_bit          _BIT_ACCESS(PIE1,1)
// PIR1<TMR2IF>
extern volatile __bit                   TMR2IF              __at(0x61);	// @ (0xC * 8 + 1)
#define                                 TMR2IF_bit          _BIT_ACCESS(PIR1,1)
// T2CON<TMR2ON>
extern volatile __bit                   TMR2ON              __at(0x92);	// @ (0x12 * 8 + 2)
#define                                 TMR2ON_bit          _BIT_ACCESS(T2CON,2)
// T2CON<TOUTPS0>
extern volatile __bit                   TOUTPS0             __at(0x93);	// @ (0x12 * 8 + 3)
#define                                 TOUTPS0_bit         _BIT_ACCESS(T2CON,3)
// T2CON<TOUTPS1>
extern volatile __bit                   TOUTPS1             __at(0x94);	// @ (0x12 * 8 + 4)
#define                                 TOUTPS1_bit         _BIT_ACCESS(T2CON,4)
// T2CON<TOUTPS2>
extern volatile __bit                   TOUTPS2             __at(0x95);	// @ (0x12 * 8 + 5)
#define                                 TOUTPS2_bit         _BIT_ACCESS(T2CON,5)
// T2CON<TOUTPS3>
extern volatile __bit                   TOUTPS3             __at(0x96);	// @ (0x12 * 8 + 6)
#define                                 TOUTPS3_bit         _BIT_ACCESS(T2CON,6)
// TRISA<TRISA0>
extern volatile __bit                   TRISA0              __at(0x428);	// @ (0x85 * 8 + 0)
#define                                 TRISA0_bit          _BIT_ACCESS(TRISA,0)
// TRISA<TRISA1>
extern volatile __bit                   TRISA1              __at(0x429);	// @ (0x85 * 8 + 1)
#define                                 TRISA1_bit          _BIT_ACCESS(TRISA,1)
// TRISA<TRISA2>
extern volatile __bit                   TRISA2              __at(0x42A);	// @ (0x85 * 8 + 2)
#define                                 TRISA2_bit          _BIT_ACCESS(TRISA,2)
// TRISA<TRISA3>
extern volatile __bit                   TRISA3              __at(0x42B);	// @ (0x85 * 8 + 3)
#define                                 TRISA3_bit          _BIT_ACCESS(TRISA,3)
// TRISA<TRISA4>
extern volatile __bit                   TRISA4              __at(0x42C);	// @ (0x85 * 8 + 4)
#define                                 TRISA4_bit          _BIT_ACCESS(TRISA,4)
// TRISA<TRISA5>
extern volatile __bit                   TRISA5              __at(0x42D);	// @ (0x85 * 8 + 5)
#define                                 TRISA5_bit          _BIT_ACCESS(TRISA,5)
// TRISA<TRISA6>
extern volatile __bit                   TRISA6              __at(0x42E);	// @ (0x85 * 8 + 6)
#define                                 TRISA6_bit          _BIT_ACCESS(TRISA,6)
// TRISA<TRISA7>
extern volatile __bit                   TRISA7              __at(0x42F);	// @ (0x85 * 8 + 7)
#define                                 TRISA7_bit          _BIT_ACCESS(TRISA,7)
// TRISB<TRISB0>
extern volatile __bit                   TRISB0              __at(0x430);	// @ (0x86 * 8 + 0)
#define                                 TRISB0_bit          _BIT_ACCESS(TRISB,0)
// TRISB<TRISB1>
extern volatile __bit                   TRISB1              __at(0x431);	// @ (0x86 * 8 + 1)
#define                                 TRISB1_bit          _BIT_ACCESS(TRISB,1)
// TRISB<TRISB2>
extern volatile __bit                   TRISB2              __at(0x432);	// @ (0x86 * 8 + 2)
#define                                 TRISB2_bit          _BIT_ACCESS(TRISB,2)
// TRISB<TRISB3>
extern volatile __bit                   TRISB3              __at(0x433);	// @ (0x86 * 8 + 3)
#define                                 TRISB3_bit          _BIT_ACCESS(TRISB,3)
// TRISB<TRISB4>
extern volatile __bit                   TRISB4              __at(0x434);	// @ (0x86 * 8 + 4)
#define                                 TRISB4_bit          _BIT_ACCESS(TRISB,4)
// TRISB<TRISB5>
extern volatile __bit                   TRISB5              __at(0x435);	// @ (0x86 * 8 + 5)
#define                                 TRISB5_bit          _BIT_ACCESS(TRISB,5)
// TRISB<TRISB6>
extern volatile __bit                   TRISB6              __at(0x436);	// @ (0x86 * 8 + 6)
#define                                 TRISB6_bit          _BIT_ACCESS(TRISB,6)
// TRISB<TRISB7>
extern volatile __bit                   TRISB7              __at(0x437);	// @ (0x86 * 8 + 7)
#define                                 TRISB7_bit          _BIT_ACCESS(TRISB,7)
// TRISC<TRISC0>
extern volatile __bit                   TRISC0              __at(0x438);	// @ (0x87 * 8 + 0)
#define                                 TRISC0_bit          _BIT_ACCESS(TRISC,0)
// TRISC<TRISC1>
extern volatile __bit                   TRISC1              __at(0x439);	// @ (0x87 * 8 + 1)
#define                                 TRISC1_bit          _BIT_ACCESS(TRISC,1)
// TRISC<TRISC2>
extern volatile __bit                   TRISC2              __at(0x43A);	// @ (0x87 * 8 + 2)
#define                                 TRISC2_bit          _BIT_ACCESS(TRISC,2)
// TRISC<TRISC3>
extern volatile __bit                   TRISC3              __at(0x43B);	// @ (0x87 * 8 + 3)
#define                                 TRISC3_bit          _BIT_ACCESS(TRISC,3)
// TRISC<TRISC4>
extern volatile __bit                   TRISC4              __at(0x43C);	// @ (0x87 * 8 + 4)
#define                                 TRISC4_bit          _BIT_ACCESS(TRISC,4)
// TRISC<TRISC5>
extern volatile __bit                   TRISC5              __at(0x43D);	// @ (0x87 * 8 + 5)
#define                                 TRISC5_bit          _BIT_ACCESS(TRISC,5)
// TRISC<TRISC6>
extern volatile __bit                   TRISC6              __at(0x43E);	// @ (0x87 * 8 + 6)
#define                                 TRISC6_bit          _BIT_ACCESS(TRISC,6)
// TRISC<TRISC7>
extern volatile __bit                   TRISC7              __at(0x43F);	// @ (0x87 * 8 + 7)
#define                                 TRISC7_bit          _BIT_ACCESS(TRISC,7)
// TRISD<TRISD0>
extern volatile __bit                   TRISD0              __at(0x440);	// @ (0x88 * 8 + 0)
#define                                 TRISD0_bit          _BIT_ACCESS(TRISD,0)
// TRISD<TRISD1>
extern volatile __bit                   TRISD1              __at(0x441);	// @ (0x88 * 8 + 1)
#define                                 TRISD1_bit          _BIT_ACCESS(TRISD,1)
// TRISD<TRISD2>
extern volatile __bit                   TRISD2              __at(0x442);	// @ (0x88 * 8 + 2)
#define                                 TRISD2_bit          _BIT_ACCESS(TRISD,2)
// TRISD<TRISD3>
extern volatile __bit                   TRISD3              __at(0x443);	// @ (0x88 * 8 + 3)
#define                                 TRISD3_bit          _BIT_ACCESS(TRISD,3)
// TRISD<TRISD4>
extern volatile __bit                   TRISD4              __at(0x444);	// @ (0x88 * 8 + 4)
#define                                 TRISD4_bit          _BIT_ACCESS(TRISD,4)
// TRISD<TRISD5>
extern volatile __bit                   TRISD5              __at(0x445);	// @ (0x88 * 8 + 5)
#define                                 TRISD5_bit          _BIT_ACCESS(TRISD,5)
// TRISD<TRISD6>
extern volatile __bit                   TRISD6              __at(0x446);	// @ (0x88 * 8 + 6)
#define                                 TRISD6_bit          _BIT_ACCESS(TRISD,6)
// TRISD<TRISD7>
extern volatile __bit                   TRISD7              __at(0x447);	// @ (0x88 * 8 + 7)
#define                                 TRISD7_bit          _BIT_ACCESS(TRISD,7)
// TRISE<TRISE0>
extern volatile __bit                   TRISE0              __at(0x448);	// @ (0x89 * 8 + 0)
#define                                 TRISE0_bit          _BIT_ACCESS(TRISE,0)
// TRISE<TRISE1>
extern volatile __bit                   TRISE1              __at(0x449);	// @ (0x89 * 8 + 1)
#define                                 TRISE1_bit          _BIT_ACCESS(TRISE,1)
// TRISE<TRISE2>
extern volatile __bit                   TRISE2              __at(0x44A);	// @ (0x89 * 8 + 2)
#define                                 TRISE2_bit          _BIT_ACCESS(TRISE,2)
// TRISE<TRISE3>
extern volatile __bit                   TRISE3              __at(0x44B);	// @ (0x89 * 8 + 3)
#define                                 TRISE3_bit          _BIT_ACCESS(TRISE,3)
// TRISE<TRISE4>
extern volatile __bit                   TRISE4              __at(0x44C);	// @ (0x89 * 8 + 4)
#define                                 TRISE4_bit          _BIT_ACCESS(TRISE,4)
// TRISE<TRISE5>
extern volatile __bit                   TRISE5              __at(0x44D);	// @ (0x89 * 8 + 5)
#define                                 TRISE5_bit          _BIT_ACCESS(TRISE,5)
// TRISE<TRISE6>
extern volatile __bit                   TRISE6              __at(0x44E);	// @ (0x89 * 8 + 6)
#define                                 TRISE6_bit          _BIT_ACCESS(TRISE,6)
// TRISE<TRISE7>
extern volatile __bit                   TRISE7              __at(0x44F);	// @ (0x89 * 8 + 7)
#define                                 TRISE7_bit          _BIT_ACCESS(TRISE,7)
// TRISF<TRISF0>
extern volatile __bit                   TRISF0              __at(0xC28);	// @ (0x185 * 8 + 0)
#define                                 TRISF0_bit          _BIT_ACCESS(TRISF,0)
// TRISF<TRISF1>
extern volatile __bit                   TRISF1              __at(0xC29);	// @ (0x185 * 8 + 1)
#define                                 TRISF1_bit          _BIT_ACCESS(TRISF,1)
// TRISF<TRISF2>
extern volatile __bit                   TRISF2              __at(0xC2A);	// @ (0x185 * 8 + 2)
#define                                 TRISF2_bit          _BIT_ACCESS(TRISF,2)
// TRISF<TRISF3>
extern volatile __bit                   TRISF3              __at(0xC2B);	// @ (0x185 * 8 + 3)
#define                                 TRISF3_bit          _BIT_ACCESS(TRISF,3)
// TRISF<TRISF4>
extern volatile __bit                   TRISF4              __at(0xC2C);	// @ (0x185 * 8 + 4)
#define                                 TRISF4_bit          _BIT_ACCESS(TRISF,4)
// TRISF<TRISF5>
extern volatile __bit                   TRISF5              __at(0xC2D);	// @ (0x185 * 8 + 5)
#define                                 TRISF5_bit          _BIT_ACCESS(TRISF,5)
// TRISF<TRISF6>
extern volatile __bit                   TRISF6              __at(0xC2E);	// @ (0x185 * 8 + 6)
#define                                 TRISF6_bit          _BIT_ACCESS(TRISF,6)
// TRISF<TRISF7>
extern volatile __bit                   TRISF7              __at(0xC2F);	// @ (0x185 * 8 + 7)
#define                                 TRISF7_bit          _BIT_ACCESS(TRISF,7)
// TRISG<TRISG0>
